Repository: sxm5220/sxm-ios
Catalog: Ninebot/*.lproj/Localizable.strings
Languages: ar, fr, ja, ko, zh_hans

# RollAngleRate
source: The current roll angle speed
ar: السرعة الموافقة لزاوية المحور الجانبي الحالية
fr: La vitesse d’angle du roulis actuel
ja: 瞬間ロール角速度
ko: 현재 회전 각속도
zh_hans: 当前滚转角速度

# BackAngle
source: The current rear angle of elevation
ar: الزاوية الخلفية الحالية للارتفاع
fr: L’angle actuel d’élévation arrière
ja: 現在後ろ傾き角度
ko: 수평 후면 각도
zh_hans: 当前后仰角

# pwmOutput
source: Current PWM value
ar: الحاليةPWM قيمة
fr: Valeur PWM actuelle
ja: 現在PWM値
ko: 현재PWM(pulse width modulation)값
zh_hans: 当前PWM值

source: Version:
ar: نسخة:
ja: バージョン:
ko: 버전:
zh_hans: 版本:

# UpdateFWTip
source: Your firmware is up to date.
ar: البرنامج الثابت الحالي للمركبة هو الأحدث!
fr: Votre logiciel est à jour
ja: 現在の車両ファームウェアは最新です。
ko: 현재 펌웨어는 최신버전입니다.!
zh_hans: 当前车辆固件是最新的！

# DashBoardNeedUpdate
source: The instrument firmware needs to update!
ar: البرنامج الثابت للجهاز بحاجة لإلى تحديث!
fr: Le logiciel a besoin d’être à jour
ja: ダッシュボードファームウェアをアップデートする必要があります。
ko: 계기판 펌웨어 업데이트 필요
zh_hans: 仪表盘固件需要更新！

# DriveNeedUpdate
source: The drive firmware need to update!
ar: برنامج القيادة بحاجة لتحديث!
fr: Le logiciel de conduite a besoin d’être à jour
ja: 駆動ファームウェアをアップデートする必要があります。
ko: 구동펌웨어 업데이트 필요
zh_hans: 驱动固件需要更新！

# AHRSNeedUpdate
source: The AHRS firmware need to update!
ar: بحاجة لتحديث! AHRS برنامج
fr: Le logiciel AHRS a besoin d’être à jour
ja: AHRSファームウェアをアップデートする必要があります。
ko: AHRS펌웨어 업데이트 필요
zh_hans: AHRS固件需要更新！

# MasterNeedUpdate
source: The master firmware need to update!
ar: البرنامج الثابت الرئيسي بحاجة لتحديث!
fr: Le logiciel master a besoin d’être à jour
ja: メインコントロールファームウェアをアップデートする必要があります。
ko: 마스터 펌웨어 필요
zh_hans: 主控固件需要更新！

# TeleCtrl Max Forward Speed
source: The maximum forwarding speed under the remote control mode
ar: سرعة الانطلاق للأمام القصوى في وضع التحكم عن بعد
fr: La vitesse maximale en dessous du mode Télécommandé.
ja: リモートコントロールモード最大前進速度
ko: 제어모델 최대전진속도
zh_hans: 遥控模式最大前进速度

# TeleCtrl Max Roll Speed
source: The maximum steering speed under the remote control mode
ar: السرعة القصوى في توجيه السيارة في وضع التحكم عن بعد
fr: La vitesse pilotée maximale en dessous du mode Télécommandé.
ja: リモートコントロールモード最大ステアリング速度
ko: 제어모델 최대회전속도
zh_hans: 遥控模式最大转向速度

# TeleCtrl Max Acce Speed
source: The maximum accelerated speed under the remote control mode
ar: شدة التسارع القصوى في وضع التحكم عن بعد
fr: La vitesse accélérée maximale en dessous du mode Télécommandé.
ja: リモートコントロールモード最大加速度
ko: 제어모델 최대가속도
zh_hans: 遥控模式最大加速度

# LightsSettings
source: Settings of vehicle lights
ar: إعدادات إنارة المركبة
fr: Paramétrage des lumières du véhicule
ja: 車両LED設定
ko: 차체 라이트 설정
zh_hans: 车辆灯光设置

# ForwardLED
source: Forwarding light
ar: الإنارة الأمامية
fr: Lumière avant
ja: フロントLED
ko: 전면LED
zh_hans: 前向灯

# ForwardLEDMode
source: Forwarding light mode
ar: وضعية الإنارة الأمامية
fr: Paramètre des lumières avant
ja: フロントLED点灯モード
ko: 전면LED모드
zh_hans: 前向灯模式

# ForwardLEDSwitchingCycle
source: Switching period of forwarding light
ar: مدة تبديل الإنارة الأمامية
fr: Période de changement des lumières avant
ja: フロントLED電源周期
ko: 전면LED 작동 주기
zh_hans: 前向灯开关周期

# ForwardLEDAutoBrightness
source: Auto Brightness
ar: سطوع أوتوماتيكي
fr: Luminosité automatique
ja: フロントLED輝度自動調節
ko: 전면LED밝기자동조절
zh_hans: 前向灯亮度自动调节

# Brightness
source: Brightness value
ar: قيمة السطوع
fr: Valeur de luminosité
ja: 輝度値
ko: 밝기
zh_hans: 亮度值

# Always
source: Normally on mode
ar: على هذه الوضعية عادة
fr: Mode Normal
ja: 常時点灯モード
ko: 항시 켜짐 모드
zh_hans: 常亮模式

source: Breathing mode
ar: وضعية التنفس
fr: Mode Souffle
ja: 点灯モード1
ko: 점멸 모드1
zh_hans: 呼吸模式

source: Blinking mode
ar: وضعية الومض
fr: Mode Clignotement
ja: 点灯モード2
ko: 점멸 모드2
zh_hans: 闪烁模式

# LeftScrollingMode
source: Left marquee mode
ar: وضعية الضوء الأيسر
fr: Mode déroulant gauche
ja: 点灯モード3
ko: 좌측 스크롤링 라이트 모드
zh_hans: 左跑马灯模式

# RightScrollingMode
source: Right marquee mode
ar: وضعية الضوء الأيسر
fr: Mode déroulant droit
ja: 点灯モード4
ko: 우측 스크롤링 라이트 모드
zh_hans: 右跑马灯模式

# BothwayScrollingMode
source: Bidirectional marquee mode
ar: وضعية الإضاءة الثنائية الاتجاه
fr: Mode déroulant bidirectionnel
ja: 点灯モード5
ko: 양측 스크롤링 라이트 모드
zh_hans: 双向跑马灯模式

source: Off
ar: إيقاف؛
ja: 終了
zh_hans: 关闭

# HandleLED
source: Handle light
ar: إنارة المقبض
fr: Lumière portée
ja: ステアリングバーLED
ko: 손잡이 라이트
zh_hans: 手把灯

# HandleLEDMode
source: Handle light mode
ar: وضعية إنارة المقبض
fr: Mode Lumière portée
ja: ステアリングバーLED点灯モード
ko: 손잡이 라이트 모드
zh_hans: 手把灯模式

# HandleLEDSwitchingCycle
source: Switch period of handle light
ar: مدة التبديل لإنارة المقبض
fr: Lumière portée changeante
ja: ステアリングバーLED電源周期
ko: 손잡이 라이트 자동 밝기 조절
zh_hans: 手把灯开关周期

# HandleLEDAutoBrightness
source: Handle light brightness automatically adjust
ar: المعايرة الأوتوماتيكية لسطوع إنارة المقبض
fr: Ajustement automatique de la luminosité de la lumière portée
ja: ステアリングバーLED輝度自動調節
ko: 손잡이등불 밝음도 자동조절
zh_hans: 手把灯亮度自动调节

# DirtboardLED
source: Dirtboard light
ar: الضوء الخلفي
fr: Lumière de bord
ja: フェンダーLED
ko: 사이드LED
zh_hans: 挡泥板灯

# DirtboardLEDMode
source: Dirtboard light mode
ar: وضعية الضوء الخلفي
fr: Mode Lumière de bord
ja: フェンダーLED点灯モード
ko: 사이드LED 모드
zh_hans: 挡泥板灯模式

# DirtboardLEDSwitchingCycle
source: Switch period of dirtboard light
ar: مدة التبديل لإنارة الضوء الخلفي
fr: Lumière de bord changeante
ja: フェンダーLED電源周期
ko: 사이드LED 작동 주기
zh_hans: 挡泥板灯开关周期

# DirtboardLEDAutoBrightness
source: Dirtboard light brightness automatically adjust
ar: المعايرة الأوتوماتيكية لسطوع إنارة الضوء الخلفي
fr: Ajustement automatique de la luminosité de la lumière de bord
ja: フェンダーLED輝度自動調節
ko: 사이드LED 밝기 자동 조절
zh_hans: 挡泥板灯亮度自动调节

# SoundSetting
source: Sound and alarm settings
ar: إعدادات الصوت والإنذار
fr: Paramètres des sons et alarmes
ja: サウンドと警告音設定
ko: 사운드 설정
zh_hans: 声音和报警设置

# ONOFFMusic
source: Voice of startup and shutdown
ar: صوت بدء التشغيل والإغلاق
fr: Voix de démarrage et d’arrêt
ja: 起動音と終了音
ko: 음량 On/Off
zh_hans: 开关机声音

source: Tip sound
ar: صوت التلميحات
fr: Son de conseil
ja: リマインドサウンド
ko: 적정 음량
zh_hans: 提示声音

# Alarm
source: Alarm settings
ar: إعدادات الإنذار
fr: Paramètres d’alarmes
ja: 警告音設定
ko: 알람 설정
zh_hans: 报警设置

source: Mode
ar: وضعية
ja: モード
ko: 모드
zh_hans: 模式

source: Default mode
ar: الوضعية الافتراضية
fr: Mode par défaut
ja: デフォルトモード
ko: 기본모드
zh_hans: 默认模式

source: Scale mode
ar: وضعية القياس
fr: Mode d’échelle
ja: スケールモード
ko: 음향 편집 모드
zh_hans: 音阶模式

source: Scale sequence
ar: تتابع القياس
fr: Séquence d’échelle
ja: スケールシーケンス
ko: 음향 편집 번호
zh_hans: 音阶序列

source: Volume
ar: مدى حجم
ja: ボリューム
ko: 소리크기
zh_hans: 音量

# BackAlarm
source: Back too fast alarm
ar: الإنذار الخلفي السريع جداً
fr: Alarme de retour trop rapide
ja: バックスピードオーバー警告
ko: 후진 과속 경고
zh_hans: 后退过快报警

# AttitudeSensor
source: Calibrate balance sensor
ar: حساس الاتجاه
fr: Calibration du capteur d’assiette
ja: 姿勢センサー
ko: 균형 센서
zh_hans: 姿态传感器

# AttitudeSensorCalibration
source: Calibrate balance sensor
ar: معايرة حساس الاتجاه
fr: Calibration du capteur d’assiette
ja: 姿勢センサー校正
ko: 수평센서 초기화
zh_hans: 姿态传感器校准

source: Steering sensitivity
ar: حساسية القيادة
fr: Sensibilité de la direction(gauche-droite)
ja: ステアリング感度
ko: 회전 감도
zh_hans: 转向灵敏度

# SteeringsensitivityAutoBrightness
source: Automatically adjust steering sensitivity
ar: المعايرة الأوتوماتيكية لحساسية القيادة
fr: Ajustement automatique de la sensibilité de la direction
ja: ステアリング感度自動調節
ko: 회전 감도 자동조절
zh_hans: 转向灵敏度自动调节

# SteeringsensitivityValue
source: Sensitivity
ar: مدى حساسية
fr: Sensibilité avant-arrière
ja: 感度
ko: 감도
zh_hans: 灵敏度

source: Other Settings
ar: إعدادات اخرى
fr: Autres paramètres
ja: その他設定
ko: 기타 설정
zh_hans: 其他设置

# RebootNinebot
source: Restart vehicle
ar: إعادة تشغيل ناينبوت
fr: Rallumer véhicule
ja: 車両を再起動
ko: 차량 재부팅
zh_hans: 重启车辆

# ShutdownNinebot
source: Close vehicle
ar: إغلاق ناينبوت
fr: Eteindre le véhicule
ja: 車両をシャットダウン
ko: 차량 종료
zh_hans: 关闭车辆

# FreeMode
source: Open free mode
ar: فتح الوضعية الحرة
fr: Mode Ouvert
ja: フリーモード起動
ko: 프리모드 켜기
zh_hans: 开启自由模式

# SetBluetoothPairingCode
source: Set the Bluetooth pairing code
ar: قم بإعداد رمز اقتران البلوتوث
fr: Mettre en place un code d’appairage Bluetooth
ja: ブルートゥースペアリングコード設定
ko: 블루투스 비밀번호 설정
zh_hans: 设置蓝牙配对码

# UpdateSerialNumber
source: Set the serial No.
ar: تعديل الرقم التسلسلي
fr: Mettre en place le numéro de série(réservé au SAV)
ja: 車両シリアルナンバー設定
ko: 시리얼번호 설정(관리자외 사용불가)
zh_hans: 设置车辆序列号

# nb_useLargeBattery
source: Using large-capacity battery
ar: استخدام بطارية ذات استطاعة عالية
fr: Utiliser la batterie à haute capacité
ja: 現在使用中のバッテリーは大容量バッテリーです
ko: 대용량 배터리 사용
zh_hans: 使用的是大容量电池

# nb_getoff
source: Enter standby condition after you get off
ar: الدخول بحالة الاستعداد بعد النزول
fr: Renseignez les conditions Standby après être descendu
ja: 車両から降りると待機モードになります。
ko: 하차후 자동 대기모드
zh_hans: 下车后进入待机状态

source: Cancel
ar: إلغاء
fr: Annuler
ja: 取消
ko: 취소
zh_hans: 取消

source: Save
ar: حفظ
fr: Sauvegarder
ja: 保存
ko: 저장
zh_hans: 保存

# TargetNumber
source: Target serial No.:
ar: الرقم التسلسلي المستهدف:
fr: Numéro de série cible :.:
ja: 変更後のシリアルナンバー:
ko: 변경할 시리얼번호 입력란:
zh_hans: 目标序列号:

# TargetNumberError
source: Target serial No. is incorrect
ar: الرقم التسلسلي المستهدف خاطئ
fr: Le numéro de série cible est incorrect
ja: 変更後のシリアルナンバーが間違っています。
ko: 대상 시리얼 번호 오류!
zh_hans: 目标序列号有误！

# SeriNum
source: Current serial No.:
ar: الرقم التسلسلي الحالي
fr: Numéro de série actuel:
ja: 現在のシリアルナンバー:
ko: 현재 시리얼번호:
zh_hans: 当前序列号:

# PasswordError
source: Input of verification code is incorrect!
ar: إدخال رمز التفعيل غير صحيح
fr: Le code de vérification est incorrect
ja: 認証コードの入力が間違っています。
ko: 인증번호 오류!
zh_hans: 验证码输入错误！

# Password
source: Verification code:
ar: رمز التفعيل:
fr: Code de vérification:
ja: 認証コード:
ko: 인증번호:
zh_hans: 验证码:

# Km_Miles
source: Settings of metric system
ar: إعدادات النظام المتري
fr: Paramètres du système métrique
ja: 距離単位設定
ko: 단위 설정
zh_hans: 公英制设置

# km
source: Metric System
ar: النظام المتري
fr: Système métrique
ja: キロメートル（km）
ko: 미터법
zh_hans: 公制

# miles
source: Imperial System
ar: النظام باللغة الإنكليزية
fr: Système impérial
ja: マイル（mile）
ko: 마일법
zh_hans: 英制

# CauseOfError
source: Reasons that possibly cause:
ar: الأسباب التي قد تسبب:
fr: Raisons qui peuvent causer:
ja: 可能と考えられる原因:
ko: 문제 원인:
zh_hans: 可能导致的原因:

# SolutionSuggestion
source: Corresponding solutions:
ar: حلول مقابلة:
fr: Solutions correspondantes:
ja: 対応方法:
ko: 해결 방법:
zh_hans: 对应解决办法:

# ErrCodeDesc1_8
source: Sensor of motor or driver is abnormal
ar: حساس المحرك أو السائق غير طبيعي
fr: Le capteur du moteur ou du conducteur est anormal
ja: モーター/駆動センサー異常
ko: 전기 혹은 드라이브센서 이상
zh_hans: 电机或驱动器传感器异常

# ErrCodeDesc9_12
source: High-power switch tube of driver is damaged
ar: أنبوب مفتاح الطاقة العالية معطوب
fr: Le conduit de haute puissance du conducteur est endommagé
ja: 駆動部大容量スイッチ管損傷
ko: 드라이브 출력 스위츠 선로 손상
zh_hans: 驱动器大功率开关管损坏

# ErrCodeDesc13_19
source: Other faults of motor driver of vehicle
ar: أعطال أخرى في محرك المركبة
fr: Autres défauts du moteur du véhicule
ja: 車両モーターの駆動部その他故障
ko: 차량전기 드라이브 기타 고장
zh_hans: 车辆电机驱动器其他故障

# ErrCodeDesc20_29
source: Attitude sensor of vehicle is abnormal
ar: حساس ميول المركبة غير طبيعي
fr: Le capteur de sensibilité est anormal
ja: 車両姿勢センサー異常
ko: 차량 균형센서 이상
zh_hans: 车辆姿态传感器异常

# ErrCodeDesc30_34
source: Internal communication of vehicle is abnormal
ar: الاتصالات الداخلية للمركبة غير طبيعية
fr: La communication interne du véhicule est anormale
ja: 車両内部通信異常
ko: 차량 내부 통신 이상
zh_hans: 车辆内部通讯异常

# ErrCodeDesc35
source: Commutation circuit of battery is abnormal
ar: دارة مبادلة البطارية غير طبيعية
fr: La communication du circuit de la batterie est anormale.
ja: バッテリー回路切替異常
ko: 배터리 전환회로 이상
zh_hans: 电池切换电路异常

# ErrCodeDesc36
source: Output of battery 1 is abnormal
ar: مخرج البطارية 1 غير طبيعي
fr: L’entrée de la batterie 1 est anormale
ja: バッテリー1出力異常
ko: 배터리1 출력이상
zh_hans: 电池1输出异常

# ErrCodeDesc37
source: Output of battery 2 is abnormal
ar: مخرج البطارية 2 غير طبيعي
fr: L’entrée de la batterie 2 est anormale
ja: バッテリー2出力異常
ko: 배터리2 출력이상
zh_hans: 电池2输出异常

# ErrCodeDesc38
source: Temperature of battery 1 is abnormal
ar: حرارة البطارية 1 غير طبيعية
fr: La température de la batterie 1 est anormale
ja: バッテリー1温度異常
ko: 배터리1 온도이상
zh_hans: 电池1温度异常

# ErrCodeDesc39
source: Temperature of battery 2 is abnormal
ar: حرارة البطارية 2 غير طبيعية
fr: La température de la batterie 2 est anormale
ja: バッテリー2温度異常
ko: 배터리2 온도이상
zh_hans: 电池2温度异常

# ErrCodeDesc40
source: Pedal sensor of human body is abnormal
ar: حساس دواسة جسم الإنسان غير طبيعي
fr: Le capteur du pédalier est anormal.
ja: フットマットセンサー異常
ko: 발판 센서 이상
zh_hans: 人体脚踏传感器异常

# ErrCodeDesc41_42
source: 12VDC or 5VDC low voltage power output inside the vehicle body is abnormal
ar: تيار الجهد المنخفض الخارج 12 فولت أو 5 فولت داخل جسم المركبة غير طبيعي
fr: L’entrée de courant 12VDC ou 5VDC à l’intérieur du véhicule est anormale
ja: 車体内部12VDCもしくは5VDC低電圧電源出力異常
ko: 차체내부12VDC 혹 5VDC저압전원출력이상
zh_hans: 车体内部12VDC或5VDC低压电源输出异常

# ErrCodeDesc43
source: Charger is abnormal
ar: الشاحن غير طبيعي
fr: Chargeur anormal
ja: 充電器異常
ko: 충전기 이상
zh_hans: 充电器异常

# ErrCodeDesc44
source: Reservation of delivery test
ar: حجز لاختبار التسليم
fr: Test de réservation
ja: 初期テスト保留
ko: 출고 테스트 보류
zh_hans: 出厂测试保留

# ErrCodeDesc45
source: Dip angle of the vehicle is too large in the process of driving
ar: زاوية الانخفاض للسيارة كبيرة جدا في عملية القيادة
fr: L’angle d’inclinaison est trop important dans la conduite.
ja: 運転中の車両角度オーバー
ko: 주행 제한 각도 초과
zh_hans: 驾驶过程中车辆倾角过大

# ErrCodeDesc46
source: Undefined error code
ar: رمز خطأ غير محدد
fr: Code d’erreur indéfini
ja: 未定義のエラーコード
ko: 컨트롤 프로그램 이상
zh_hans: 未定义的错误代码

# ErrCodeCause1_8
source: 1.Fierce strike 2.Motor sensor is damaged due to electrical fault of inner elements 3.Occasional abnormal detection during starting up self-inspection
ar: أولا/ضربة عنيفة. ثانيا/حساس المحرك متضرر بسبب عطل كهربائي في العناصر الداخلية. ثالثا/ كشف غير طبيعي أثناء بدء تشغيل الفحص الذاتي
fr: 1.Important dégât. 2. Le capteur du moteur est endommagé à cause d’un défaut électrique d’un composant interne. 3.Détections anormales occasionnelles pendant une auto inspection
ja: 1. 強い衝撃 2. 内部電気部品故障によるモーターセンサー破損 3. 本体起動時に自己検査する際に発生した検査異常。
ko: 1.강한충격 2.내부 고장으로 인해 모터 신호감응장치 파손 3. POST과정에 우연히 나타나는 검측 이상입니다.
zh_hans: 1.剧烈撞击 2.内部元件电气故障导致的电机传感器损坏 3.开机自检过程中偶然出现的检测异常

# ErrCodeCause9_12
source: Generally, velocity jump caused by fierce strike, revolving tyre at a high speed stuck by foreign object or overhigh voltage, overhigh current caused by long term overloading, or overhigh environment temperature may result in damage of driver MOSFET transistor. Generally, state of 'Tyre locked firmly' appears in accompany with the condition, i.e., it is difficult to drag Ninebot.
ar: عموماً, قفزة قوية بسبب ضربة عنيفة, يدور الإطار بسرعة عالية عالقاً بجسم غريب أو توتر عالي, التيار الفوق العالي بسبب الحمل الزائد لمدة طويلة, أو حرارة الجو الفوق العالية قد تتسبب بعطل في ترانزيستور الآلة. عموماً, حالة ' الإطار مقفل بإحكام' تظهر مرافقة لهذه المشكلة’ مثال, إنه من الصعب سحب ناينبوت
fr: Généralement, les sauts de vitesse sont causés par un important dégât, le pneu est coincé à grande vitesse par un objet extérieur, ou à cause d’une surtension, ou une température extérieure trop importante, ce qui peut entraîner des dommages sur le programme de pilote MOSFET.Généralement, la mention « Pneu bloqué » apparait, accompagné par les conditions, i.e, il est difficile de tirer Ninebot.
ja: 考えられる原因：強い衝撃や回転中のタイヤに異物が挟まることによる長時間の電流・電圧の過負荷や高い環境温度が駆動MOSFETトランジスタに損傷を与えています。この状況では「タイヤがロックされてしまう」現象が発生します。事故や故障に繋がる恐れがあり、車体を移動させることも困難になります。
ko: 이런 경우는 흔히 강한 충격으로 발생하는 속도 돌변 또는 고속으로 회전되는 타이어가 이물질에 의해 멈추거나 장시간 과하중에 의한 과전압,과전류 혹은 환경온도가 고온일 경우 구동장치의 트랜지스터 파손입니다. 이런 경우 타이어 부하현상(타이어 걸림)이 동반될 가능성이 큽니다.
zh_hans: 通常可能由猛烈的撞击而引起的速度突变、高速旋转的轮胎被外物卡死或长时间过载而引起电压过高、电流过大，或者环境温度过高可能会导致驱动器MOSFET晶体管损坏。这种情况下通常伴随出现 '轮胎锁死'状态，即拖动车辆很困难。

# ErrCodeCause13_19
source: Generally, reasons are power switch transistor is abnormal, or update of firmware of motor driver fails
ar: عموما, الأسباب هي أن ترانزيستور مفتاح الطاقة غير طبيعي, أو بسبب فشل تحديث البرنامج الثابت لمحرك الآلة.
fr: Généralement, les raisons sont un changement de puissance sur le transistor anormal, ou un échec de la mise à jour du programme du moteur.
ja: 考えられる原因：電源スイッチトランジスタ異常。もしくはモーターの駆動部ファームウェアのアップデート失敗
ko: 흔히 전원 스위치 트랜지스터 이상이나 모터 구동장치 펌웨어 업데이트 실패로 인한 고장입니다.
zh_hans: 通常原因为电源开关晶体管异常，或更新电机驱动器固件失败.

# ErrCodeCause20_29
source: 1.vehicle body of Ninebot is fiercely struck, which results in dislocation or damage of attitude sensor 2.Components and parts of attitude sensor break down 3.Electromagnetic interference causes attitude sensor of the vehicle to give abnormal signals 4.Occasional abnormal detection during starting up self-inspection
ar: أولا/ جسم الناينبوت ضرب بقوة مما سبب بتغيير مكان أو تعطيل حساس الميول. ثانيا/ مكونات وأجزاء حساس الميول تفككت. ثالثا/ التداخل الكهروميغناطيسي يتسبب في جعل حساس ميول السيارة يعطي إشارات غير طبيعية. رابعا/ كشف غير طبيعي عارض خلال بدء تشغيل الفحص الذاتي
fr: 1.Le véhicule Ninebot est verrouillée, ce qui résulte d’un dégât du capteur de sensibilité. 2. Les composants et les parties du capteur de sensibilité sont endommagés. 3. Des interférences électromagnétiques donnent de mauvais des signes anormaux au véhicule. 4.Une détection anormale occasionnelle pendant une auto-inspection.
ja: 1. Ninebot本体が強い衝撃を受けて姿勢センサーのズレ/破損 2. 姿勢センサー部品故障 3. 電磁妨害による車両姿勢センサー異常。発信 4. 本体起動時に自己検査する際にたまに発生した検査異常。
ko: 1.강한 충격으로 인해 수평 감응장치 이상 또는 파손 2.수평 감응장치의 소자 고장 3.전자파의 영향을 받아 차체 수평 감응장치 신호 이상 4. POST과정 중 우연히 발생하는 검측 이상입니다.
zh_hans: 1.车身受到剧烈撞击导致姿态传感器错位或损坏 2.姿态传感器元器件出现故障 3.电磁干扰导致的车辆姿态传感器出现异常信号 4.开机自检过程中偶然出现的检测异常

# ErrCodeCause30_34
source: 1.Looseness of 6 lock screws between upside and downside of handlebar causes bad contact 2.Looseness of internal cable and contact of the vehicle body causes bad contact 3.Components and parts related to internal communication of vehicle body break down
ar: أولاً/ انحلال 6 براغي بين الوجه العلوي والسفلي للمقبض سببت الاتصال السيئ. ثانياً/ انحلال الكابل الداخلي واتصاله بجسم السيارة مسبباً الاتصال السيئ. ثالثاً/ مكونات وأجزاء التوصيل الداخلي لجسم السيارة تفككت.
fr: 1.La perte de 6 vis de verrouillage entre le bas et le haut du guidon peut causer un mauvais contact 2. La perte du câble interne cause un mauvais contact 3. Les composants et les parties relatives à la communication interne du véhicule sont endommagés.
ja: 1. ステアリングバーとハンドルバーの間の6本のネジの緩みによる接触不良 2. 車体内部のコード/接続口の緩みによる接触不良 3. 車体内部通信関係の部品故障
ko: 1.핸들바 상단과 하단을 연결하는 6개의 나사가 느슨해져 발생하는 접촉불량 2.차체 내부 노선, 연결 단자가 느슨해져 발생하는 접촉 불량 3.차체 내부 통신관련 소자,부품고장입니다.
zh_hans: 1.手把上段与下段之间的6个锁紧螺丝松动而导致接触不良 2.车体内部线缆、接头松动而导致接触不良 3.车体内部通讯相关元器件故障

# ErrCodeCause35
source: Hot backup protection commutation circuit of internal battery of the vehicle is abnormal
ar: دارة مبادلة الحماية الداعمة للبطارية الداخلية للمركبة غير طبيعية
fr: La température de la protection arrière du circuit de communication de la batterie est anormale.
ja: 車両内部のバッテリー過熱バックアップ保護切替回路異常。
ko: 차체 내부 배터리 핫백업 보호 전환 회로 이상
zh_hans: 车辆内部电池热备份保护切换电路出现异常

# ErrCodeCause36
source: Over discharge, disconnection of battery 1 or short circuit protection appears
ar: التفريغ الزائد, فصل البطارية 1 أو يظهر ماس بحماية الدارة
fr: Surcharge, déconnection de la batterie 1, ou court-circuit de la protection sont apparus.
ja: バッテリー1過放電/開回路/ショートの保護
ko: 1번 배터리 과방전, 전기 회로 끊김 또는 접선 등에 대해 보호 기능 작동
zh_hans: 电池1过放、断路或出现短路保护

# ErrCodeCause37
source: Over discharge, disconnection of battery 2 or short circuit protection appears
ar: التفريغ الزائد, فصل البطارية 2 أو يظهر ماس بحماية الدارة
fr: Surcharge, déconnection de la batterie 2, ou court-circuit de la protection sont apparus
ja: バッテリー2過放電/開回路/ショートの保護
ko: 2번 배터리 과방전, 전기 회로 끊김 또는 접선 등에 대해 보호 기능 작동
zh_hans: 电池2过放、断路或出现短路保护

# ErrCodeCause38
source: 1.Abnormal high temperature is generated in battery 1 due to short circuit 2.Damage of temperature sensor in battery interior 3.Environment temperature is too high or too low
ar: أولا/ حرارة عالية غير طبيعية تولدت في البطارية 1 بسبب ماس بالدارة. ثانيا/ تعطل حساس الحرارة في البطارية الداخلية. ثالثا/ حرارة الجو مرتفعة جداً أو منخفضة جداً
fr: 1.Une température anormale est générée dans la batterie 1 à cause d’un court-circuit. 2.Dommage du capteur de température de la batterie. 3.La température extérieure est trop élevée ou trop basse.
ja: 1. バッテリー1の内部ショートによる過熱 2. バッテリー内部温度センサー破損 3. 気温による異常。（高温/低温環境）
ko: 1.1번 배터리 내부 접선으로 인한 고온현상 2.배터리 내부 온도 감응장치 고장 3.환경온도가 너무 높거나 낮음
zh_hans: 1.电池1内部有短路而产生异常高温 2.电池内部温度传感器损坏 3.环境温度过高或过低

# ErrCodeCause39
source: 1. Abnormal high temperature is generated in battery 1 due to short circuit 2.Damage of temperature sensor in battery interior 3.Environment temperature is too high or too low
ar: أولا/ حرارة عالية غير طبيعية تولدت في البطارية 2 بسبب ماس بالدارة. ثانيا/ تعطل حساس الحرارة في البطارية الداخلية. ثالثا/ حرارة الجو مرتفعة جداً أو منخفضة جدا
fr: 1.Une température anormale est générée dans la batterie 1 à cause d’un court-circuit. 2.Dommage du capteur de température de la batterie. 3.La température extérieure est trop élevée ou trop basse.
ja: 1. バッテリー2の内部ショートによる過熱 2. バッテリー内部温度センサー破損 3. 気温による異常。（高温/低温環境）
ko: 1.2번 배터리 내부 접선으로 인한 고온현상 2.배터리 내부 온도 감응장치 고장 3.환경온도가 너무 높거나 낮음
zh_hans: 1.电池1内部有短路而产生异常高温 2.电池内部温度传感器损坏 3.环境温度过高或过低

# ErrCodeCause40
source: 1.Pedal sensor of human body is invalid 2.Transformation of pedal panel results in that pedal sensor fails to work
ar: أولا/ دواسة جسم الإنسان غير مقبولة. ثانيا/ التحويل في لوح الدواسة ينتج عنه أن حساس الدواسة لا يعمل.
fr: 1.Le capteur du pied ne fonctionne pas. 2. La modification du panneau de la pédale résulte du dysfonctionnement de ce capteur.
ja: 1. フットマットセンサー無効 2. フットマットの変形によるフットマットセンサーの動作無効化
ko: 1.발판 감응장치 오작동 2.발판 기판 변형으로 인한 발판 감응장치 작동 불가
zh_hans: 1.人体脚踏传感器失效 2.脚踏面板变形导致脚踏传感器无法工作

# ErrCodeCause41_42
source: 1.Power supply load of handlebar USB is too heavy or short circuit (over 5VDC/1.5A) 2.Output short circuit of interior 12VDC power or 5 VDC power 3.Power circuit is damaged
ar: أولا/ حمل مزود طاقة مأخذ USBللمقبض ثقيل أو يوجد ماس بالدارة (فوق 5 فولت/ 1.5 أمبير). ثانيا/ ماس بدارة مخرج الطاقة الداخلي 12 فولت أو 5 فولت. ثالثا/ دارة الطاقة معطلة.
fr: 1.La puissance fournie par la charge USB du guidon est trop importante ou il y a un court-circuit.(plus de 5VDC/1.5A) 2.Court-circuit interne 12VDC ou 5 VDC 3.Le circuit électrique est endommagé
ja: 1. ステアリングバーのUSB給電過負荷やショート（5VDC/1.5A超過） 2. 内部12VDC電源/5VDC電源出力ショート 3.電源回路破損
ko: 1.핸들봉 USB전원 공급 과부하 또는 접선(5VDC/1.5A초과) 2.내부12VDC전원 또는5VDC전원 수출 접선 3.전원 회로 파손
zh_hans: 1.手把USB供电负载过大或短路（超过5VDC/1.5A） 2.内部12VDC电源或5VDC电源输出短路 3.电源电路损坏

# ErrCodeCause43
source: Charger output is abnormal, it is unable to charge Ninebot normally
ar: مخرج الشاحن غير طبيعي, هو غير قادر على شحن ناينبوت بشكل طبيعي
fr: Le chargeur est anormal, il est impossible de charger Ninebot normalement.
ja: 充電器出力異常。Ninebot正常充電不能
ko: 충전기 전원 공급 이상，정상적인 충전 불가
zh_hans: 充电器输出异常，无法正常为车辆充电

# ErrCodeCause44
source: Reservation of delivery test
ar: الحجز لاختبار التسليم
fr: Test de réservation
ja: 工場初期テスト保留
ko: 출하 테스트 보류
zh_hans: 出厂测试保留

# ErrCodeCause45
source: Pitching angle or roll angle is too large when Ninebot is driving. The error will appear generally when galloping falls over accidentally or vehicle falls down due to losing balance
ar: زاوية الميل الجانبية أو الأمامية كبيرة جداً عند قيادة ناينبوت. سيظهر الخطأ عموماً عندما يقع الراكب عن طريق الخطأ أو عندما تقع المركبة بسبب فقدان التوازن.
fr: L’angle du terrain ou de roulis est trop important quand le Ninebot est conduit. L’erreur apparait généralement quand le véhicule tombe accidentellement à cause d’un problème d’équilibre.
ja: 走行中にピッチ角やロール角が大きすぎることによる本体転倒や飛出しなどバランスを失うなどでこのエラーが発生します。
ko: 주행 중 기울림 각도, 회전각도가 규정 범위를 벗어날 경우 발생하는 고장, 통상적으로 넘어지거나 충격으로 인한 에러코드 입니다.
zh_hans: 车辆行驶过程中俯仰角或滚转角过大。通常在意外飞车摔倒或车辆失去平衡跌倒之后会出现这个错误
