Repository: sxm5220/sxm-ios
Catalog: Ninebot/*.lproj/Localizable.strings
Languages: ar, fr, ja, ko, zh_hans

# NORank_conn
source: Ranking unavailable (Please connect the vehicle)
ar: التصنيف غير متوفر(الرجاء الاتصال بالمركبة)
fr: Classement indisponible (connectez le véhicule)
ja: ランキングに入っていません(車両を接続してください)
ko: 랭킹 정보가 없습니다. (로그인 바랍니다.)
zh_hans: 暂无排名(请连车)

# NO_CONN
source: Network connection request no response!
ar: ليس هناك تجاوب لطلب الاتصال بالموقع
fr: Pas de réponse à la demande de connexion au réseau!
ja: ネット接続リクエスト応答なし。
ko: 네트워크에 연결할 수 없음!
zh_hans: 网络连接请求无响应！

source: Username
ar: اسم المستخدم
fr: Nom d’utilisateur
ja: ユーザー名
ko: 닉네임
zh_hans: 用户名

# user_pwd
source: Password
ar: كلمة المرور
fr: Mot de passe
ja: パスワード
ko: 비밀번호
zh_hans: 密码

# user_Tpwd
source: Confirm password
ar: تأكيد كلمة المرور
fr: Confirmer le mot de passe
ja: パスワード確認
ko: 비밀번호 재확인
zh_hans: 确认密码

# user_email
source: E-mail
ar: صندوق البريد
ja: メールアドレス
ko: 이메일
zh_hans: 邮箱

# nameLength
source: The length of username is 3-15
ar: طول اسم المستخدم هو من 3-15
fr: La longueur d’un nom d’utilisateur doit être comprise entre 3 et 15 caractères
ja: ユーザー名は3-15文字です
ko: 아이디는 3-15자리입니다.
zh_hans: 用户名长度为3-15

# pwdLength
source: The length of password is 6-20
ar: طول كلمة المرور هو من 6-18
fr: La longueur d’un mot de passe doit être comprise entre 6 et 20 caractères
ja: パスワードは6-20文字です
ko: 비밀번호는 6-20자리입니다.
zh_hans: 密码长度为6-20

# pwdCheck
source: The password shall include letter and numeric character
ar: كلمة المرور يجب أن تحوي أحرفاً وأرقاماً
fr: Le mot de passe doit comprendre des lettres et des numéros.
ja: パスワードは、アルファベットと数字の組み合わせが必須です。
ko: 비밀번호는 필수로 영문자, 숫자를 포합해야 됩니다.
zh_hans: 密码必须包含字母数字字符.

# pwd_nopass
source: Password confirmed mismatches.
ar: كلمة المرور المؤكدة غير مطابقة
fr: Les deux mots de passe ne correspondent pas.
ja: 確認パスワードが一致していません。
ko: 재입력 비밀번호가 다릅니다.
zh_hans: 确认密码不匹配.

# user_no
source: The username includes illegal character!
ar: اسم المستخدم يحوي أحرفاً غير مسموح بها
fr: Le nom d’utilisateur comprend des caractères interdits
ja: ユーザー名に使用できない文字や記号が含まれています。
ko: 사용불가!
zh_hans: 用户名包含非法字符！

# sorry_register
source: Sorry, your IP address can’t be registered within several hours!
ar: عذراً, لا يمكنك تسجيل عنوان آي بي الخاص بك في غضون عدة ساعات
fr: Votre adresse IP ne peut pas être enregistrée pendant plusieurs heures!
ja: 現在のIPアドレスはしばらくの間にユーザー登録操作が出来ません。
ko: 죄송합니다. 현재IP는 일정 기간에 접속할 수 없습니다.!
zh_hans: 抱歉，您的IP地址在几小时内无法注册！

# user_nameRegister
source: The username has been registered!
ar: تم تسجيل اسم المستخدم!
fr: Le nom d’utilisateur a été enregistré
ja: このユーザー名は登録されています。
ko: 이미 사용중인 아이디입니다!
zh_hans: 该用户名已被注册！

# email_
source: The Email has been registered!
ar: تم تسجيل البريد الالكتروني!
fr: Le nom d’utilisateur a été enregistré
ja: このEmailは登録されています。
ko: 이미 사용중인 이메일입니다!
zh_hans: 该Email已被注册！

# user_login
source: Login
ar: تسجيل الدخول
fr: Connexion
ja: ログイン
ko: 로그인
zh_hans: 登录

# user_nameorpwd
source: Username or password is incorrect!
ar: اسم المستخدم أو كلمة المرور غير صحيحين!
fr: Le nom d’utilisateur ou le mot de passe est incorrect
ja: ユーザー名かパスワードが間違っています。
ko: 아이디 또는 비밀번호를 다시 확인하세요!
zh_hans: 用户名或密码错误！

# perCenter
source: Person center
ar: مركز محور الشخص
fr: Centre personnel
ja: 個人センター
ko: 개인 센터
zh_hans: 个人中心

source: Check update
ar: تفقد التحديث
fr: Vérifier les mises à jour
ja: アップデートをチェック
ko: 업그레이드
zh_hans: 检测升级

# current_newVerson
source: The current version is the latest!
ar: النسخة الحالية هي الاحدث!
fr: La version actuelle est la dernière
ja: 現在のバージョンは最新です。
ko: 최신 버전입니다!
zh_hans: 当前已是最新版本！

# l_mode_1
source: Colorful meteor
ar: النيزك الملون
fr: Météore multicolore
ja: 点灯モード1
ko: 모드 1
zh_hans: 七彩流星

# l_mode_2
source: Boy meets girl
ar: صبي يلتقي فتاة
fr: Un garçon rencontre une fille
ja: 点灯モード2
ko: 모드 2
zh_hans: 双龙戏珠

# l_mode_3
source: Blossom age
ar: عمر الزهور
fr: Age de floraison
ja: 点灯モード3
ko: 모드 3
zh_hans: 花样年华

# l_mode_4
source: Dynamic breathing
ar: التنفس الحيوي
fr: Souffle dynamique
ja: 点灯モード4
ko: 모드 4
zh_hans: 动感呼吸

# l_mode_5
source: Years pass by quickly
ar: تمضي السنين سريعاً
fr: Les années passent vite
ja: 点灯モード5
ko: 모드 5
zh_hans: 似水流年

# l_mode_6
source: Colorful meteor
ar: النيزك الملون
fr: Météore multicolore
ja: 点灯モード6
ko: 모드 6
zh_hans: 幻彩流星

# l_mode_7
source: Colorful breathing
ar: التنفس الزاهي
fr: Souffle multicolore
ja: 点灯モード7
ko: 모드 7
zh_hans: 幻彩呼吸

# ride_mode
source: Cycling somatosensory
ar: ركوب الدراجة الحسي
fr: Réglage de sensibilité
ja: 乗車体感
ko: 주행모드(변경 시 모터 진동이 발생할 수 있음.)
zh_hans: 行驶体感

# atmosphere_mode
source: Light mode
ar: وضعية إضاءة الأجواء
fr: Modes LED
ja: ムードLEDモード
ko: 라이트 모드
zh_hans: 氛围灯模式

# r_1
source: Color I
ar: Iاللون
fr: Couleur I
ja: カラー1
ko: 컬러1
zh_hans: 颜色一

# r_2
source: Color II
ar: IIاللون
fr: Couleur II
ja: カラー2
ko: 컬러2
zh_hans: 颜色二

# r_3
source: Color III
ar: IIIاللون
fr: Couleur III
ja: カラー3
ko: 컬러3
zh_hans: 颜色三

# r_4
source: Color IV
ar: IVاللون
fr: Couleur IV
ja: カラー4
ko: 컬러4
zh_hans: 颜色四

# O_NormalMode
source: Normal mode
ar: الوضع العادي
fr: Mode normal
ja: ノーマルモード
ko: 일반 모드
zh_hans: 正常模式

# O_SoftMode
source: Soft model
ar: تصميم ناعم
fr: Mode Sensible
ja: ソフトモード
ko: 소프트 모드
zh_hans: 柔软模式

# O_SportMode
source: Sport mode
ar: الوضع الرياضي
fr: Mode Sport
ja: スポーツモード
ko: 스포츠 모드
zh_hans: 运动模式

source: AM
ar: صباحا
ja: 午前
ko: 오전
zh_hans: 上午

source: PM
ar: مساء
ja: 午後
ko: 오후
zh_hans: 下午

# Last Updated
source: The last update:
ar: التحديث الأخير:
fr: La dernière mise à jour:
ja: 最後のアップデート:
ko: 최근 업데이트:
zh_hans: 最后一次更新:

source: Release to refresh
ar: أطلقها للتحديث
fr: Relâcher pour rafraîchir
ja: リリースして最新情報に更新...
ko: 동기화...
zh_hans: 释放刷新...

source: Pull down to refresh…
ar: اسحبها للأسفل للتحديث
fr: Tirez vers le bas pour rafraîchir …
ja: ドラッグして新情報に更新...
ko: 화면을 아래로 당겨 동기화합니다...
zh_hans: 下拉刷新...

source: Loading…
ar: جاري التحميل ...
ja: ローディング中...
ko: 로딩중...
zh_hans: 加载中...

# NineBotUpdateSuccess
source: The firmware update is successful, please reconnect the Ninebot!
ar: تم تحديث البرامج الثابتة بنجاح, الرجاء إعادة توصيل الناينبوت.
fr: Succès de la mise à jour du logiciel, reconnectez-vous au Ninebot
ja: ファームウェアのアップデートが完了しました。車両を再度接続してください。
ko: 펌웨어 업데이트 성공, Ninebot을 재연결 해주세요!
zh_hans: 固件更新成功，请重新连接车辆！

# UpdateErrorCtrl
source: Update of firmware of master control fails, please try again!
ar: فشل تحديث التحكم الرئيسي للبرامج الثابتة, الرجاء المحاولة ثانية!
fr: Echec de la mise à jour du logiciel, essayez encore
ja: メインコントロールファームウェアのアップデートが失敗しました。もう一度操作してください。
ko: 컨트롤 펌웨어 업데이트 실패!
zh_hans: 主控固件更新失败，请重试！

# UpdateErrorAHRS
source: Update of firmware of AHRS fails, please try again!
ar: فشل تحديث البرامج الثابتة لـ , الرجاء المحاولة ثانية
fr: Echec de la mise à jour du logiciel AHRS, essayez encore
ja: AHRSファームウェアのアップデートが失敗しました。もう一度操作してください。
ko: AHRS펌웨어 업데이트 실패!
zh_hans: AHRS固件更新失败，请重试！

# UpdateErrorDrive
source: Update of drive firmware fails, please try again!
ar: فشل تحديث البرامج الثابتة للقيادة, الرجاء إعادة المحاولة
fr: Echec de la mise à jour du logiciel, essayez encore
ja: 駆動ファームウェアのアップデートが失敗しました。もう一度操作してください。
ko: 메인 펌웨어 업데이트 실패!
zh_hans: 驱动固件更新失败，请重试！

# UpdateErrorOne
source: Update of firmware fails, please try again!
ar: فشل تحديث البرامج الثابتة, الرجاء إعادة المحاولة
fr: Echec de la mise à jour du logiciel, essayez encore
ja: ファームウェアのアップデートが失敗しました。もう一度操作してください。
ko: 펌웨어 업데이트 실패!
zh_hans: 固件更新失败，请重试！

source: Warning
ar: تحذير
fr: Attention
ja: 警告
ko: 경고
zh_hans: 警告

# UpdateTitle
source: Firmware Update
ar: تحديث البرامج الثابتة للسيارة
fr: Mise à jour du logiciel
ja: 車両ファームウェアアップデート
ko: 차체 펌웨어 업데이트
zh_hans: 车辆固件更新

# NineBotVersion
source: Current firmware version:
ar: نسخة البرامج الثابتة الحالية للمركبة
fr: Version du logiciel actuel:
ja: 現在車両ファームウェアバージョン:
ko: 현재 버전:
zh_hans: 当前车辆固件版本:

source: Latest version:
ar: أحدث نسخة من البرامج الثابتة للمركبة
fr: Dernière version du logiciel:
ja: 最新車両ファームウェアバージョン:
ko: 최신 펌웨어 버전:
zh_hans: 最新车辆固件版本:

source: Firmware update
ar: تحديث البرامج الثابتة
fr: Mise à jour du logiciel
ja: ファームウェアアップデート
ko: 펌웨어 업데이트
zh_hans: 固件更新

source: Lock
ar: قفل
fr: Vérouiller
ja: ロック
ko: 잠금
zh_hans: 锁车

# ErrorCodeChartHeader
source: Error code description
ar: وصف رمز خاطئ
fr: Erreur du code de description
ja: エラーコード 記述
ko: 에러 설명
zh_hans: 错误代码 描述

source: 46 or above
ar: 46 أو أعلى
fr: 46 ou plus
ja: 46以上（46を含む）
ko: 46이상
zh_hans: 46及以上

# Input7Number
source: Please input 7 numbers
ar: الرجاء إدخال 7 أرقام
fr: Renseignez 7 nombres
ja: 7桁の数字を入力してください
ko: 7자리 숫자를 입력해주세요.
zh_hans: 请输入7位数字

# Input6Number
source: Please input 6 numbers
ar: الرجاء إدخال 6 أرقام
fr: Renseignez 6 nombres
ja: 6桁の数字を入力してください
ko: 6자리 숫자를 입력해주세요.
zh_hans: 请输入6位数字

# NotConnectedTips
source: Connect fail, please try again.
ar: عذراً, الناينبوت غير موصولة, الرجاء إعادة توصيلها!
fr: Echec de la connexion, essayez encore.
ja: デバイス接続失敗、もう一度操作してください。
ko: Ninebot을 재연결 해주세요.
zh_hans: 设备连接失败，请重新尝试连接。

# UpdateDes
source: A newer version is available, Do you want to update?
ar: هناك نسخة جديدة للتحديث, هل ترغب بالتحديث أم لا؟
fr: Une nouvelle version est disponible, souhaitez-vous mettre à jour ?
ja: 新しいバージョンが利用できます。アップデートしますか？
ko: 펌웨어 업데이트를 진행하시겠습니까?
zh_hans: 有新的版本更新，是否前往更新？

source: Update
ar: تحديث
fr: Mettre à jour
ja: アップデートします。
ko: 업데이트
zh_hans: 更新

# Sure
source: OK
ar: أكيد
ja: 確定
ko: 확인
zh_hans: 确定

# RemoveHandleFirst
source: Please remove the handlebar
ar: الرجاء إزالة المقود
fr: Retirez le guidon
ja: ステアリングバーを取り外してください。
ko: 핸들바를 먼저 분리하세요
zh_hans: 请先移除手把

# GetOffFirst
source: Please enter standby or assistance mode
ar: الرجاء إدخال وضع الاستعداد أو المساعدة
fr: Mettez-vous en mode Standby ou Assistance
ja: 待機モードかアシストモードに入ってください
ko: 먼저 대기/견인 모드로 바꾸세요
zh_hans: 请先进人待机或助力模式

# UpdateFirst
source: Please firstly update the firmware
ar: الرجاء تحديث البرامج الثابتة أولاً
fr: Mettez le logiciel à jour en premier
ja: ファームウェアをアップデートしてください
ko: 펌웨어를 업데이트하세요
zh_hans: 请先更新固件

# ScaleCodeError
source: Sorry, the scale sequence format which inputted by you is wrong; please input the scale sequence which was constituted by 7 numbers.
ar: عذرا، شكل تسلسل النطاق المدخل من قبلك خاطئ, الرجاء إدخال تسلسل النطاق الذي تم يتشكل من 7 أرقام.
fr: Le format de séquence d’échelle que vous avez renseigné est faux. Renseignez une séquence d’échelle constituée de 7 nombres.
ja: 入力したメロディの形式が正しくありません。7桁の数字でメロディを入力してください。
ko: 잘못 입력했습니다. 7자리의 숫자를 입력하세요
zh_hans: 对不起，您输入的音阶序列格式有误，请输入7位数字组成的音阶序列。

# BluetoothCodeError
source: Sorry, the matching code inputted by you is incorrect; please input 6 numbers
ar: عذراً، رمز المطابقة المدخل من قبلك غير صحيح’ الرجاء إدخال 6 أرقام
fr: Le code d’appareillage que vous avez renseigné est faux. Renseignez un code de 6 nombres
ja: ペアリングコードはただしくない。6桁の数字を入力してください。
ko: 죄송합니다. 입력하신 페어링 코드에 에러가 발생하였습니다. 6자리 숫자를 입력해주세요.
zh_hans: 对不起，您输入的匹配码有误，请输入6位数字

# serialNumberCodeError
source: The format of serial No. is incorrect!
ar: شكل الرقم التسلسلي غير صحيح!
fr: Le format du numéro de série est incorrect
ja: シリアルナンバー形式が間違っています。
ko: S/N 입력에러!
zh_hans: 序列号格式错误！

# MailboxError
source: Sorry, the mailbox inputted by you is incorrect; please input it again
ar: عذراً, صندوق البريد المدخل من قبلك غير صحيح, الرجاء إعادة إدخاله
fr: L’email que vous avez renseigné est incorrect, renseignez un email correct
ja: すみません、入力したメールアドレスが間違っています。もう一度入力してください。
ko: 죄송합니다. 입력하신 이메일에 에러가 발생하였습니다. 다시 입력하시오.
zh_hans: 对不起，您输入的邮箱不正确，请重新输入

# PostureSensorTips
source: Do not move the vehicle.If the vehicle cannot stand on its own, support it with your hand. During calibration, the vehicle will beep twice.After 3 seconds, it will beep twice again.After the second set of beeps, the calibration is complete.
ar: الرجاء الحفاظ على السيارة في حالة راحة مطلقة في عملية معايرة أجهزة الاستشعار لمدة 3 ثوان، وعند بداية ونهاية المعايرة، و المركبة تصدر صوتاً مثل 'ديدي'، فهل تريد الاستمرار؟
fr: Maintenez le véhicule en état de repos absolu pendant le processus de calibrage du capteur de sensibilité pendant 3 secondes, et au début et à la fin du calibrage, le véhicule émettra un son « didi »
ja: 姿勢センサーの校正中は必ず車両を静止状態にしてください。持続時間は約3秒で、開始時と終了時に「ビビ」のブザー音が鳴ります。操作を続けますか？
ko: 수평 센서 보정 시 반드시 차체 정지상태를 유지하세요. 보정 시 보통 3초정도 소요되며 시작과 완료 시 ‘삐삐’ 알림소리가 들립니다. 계속 진행하시겠습니까?
zh_hans: 在姿态传感器校准过程中请保持车辆处于绝对静止状态，标定过程持续大约3秒，校准开始和完毕时车辆将发出‘滴滴’的提示声，是否继续？

# LockFirst
source: Please firstly lock the vehicle!
ar: الرجاء قفل السيارة أولاً!
fr: Verrouillez le véhicule en premier
ja: ロックしてください。
ko: 차체를 잠그세요！
zh_hans: 请先锁车！

# StopFirst
source: Please firstly stop the vehicle!
ar: الرجاء إيقاف السيارة أولاً!
fr: Arrêtez le véhicule en premier
ja: 車両を止めてください。
ko: 운행을 정지해주세요！
zh_hans: 请先停止车辆！

# StandOffTips
source: Please firstly enter into non-standing mode
ar: الرجاء الدخول في الوضع غير الدائم أولاً
fr: Commencez par un mode autre que le mode Stand-by
ja: リモートコントロールモードに入ってください。
ko: 먼저 대기모드(미탑승)로 바꾸세요
zh_hans: 请先进入非站人模式

# RebootTips
source: Confirm to restart vehicle
ar: أكد إعادة تشغيل ناينبوت
fr: Confirmez le rallumage du véhicule
ja: 車両再起動確認
ko: 차량 재부팅 확인
zh_hans: 确认重启车辆

# ShutDownTips
source: Confirm to close vehicle
ar: أكد إغلاق ناينبوت
fr: Confirmez l’extinction du véhicule
ja: 車両シャットダウン確認
ko: 차량 OFF
zh_hans: 确认关闭车辆

# PairCodeRebootTips
source: After setting the pairing code, it will take effect when restart the Ninebot again.
ar: بعد إعداد رمز الاقتران, سوف يأخذ دوره بعد إعادة تشغيل الناينبوت مرة أخرى
fr: Après la mise en place du code d’appareillage, il faudra rallumer le Ninebot pour que l’appareillage soit effectif.
ja: ブルートゥースのペアリングコードを設定完了後にNinebot再起動する必要があります。
ko: 연결 인증 번호를 설정한 후 NineBot을 다시 시작 해야 적용됩니다.
zh_hans: 配对码设置成功后需要重新启动才会起作用。

# nb_changeBat
source: Please be careful! If the setting is not in conformity with the battery type for actual use, it will affect the vehicle's electric quantity detection precision, even affect safety! Whether confirm to switch the type of battery?
ar: رجاء كن حذراً! إذا كان الإعداد لا يتفق مع نوع البطارية للاستخدام الفعلي، فإنه سوف يؤثر على كمية الكهرباء المكشوفة بدقة بالسيارة، وحتى أنه يؤثر على السلامة! هل تريد تأكيد تبديل نوع البطارية؟
fr: Soyez prudent! Si la mise en route n’est pas en conformité avec le type de batterie actuellement utilisée, cela affectera la précision de la détection d’électricité, et même affecter la sécurité. Souhaitez-vous changer le type de batterie ?
ja: 注意！現在の設定内容と実際に使用しているバッテリーの種類が異なる場合、車両のバッテリー残量測定の精度に影響を与えることがあります。故障する恐れがあります。バッテリーの種類切替を確定しますか？
ko: 주의！배터리 설정 시 실제 사용 배터리의 용량과 다를 경우 정확한 배터리 잔량 측정이 불가능하여 주행 중 전원이 꺼질 수 있습니다. 배터리 모드를 변경하시겠습니까?
zh_hans: 请注意！如果该设置与实际使用的电池类型不符，将会影响车辆的电量检测精度，甚至影响 安全！是否确认切换电池类型？

# DashBoard
source: Instrument panel
ar: لوحة أجهزة القياس
fr: Panneau d’instruments
ja: ダッシュボード
ko: 계기판
zh_hans: 仪表盘

# DetailInfo
source: Detailed information
ar: معلومات مفصلة
fr: Informations détaillées
ja: 詳しい情報
ko: 상세히 보기
zh_hans: 详细信息

# BlueToothTeleControl
source: Bluetooth remote control
ar: جهاز تحكم بلوتوث
fr: Télécommande de contrôle
ja: ブルートゥースリモートコントロール
ko: 블루투스 원격 조정
zh_hans: 蓝牙遥控

source: Settings
fr: Paramètres
ja: 設定
ko: 설정
zh_hans: 设置

# BasicInfo
source: Basic Information
ar: معلومات أساسية
fr: Informations basiques
ja: 基本情報
ko: 기본 정보
zh_hans: 基本信息

# Electricity
source: Battery Information
ar: معلومات كمية الكهرباء
fr: Information sur la quantité électrique
ja: バッテリー残量表示
ko: 배터리 정보
zh_hans: 电量信息

# Speed&Mileage
source: Speed and Mileage
ar: السرعة والكيلومتراج
fr: Vitesse et kilométrage
ja: 速度と距離数
ko: 속도 및 주행거리
zh_hans: 速度与里程

source: Run time
ar: مدة التسيير
fr: Temps de conduite
ja: 走行時間
ko: 운행 시간
zh_hans: 运行时间

source: Temperature
ar: الحرارة
fr: Température
ja: 気温
ko: 온도
zh_hans: 温度

# Voltage&Current
source: Voltage and current
ar: الجهد والتيار
fr: Voltage et courant
ja: 電圧と電流
ko: 전압 및 전류
zh_hans: 电压与电流

source: Posture
ar: الحالة
fr: Position
ja: 姿勢
ko: 상태
zh_hans: 姿态

# Check&Update
source: Check for firmware updates
ar: تفقد وتحديث البرامج الثابتة
fr: Vérification et mise à jour du logiciel
ja: ファームウェアのアップデートをチェック
ko: 펌웨어 업데이트 확인
zh_hans: 检查固件更新

source: About
ar: حول
fr: À propos
ko: 더 보기
zh_hans: 关于

source: Tips
ar: نصائح
fr: Conseils
ko: 알림
zh_hans: 提示

# ErrorCodeChart
source: Code table of fault alarm
ar: جدول رموز إنذار الأخطاء
fr: Code d’alarme par défaut
ja: 故障・警告コードリスト
ko: 에러코드 차트
zh_hans: 故障报警代码表

source: Back
ar: عودة
fr: Retour
ja: 戻る
ko: 반환
zh_hans: 返回

# SerialNumber
source: Serial No.
ar: رقم تسلسلي
fr: Numéro de série
ja: 車両シリアルナンバー
ko: S/N
zh_hans: 车辆序列号

source: Bluetooth pairing code
ar: رمز اقتران البلوتوث
fr: Code d’appareillage Bluetooth
ja: ブルートゥースのペアリングコード
ko: 블루투스 인증 번호
zh_hans: 蓝牙配对码

source: Firmware version
ar: نسخة البرامج الثابتة
fr: Version du logiciel
ja: ファームウェアバージョン
ko: 펌웨어 버전
zh_hans: 固件版本

source: Error code
ar: رمز خطأ
fr: Code d’erreur
ja: エラーコード
ko: 에러 코드
zh_hans: 错误代码

source: Alarm code
ar: رمز إنذار
fr: Code d’alarme
ja: 警告コード
ko: 경고 코드
zh_hans: 报警代码

# WorkMode
source: The current work mode
ar: نمط عمل التيار
fr: Mode utilisé actuellement
ja: 現在の動作モード
ko: 현재 모드
zh_hans: 当前工作模式

# FootSwitchStatus
source: Standing switch status
ar: حالة مفتاح الوقوف
fr: Statut changé
ja: バランスモードステータス
ko: 탑승ON/OFF 상태
zh_hans: 站人开关状态

# HandleAngle
source: Handlebar angle
ar: زاوية المقود
fr: Angle du guidon
ja: ステアリングバー角度
ko: 핸들 각도
zh_hans: 手把转角

source: Standby mode
ar: وضعية الاستعداد
fr: Mode Standby
ja: 待機モード
ko: 대기 모드
zh_hans: 待机模式

# AssistantMode
source: Assistance mode
ar: وضعية المساعدة
fr: Mode Assistance
ja: アシストモード
ko: 견인 모드
zh_hans: 助力模式

# FootMode
source: Standing mode
ar: وضعية الوقوف
fr: Mode Debout
ja: バランスモード
ko: 탑승 모드
zh_hans: 站人模式

source: Lock mode
ar: وضعية القفل
fr: Mode Verrouillé
ja: ロックモード
ko: 잠금 모드
zh_hans: 锁车模式

# RemoteMode
source: Remote control mode
ar: وضعية التحكم عن بعد
fr: Mode Télécommandé
ja: リモートコントロールモード
ko: 원격 조종 모드
zh_hans: 遥控模式

# VehicleBatteryLevel
source: The vehicle electric quantity
ar: كمية كهرباء المركبة
fr: Niveau de batterie restant
ja: 全体のバッテリー残量
ko: 배터리 잔량
zh_hans: 整车电量

# BatteryALevel
source: Electric quantity of battery 1
ar: كمية كهرباء البطارية1
fr: Niveau d’électricité de la batterie 1
ja: バッテリー1残量
ko: 배터리1 잔량
zh_hans: 电池1电量

# BatteryBLevel
source: Electric quantity of battery 2
ar: كمية كهرباء البطالرية2
fr: Niveau d’électricité de la batterie 2
ja: バッテリー2残量
ko: 배터리2 잔량
zh_hans: 电池2电量

# EstimatedRemainingMileage
source: Remaining Mileage
ar: تقدير المسافة المتبقية
fr: Kilométrage restant
ja: 走行可能距離予測
ko: 주행 가능 거리
zh_hans: 预计剩余行驶里程

# CurrentSpeed
source: Current Vehicle Speed
ar: السرعة الحالية للمركبة
fr: Vitesse actuelle du véhicule
ja: 瞬間車両速度
ko: 속도
zh_hans: 当前车辆速度

# LeftWheelSpeed
source: The current speed of left wheel
ar: السرعة الحالية للعجلة اليسرى
fr: Vitesse actuelle de la roue gauche
ja: 瞬間左ホイール速度
ko: 좌측 타이어 속도
zh_hans: 当前左轮速度

# RightWheelSpeed
source: The current speed of right wheel
ar: السرعة الحالية للعجلة اليمنى
fr: Vitesse actuelle de la roue droite
ja: 瞬間右ホイール速度
ko: 우측 타이어 속도
zh_hans: 当前右轮速度

# NormalModeValue
source: Lit-Speed of Normal Mode
ar: سرعة الحقن في الوضع العادي
fr: Limite de vitesse du mode Normal
ja: ノーマルモードのリミット值
ko: 일반 모드 속도제한값
zh_hans: 正常模式限速值

# SpeedLimitModeValue
source: Speed Limit
ar: سرعة الحقن في وضع الحقن
fr: Mode piéton : vitesse bridée
ja: スピードリミットモードのリミット值
ko: 속도제한모드 속도 설정(활성화 시 적용)
zh_hans: 限速模式限速值

# OdometerOfRiding
source: Mileage (Total)
ar: إجمالي مسافة السير
fr: Kilométrage
ja: 総走行距離
ko: 주행거리
zh_hans: 总行驶里程

# OdometerOfAssistanting
source: Total assistance mileage
ar: إجمالي مسافة المساعدة
fr: Kilométrage total en mode Assistance
ja: 総アシスト距離
ko: 견인 주행거리
zh_hans: 总助力里程

# OdometerOfRemoting
source: Total remote control mileage
ar: إجمالي المسافة بالتحكم عن بعد
fr: Kilométrage total en mode Télécommandé
ja: 総リモートコントロール距離
ko: 원격 조종 주행거리
zh_hans: 总遥控里程

# TripDistanceOfRiding
source: Mileage (Current ride)
ar: مسافة السير لمرة واحدة
fr: Kilométrage
ja: 区間走行距離
ko: 시동 후 주행거리
zh_hans: 单次行驶里程

# TripDistanceOfAssistanting
source: A single assistance mileage
ar: مسافة السير بالمساعدة لمرة واحدة
fr: Kilométrage en mode Assistance seulement
ja: 区間アシスト距離
ko: 시동 후 견인 주행거리
zh_hans: 单次助力里程

# TripDistanceOfRemoting
source: A single remote control mileage
ar: مسافة السير بالتحكم عن بعد لمرة واحدة
fr: Kilométrage en mode Télécommandé seulement
ja: 区間リモートコントロール距離
ko: 시동 후 원격제어 주행거리
zh_hans: 单次遥控里程

source: Total running time
ar: إجمالي مدة التشغيل
fr: Temps de conduite total
ja: 総動作時間
ko: 총 운행 시간
zh_hans: 总运行时间

# TotalRidingTime
source: Total cycling time
ar: إجمالي مدة المسير
fr: Temps de montée total
ja: 総走行時間
ko: 총 주행 시간
zh_hans: 总行驶时间

# TotalAssistantingTime
source: Total assistance time
ar: إجمالي مدة المساعدة
fr: Temps total en mode Assistance
ja: 総アシスト時間e
ko: 총 조력 시간
zh_hans: 总助力时间

# TotalRemotingTime
source: Total remote control time
ar: إجمالي مدة التحكم عن بعد
fr: Temps total en mode Télécommandé
ja: 総リモートコントロール時間
ko: 총 제어 시간
zh_hans: 总遥控时间

# CurrentRunningTime
source: Single running time
ar: مدة التشغيل لمرة واحدة
fr: Temps de conduite actuel
ja: 区間動作時間
ko: 시동 후 운행 시간
zh_hans: 单次运行时间

# CurrentRidingTime
source: single cycling time
ar: مدة المسير لمرة واحدة
fr: Temps de montée actuel
ja: 区間走行時間
ko: 시동 후 주행 시간
zh_hans: 单次行驶时间

# CurrentAssistantingTime
source: single assistance time
ar: مدة المساعدة لمرة واحدة
fr: Temps actuel en mode Assistance
ja: 区間アシスト時間
ko: 시동 후 견인 시간
zh_hans: 单次助力时间

# CurrentRemotingTime
source: single remote control time
ar: مدة التحكم عن بعد لمرة واحدة
fr: Temps actuel en mode Télécommandé
ja: 区間リモートコントロール時間
ko: 시동 후 원격제어 시간
zh_hans: 单次遥控时间

# VehicleTemperature
source: Vehicle Temp.
ar: درجة حرارة جسم المركبة
fr: Température du véhicule
ja: 車体温度
ko: 차체 온도
zh_hans: 车体温度

# BatteryATemperature
source: Battery 1 temperature
ar: حرارة البطارية1
fr: Température de la batterie 1
ja: バッテリー1温度
ko: 배터리1 온도
zh_hans: 电池1温度

# BatteryBTemperature
source: Battery 2 temperature
ar: حرارة البطارية2
fr: Température de la batterie 2
ja: バッテリー2温度
ko: 배터리2 온도
zh_hans: 电池2温度

# VehicleInfo
source: Vehicle information
ar: معلومات المركبة
fr: Information du véhicule
ja: 製品情報
ko: 차체 정보
zh_hans: 整车信息

# DriverVoltage
source: Drive voltage
ar: الجهد عند القيادة
fr: Tension électrique (Volts)
ja: 駆動部電圧
ko: 구동 전압
zh_hans: 驱动电压

# BatteryAVoltage
source: Battery 1 voltage
ar: جهد البطارية 1
fr: Voltage de la batterie 1
ja: バッテリー1電圧
ko: 배터리1 전압
zh_hans: 电池1电压

# BatteryBVoltage
source: Battery 2 voltage
ar: جهد البطارية 2
fr: Voltage de la batterie 2
ja: バッテリー2電圧
ko: 배터리2 전압
zh_hans: 电池2电压

# SystemCurrent
source: Total current of the system
ar: التيار الإجمالي للنظام
fr: Intensité électrique (Ampères)
ja: システム総電流
ko: 시스템 총 전류
zh_hans: 系统总电流

# SystemA
source: System I
ar: Iالنظام
fr: Système I
ja: システムA
ko: 시스템1
zh_hans: 系统一

# SystemB
source: System II
ar: IIالنظام
fr: Système II
ja: システムB
ko: 시스템2
zh_hans: 系统二

# 11V
source: 11 V voltage
ar: جهد 11 فولت
fr: voltage 11 V
ja: 11V電圧
ko: 11V전압
zh_hans: 11V电压

# 12V
source: 12 V voltage
ar: جهد 12 فولت
fr: voltage 12 V
ja: 12V電圧
ko: 12V전압
zh_hans: 12V电压

# 5V
source: 5 V voltage
ar: جهد 5 فولت
fr: voltage 5 V
ja: 5V電圧
ko: 5V전압
zh_hans: 5V电压

# Motor1 Current
source: Total current of motor 1
ar: التيار الإجمالي للمحرك 1
fr: Courant total dans le moteur 1
ja: モーター1総電流
ko: 모터1 전류
zh_hans: 电机1总电流

# Motor2 Current
source: Total current of motor 2
ar: التيار الإجمالي للمحرك 2
fr: Courant total dans le moteur 2
ja: モーター2総電流
ko: 모터2 전류
zh_hans: 电机2总电流

# Motor1 Phase Current
source: Phase current of motor 1
ar: التيار المرحلي للمحرك 1
fr: Courant phase total dans le moteur 1
ja: モーター1相電流
ko: 전기 단상 전류
zh_hans: 电机1相电流

# Motor2 Phase Current
source: Phase current of motor 2
ar: التيار المرحلي للمحرك 2
fr: Courant phase total dans le moteur 2
ja: モーター2相電流
ko: 전기 이상 전류
zh_hans: 电机2相电流

# RollAngle
source: The current roll angle
ar: زاوية المحور الجانبي الحالية
fr: Angle de roulis (latéral)
ja: 現在ロール角
ko: 현재 회전 각도
zh_hans: 当前滚转角

# PitchAngleRate
source: The current pitching angle speed
ar: السرعة الموافقة لزاوية المحور الأمامي الحالية
fr: La vitesse d’angle du terrain actuel
ja: 瞬間ピッチ角速度
ko: 현재 균형 각속도
zh_hans: 当前俯仰角速度
