Repository: sxm5220/sxm-ios
Catalog: Ninebot/*.lproj/Localizable.strings
Languages: ar, fr, ja, ko, zh_hans

# s_email_code
source: Verification has been sent to your mailbox
ar: التحقق أرسل إلى صندق البريد
fr: Le code de vérification vous a été envoyée par email.
ja: 認証コードを登録されているメールアドレスに送信しました。
ko: 인증번호를 이메일로 발송하였습니다.
zh_hans: 验证码已发送到您的邮箱

# s_email_code_fail
source: Email to get verification code failed!
ar: فشل البريد الإليكتروني في الحصول على رمز التحقق
fr: Envoyez un email pour récupérer le code de vérification
ja: メールアドレスの認証コード取得失敗。
ko: 이메일로 인증번호 받는데 실패하였습니다.
zh_hans: 邮箱验证码获取失败！

# n_message_title
source: My messages
ar: رسائلي
fr: Mes messages
ja: Myメッセージ
ko: 나의메시지
zh_hans: 我的消息

# s_search_state
source: Could not locate any vehicles. Verify that the vehicle is turned on（Bluetooth icon on the vehicle should be flashing).
ar: لا يوجد أي أجهزة، تحقق من أن رمز البلوتوث في السيارة على الفلاش
fr: Aucun appareil trouvé. Vérifiez que la fonction Bluetoothdu véhicule est allumée.
ja: 車両の検索に失敗しました。車両にブルートゥースのアイコンが点滅していて接続可能な状態になっているかを確認してください。
ko: 개인 운송 로봇를 못 찾습니다 。블루투스아이콘 연결 될 수 있는 상태가 있는지 확인하세요
zh_hans: 未搜索到车辆，请确认车辆上的蓝牙图标处于闪烁可连接状态。

# s_setVehicle_password
source: Set the vehicle password
ar: أعد تعيين كلمة مرور السيارة
fr: Définir le mot de passe du véhicule
ja: 車両パスワード設定
ko: 블루투스 비밀번호 설정
zh_hans: 设置车辆密码

# s_writeBlepwdFail
source: Password written failure!
ar: فشل كتابة كلمة المرور
fr: Echec du mot de passe
ja: パスワード入力失敗。
ko: 비밀번호 입력 실패!
zh_hans: 密码写入失败！

# s_inputSixPwd
source: Please input 6-digit password
ar: من فضلك أدخل 6رموز لكلمة المرور
fr: rentrez un mot de passe 6 caractères
ja: 6桁のパスワードを入力してください
ko: 6위 비밀번호 누러 주세요
zh_hans: 请输入6位密码

# s_blecodFail
source: Connecting password failure!
ar: فشل الإتصال بكلمة المرور
fr: La connexion avec le mot de passe a échoué
ja: パスワードが間違っています。
ko: 비밀번호 틀렸습니다 !
zh_hans: 密码错误！

# s_keyboard_hid
source: hide
ar: اخف
fr: Cacher
ja: 隠す
ko: 숨다
zh_hans: 隐藏

# s_keyboard_del
source: Delete
ar: امسح
fr: Effacer
ja: 削除
ko: 삭제
zh_hans: 删除

# s_jiaShiZhiNan
source: Guide for Driving
ar: ارشادات القيادة
fr: Guide de conduite
ja: 安全運転ガイド
ko: 주행 가이드
zh_hans: 驾驶指南

# s_newJiaoXue
source: Tutorial
ar: البرنامج التعليمي
fr: Tutoriel
ja: チュートリアル
ko: 초보자 가이드
zh_hans: 新手教学

# s_jiaoxue
source: Tutorial
ar: البرنامج التعليمي
fr: Tutoriel
ja: ガイド
ko: 사용 가이드
zh_hans: 教学引导

# connect_Code
source: connect password
ar: كلمة المرور متصلة
fr: Connexion avec mot de passe
ja: 接続パスワード
ko: 연결 암호
zh_hans: 连接密码

# s_BMSFirmwareVersion
source: BMS Firmware Version
ar: BMS اصدار البرامج الثابتة
fr: Version du logiciel BMS
ja: BMSファームウェアバージョン
ko: BMS폼웨어 버전
zh_hans: BMS固件版本

# s_bmsIntro
source: The total charge capacity of the battery to achieve the design capacity of the battery is recorded as a cycle number. Battery charge lasts more than 1 minutes is recorded charge times.
ar: السعة الكلية لشحن البطارية لتبلغ سعة تصميم البطارية سجلت كدائرة رقمية شحن البطارية يستمر أكثر من دقيقة يسجل أوقات الشحن
fr: La capacité de la charge totale de la batterie est enregistrée comme un nombre de cycle. La recharge de la batterie de plus de 1 minute est enregistrée comme un temps de chargement.
ja: バッテリー累計充電容量は標準容量に達した際に充電回数を一回カウントします。 バッテリー継続充電１分間以上の際に、充電回数を一回カウントします。
ko: 만충 충전회수는 누락 만충 회수입니다. 충전 회수는 1분이상 충전 회수입니다.
zh_hans: 电池累计充电容量达到电池设计容量记一次循环次数 电池充电持续1分钟以上记一次充电次数

# lamp_power_switch
source: The lamp power switch
ar: تم تشغيل طاقة المصباح
fr: Rotation selon vitesse
ko: 라이트 전원 설정
zh_hans: 车灯电源开关

# s_up_
source: Lift
ar: مصعد
fr: Soulevez
ja: 持上げます
ko: 들어올립니다
zh_hans: 向上提起

# s_down_
source: Put Down Gently
ar: ضعه باأسفل برفق
fr: Déposez doucement
ja: ゆっくり降ろします
ko: 천천히 내려놓습니다
zh_hans: 缓缓放下

# s_isNewhand_out
source: Confirm exit tutorial
ar: التأكد من الخروج من البرامج التعليمية
fr: Confirmez la sortie du tutoriel
ja: チュートリアルを終了しますか。
ko: '초보자가이드'에서 나갑니다.
zh_hans: 是否退出新手教学?

# s_rid
source: For your safety driving, please read the driver's Guide
ar: من أجل قيادة آمنة يرجى قراءة إرشادات السائق
fr: Pour votre sécurité, lisez le guide du conducteur.
ja: 安全に乗車するために安全運転ガイドをよくお読みください。
ko: 당신의 안전 운전을 위해, 드라이버의 설명서를 읽어 보시기 바랍니다
zh_hans: 为了您的安全驾驶，请先阅读驾驶指南

# j_tip_newPople_success
source: Thank you for reading the Guide for Safe Driving! You must read the User Manual and follow the New Rider Tutorial in this App before your first ride.
ar: شكرا لقراءتك لتعليمات القيادة الآمنة وعليك قراءة الاستخدام اليدوي واتباع برنامج التعليمي للسائق الجديد لهذا التطبيق قبل القيادة لأول مرة
fr: Merci d’avoir lu le guide du conducteur pour une conduite en toute sécurité ! Vous devez lire le guide d’utilisateur et suivre le nouveau tutoriel du conducteur présent sur cette application avant votre première conduite.
ja: 最後までお読み頂きありがとうございます。安全運転ガイドを見てチュートリアルをクリアしましょう。
ko: 읽어주셔서 감사합니다. 안전주행가이드를 참고하여 초보자가이드를 완성하세요.
zh_hans: 感谢您的耐心阅读，请参考安全驾驶指南完成新手教学。

# s_idcard_number
source: User's ID card is needed to complete insurance info.
ar: نحتاج بطاقة الهوية للمستخدم لاستكمال معلومات التأمين
fr: La carte d’identité de l’utilisateur est nécessaire pour compléter les informations de l’assurance.
ja: 保険契約情報に身分証情報の提出が必要です。
ko: 보험 정보는 사용자 신분중 정보가 필요합니다
zh_hans: 保险信息需要提供用户身份证

# s_agreen
source: Agree
ar: أوافق
fr: D’accord
ja: 同意します。
ko: 동의
zh_hans: 同意

# s_stateblance
source: Keep steady
ar: كن مستعدا
fr: Continuez doucement
ja: バランスを保ちます
ko: 수평을 유지하세요
zh_hans: 保持平稳

# s_turnLeft
source: Left
ar: يسار
fr: Gauche
ja: 左折
ko: 좌회전
zh_hans: 左转

# s_turnRight
source: Right
ar: يمين
fr: Droite
ja: 右折
ko: 우회전
zh_hans: 右转

# settings_sensor_tips_no_activate
source: Your vehicle has not been activated, adjust sensitivity canbe done after activation finished. Do you want to activate the vehicle?
ar: لم يتم تفعيل السيارة، يمكن استكمال ضبط الحساسية بعد اكتمال التفعيل. هل تريد تفعيل السيارة؟
fr: Votre véhicule n’a pas été activé, l’ajustement de la sensibilité peut être ajustée après l’activation complétée. Souhaitez-vous activer le véhicule ?
ja: 車両本登録を完了されていません。車両本登録をしてからステアリング感度調節をしてください。車両本登録をしますか？
ko: 당신의 차량이 활성화되지 않았습니다.먼저 활성화 한 다음에 회전 감도를 조절할 수 있습니다. 화성화를 진행하겠습니까?
zh_hans: 您的车辆未激活，需先激活车辆再调节转向灵敏度。是否去激活车辆?

# settings_sensor_tips_no_teached
source: You have not finished begineers learning, adjust sensitivity canbe done after begineers learning been fulfilled. Do you want to complete beginner learning?
ar: لم يتم الإنتهاء من تعليم المبتدئين. يمكت اكتمال ضبط الحساسية بعد استكمال تعليم المبتدئين. هل تريد استكمال تعليم المبتدئين؟
fr: Vous n’avez pas terminé le tutoriel pour débutants, l’ajustement de la sensibilité peut être ajustée après que vous ayez terminé le tutoriel pour débutants. Souhaitez-vous terminer le tutoriel pour débutants ?
ja: チュートリアルをクリアされていません。チュートリアルをクリアしてからステアリング感度調節をしてください。チュートリアルを開始しますか？
ko: 당신은 초보자가이드 과정을 완성하지 않았습니다.먼저 초보자가이드를 완성한 다음에 회전 감도를 조절할 수 있습니다. 초보자가이드를 진행하겠습니까？
zh_hans: 您未完成新手教学，需先完成新手教学再调节转向灵敏度。是否去完成新手教学？

# settings_sensor_tips_no_grade_white
source: For your safety consideration, vehicle cannot be set sensitivity within mileage 1 km. Please set sensitivity after riding more than 1 km.
ar: من أجل الإعتبارات الأمنية. لايمكن للسيارة ضبط الحساسية خلال مسافة 1كم، لذا يرجى ضبط الحساسية بعد القيادة أكثر من 1كم
fr: Pour votre sécurité, l’ajustement de la sensibilité ne peut pas être faire avant une conduite de 1 km. Ajustez la sensibilité après une conduite de plus de 1 km.
ja: 安全のために車両は最初の1kmまで感度設定ができません。1km以上走行してから感度設定をしてください。
ko: 당신의 안전을 위해 주행거리 1KM미만 상태는 감도 설정이 제한되 있습니다. 먼저 1KM주행거리 달성한 다음에 감도 설정을 하십시오!
zh_hans: 为了您的安全，车辆在前1km不支持灵敏度设置。请骑行1km后再重新尝试设置灵敏度！

# s_capacity
source: Remaining Battery Capacity
ar: سعة البطارية المتبقية
fr: Capacité de batterie restante
ja: バッテリー残量
ko: 배터리 잔량
zh_hans: 剩余电量

# s_fwdownloading
source: Firmware downloading...
ar: تنزيل البرامج الثابتة
fr: Téléchargement du logiciel...
ja: ファームウェアダウンロード中...
ko: 펌웨어 다운로드중...
zh_hans: 固件下载中...

# s_putdownfirst
source: Put down vehicle first
ar: ضع السيارة بالأسفل أولا
fr: Déposez d’abord le véhicule
ja: 車両を降ろしてください
ko: 먼저 차량을 내려놓으세요
zh_hans: 请先放下车辆

# w_mineFun
source: Mine
ar: خاص بي
fr: Moi
ja: マイゾーン
ko: 나의글
zh_hans: 我的圈

# w_goodFun
source: Top Posts
ar: المشاركات الأعلى
fr: Top
ja: お気に入り
ko: 추천글
zh_hans: 精华帖

# s_speed_tip
source: When limited-speed mode is active, this is the top speed that the vehicle can reach.
ar: تظهر حد السرعة عندما تكةن حد السرعة مفتوح
fr: Si activé, le mode piéton (vitesse bridée) vous permet de limiter la vitesse maximale que peut atteindre votre véhicule.
ja: スピードリミット値はスピードリミットモード起動後、車両が走行できる平均最高速度です。
ko: 해당 속도제한 값은 속도제한 활성화 시 차량이 도달할 수 있는 평균 최고속도입니다.
zh_hans: 该限速值指的是开启限速模式后，车辆能够达到的平均最高速度。

# s_speed_behind
source: As vehicle reaches the maximum set speed, it will gradually tilt the rider back in order to center mass to ensure safety and avoid over-acceleration.
ar: Vehicle will gradually pull ridder back avoiding further acceleration as current speed approaches the pre-set max speed.
fr: En cas d’atteinte de cette vitesse bridée, le véhicule va se cabrer légèrement en arrière : ne combattez pas cet effet et freinez immédiatement.
ja: 設定されたスピードリミット値に接近したり達した際に、車両はそれ以上の加速を制限するため速度を制御します。
ko: 설정한 속도제한 값에 도달 시 차량이 서서히 후면으로 기울리면서 가속을 방지합니다.
zh_hans: 当接近或达到限定的最高速度时，车辆将会逐渐后仰以防止继续加速。

# m_sen_tip
source: If vehicle starts moving when powered on, you can try to resolve this problem by calibrating balance sensor.
ar: إذا بدأت السيارة في الحركة عند التشغيل فعليك محاولة حل هذه المشكلة عن طريق معايرة موقف جهاز الاستشعار
fr: Si le véhicule se met à bouger lors de la mise en marche, vous pouvez essayer de résoudre ce problème en calibrant le capteur d’attitude.
ja: 起動後に車両が勝手にステアリングしていくようになる場合、姿勢センサーの校正を行えば解決できます。
ko: 시동 후 차량이 자동 회전되는 경우 애티튜드센서(자세감응기) 교정하여 해당 문제를 해결할 수 있습니다.
zh_hans: 当出现开机后车辆自动转向情况时，可尝试校准姿态传感器解决该问题。

# n_message_commment
source: Commented
ar: التعليق
fr: Commentez
ja: あなたについて書き込まれています。
ko: 댓글 달았습니다
zh_hans: 评论了你

# n_message_praise
source: Liked
fr: J’aime
ja: 「いいね！」をもらいました。
ko: 추천하였습니다
zh_hans: 赞了你

# s_filedown_fail
source: Upgrade failed, please try again!
ar: فشل التحميل، يرجى المحاولة مرة أخرى
fr: Echec de la mise à jour, essayez encore.
ja: アップデート失敗。もう一度操作してください。
ko: 연결 실패. 다시 연결하세요.
zh_hans: 升级失败，请重新尝试！

# s_normarl
source: Normal
ja: 正常
ko: 정상
zh_hans: 正常

# s_anomaly
source: Abnormal
fr: Anormal
ja: 異常
ko: 이상
zh_hans: 异常

# s_isConnecting
source: Device connecting...
ar: تم الإتصال بالجهاز
fr: Connexion en cours...
ja: デバイス接続中...
ko: 차량 연결중...
zh_hans: 设备连接中...

# r_verification_success
source: Verification code send successfully
ar: تم إرسال رمز التحقيق بنجاح
fr: Code de vérification envoyé avec succès
ja: 認証コード送信完了
ko: 인증코드 발송 완료
zh_hans: 发送验证码成功

# s_highSpeedModel
source: High speed mode
ar: سرعة عالية
fr: Mode grande vitesse
ja: ハイスピードモード
ko: 고속모드
zh_hans: 高速模式

# s_map_serviece
source: Map Service
ar: خدمة الخريطة
fr: Service de carte
ja: マップサービス
ko: 지도
zh_hans: 地图服务

# s_mode_1
source: Monochrome breath
ar: التنفس أحادي اللون
fr: Souffle monochrome
ja: 点灯モード1
ko: 모드1
zh_hans: 单色呼吸

# s_mode_2
source: Full-color breath
ar: نفحة كاملة الألوان
fr: Souffle multicolore
ja: 点灯モード2
ko: 모드2
zh_hans: 全彩呼吸

# s_mode_3
source: Two dragons play with a ball
ar: تنينان يلعبان بالكرة
fr: Deux dragons qui jouent avec un ballon
ja: 点灯モード3
ko: 모드3
zh_hans: 双龙戏珠

# s_mode_4
source: Full-color vector
ar: ناقلات باﻷوان الكاملة
fr: Vecteur multicolore
ja: 点灯モード4
ko: 모드4
zh_hans: 全彩分向

# s_mode_5
source: Single-color meteor
ar: نيزك مفرد اللون
fr: Météore monochrome
ja: 点灯モード5
ko: 모드5
zh_hans: 单色流星

# s_mode_6
source: Colorful meteor
ar: نيزك ملون
fr: Météore multicolore
ja: 点灯モード6
ko: 모드6
zh_hans: 炫彩流星

# s_mode_7
source: Alarm lamp mode 1
ar: تنبيه مصباح1
fr: Alarme de lampe mode 1
ja: パトライトモード1
ko: 모드7
zh_hans: 警灯模式1

# s_mode_8
source: Alarm lamp mode 2
ar: تنبيه مصباح2
fr: Alarme de lampe mode 2
ja: パトライトモード2
ko: 모드8
zh_hans: 警灯模式2

# s_mode_9
source: Alarm lamp mode 3
ar: تنبيه مصباح3
fr: Alarme de lampe mode 3
ja: パトライトモード3
ko: 모드9
zh_hans: 警灯模式3

# s_forward_LED
source: Headlight
ar: غلق المصباح الأمامي
fr: Activer les phares
ja: フロントLEDスイッチ
ko: 전조등
zh_hans: 前灯开关

# s_check_updateF
source: New firmware is discovered. Please upgrade for the latest version!
ar: برنامج ثابت جديد تم اكتشافه، قم بتحميا الاصدار الأخير
fr: Un nouveau logiciel est disponible. Mettez à jour la dernière version
ja: 新しいバージョンのファームウェアがあります。アップデートしてください。
ko: 새로운 펌웨어 버전이 있습니다. 업그레이드 하세요.
zh_hans: 检测到新固件，请升级！

# s_canshu
source: Parameter is wrong.
ar: العامل المتغير خطأ
fr: Le paramétrage est incorrect.
ja: データが正しくありません
ko: 파라미터 값이 일치하지 않습니다.
zh_hans: 参数不正确

# s_idcardfail
source: ID number is wrong.
ar: رقم الهوية خاطئ
fr: Le numéro d’identité est incorrect.
ja: 身分証番号が正しくありません
ko: 신분증 정보가 맞지 않습니다.
zh_hans: 身份证号不正确

# s_actFail
source: Communication with the scooter fails!
ar: فشل التواصل مع الدراجة البخارية الصغيرة
fr: Echec de la communication avec le véhicule!
ja: 車両との通信失敗。
ko: 본체와의 통신이 원활하지 않습니다!
zh_hans: 与车辆通讯失败！

# lRegisterFail03
source: Sorry，the username is less than 3 characters. Please enter a longer one.
ar: عفوا، اسم المستخدم أقل من 3رموز، يرجى إدخال اسم مستخدم أكبر
fr: Le nom d’utilisateur comporte moins de 3 caractères. Essayez un nom plus long.
ja: 入力したユーザー名が3文字未満になっています。3文字～15文字でユーザー名を入力してください。
ko: 죄송합니다. 입력하신 아이디가 3자리 이하입니다. 이보다 긴 아이디를 입력하세요.
zh_hans: 抱歉，您输入的用户名小于3个字符，请输入一个较长的用户名

# lRegisterFail04
source: Sorry, the username is more than 20 characters. Please enter a shorter one.
ar: عفوا، اسم المستخدم أكثر من 20رمز يرجى إدخال اسم مستخدم أقصر
fr: Le nom d’utilisateur comporte plus de 20 caractères. Essayez un nom plus court.
ja: 入力したユーザー名が15文字を超えています。3文字～15文字でユーザー名を入力してください。
ko: 죄송합니다. 입력하신 아이디가 20자리 이상입니다. 이보다 짧은 아이디를 입력하세요.
zh_hans: 抱歉，您的用户名超过20个字符，请输入一个较短的用户名

# lRegisterFail05
source: The username has been registered.
ar: تم تسجيل اسم المستخدم
fr: Le nom d’utilisateur a été enregistré.
ja: ユーザー名は既に使用されています。
ko: 이미 사용중인 아이디입니다.
zh_hans: 该用户名已被注册

# lRegisterFail06
source: Sorry, the username already exists. Please login and activate it.
ar: اسم المستخدم هذا موجود مسبقا، برجاء تسجيل الدخول وتفعيله
fr: Le nom d’utilisateur existe déjà. Enregistrez-vous et activez-le.
ja: すみません、ユーザー名は存在しています。ログインして本登録をしてください。
ko: 이미 가입한 아이디입니다. 홈페이지에 접속하여 아이디를 활성화 하세요.
zh_hans: 抱歉，您输入的用户名已存在，请登录站点激活此帐号

# s_sensorTip
source: We need to lock the vehicle to calibrate the gyroscope balance sensors. Please step off the vehicle now.
ar: 标定传感器需要锁车，是否继续?
fr: Le véhicule doit être verrouillé pour calibrer le capteur d’assiette. Verrouiller le véhicule ?
ja: センサー測定にはロックする必要があります、操作を続行しますか?
ko: 标신호 수신기를 지정하려면 잠금모드로 변경해야 됩니다. 계속 하시겠습니까?
zh_hans: 标定传感器需要锁车，是否继续?

# s_upCar
source: Get on
ar: 请上车
fr: Montez
ja: 車両に乗ってください。
ko: 탑승하세요
zh_hans: 请上车

# s_downCar
source: Please get off
ar: 请下车
fr: Descendez
ja: 車両から降りてください。
ko: 请하차하세요
zh_hans: 请下车

# w_jiHuozhuyi
source: Note: Fill in mobile number or/and email address
ar: 保险信息需要提供用户身份证，请确保您的姓名、电话与身份证号信息无误，保险信息一旦提交，将不可修改和补录!
fr: Complétez votre adresse email et/ou numéro de téléphone
ja: 保険契約はユーザーの個人情報の提供が必要です。身分証番号、お名前、電話番号が間違っていないことを確認してください。情報を送信すると追加や変更は不可となります。
ko: 주의:핸드폰번호과 이메일은 하나만 입력하세요.
zh_hans: 非常重要：被保险人必须为车辆实际使用人（满10周岁以上），保险信息为实际使用人的姓名、身份证号码与电话，请确保您的所有信息准确无误，保险信息一旦提交，将不可修改和补录。

# s_activeSuccess
source: You have completed the New Rider Tutorial. Your unit will be speed limited for the first 0.6 miles (1 km).
ar: 您已激活并完成新手教学，车辆在前1km处于限速模式，骑满1km后自动解除！
fr: Vous avez déjà activé le véhicule et suivi le tutoriel. Le véhicule est en mode limite de vitesse pendant 1 km, après lequel la limite sera levée.
ja: 本登録を完了し、チュートリアルをクリアしました。最初の1kmは10km/h以下までしかスピードが出せない制限が掛かっておりますが、この制限は1km以降で自動解除となります。
ko: 활성화 완료되었으며 초보자 가이드 과정이 완료되었습니다. 누적 주행거리 1KM까지는 속도 제한모드로 운행되며 1KM달성시 속도제한 해제를 가능합니다！
zh_hans: 您已激活并完成新手教学，车辆在前1km处于限速模式，骑满1km后根据提示解除限速！

# s_teach
source: Your tutorial is not finished. Please complete it for your and others’ safety.
ar: 您好，您的新手教学未完成，为了您和他人的安全，请完成新手教学。
fr: Votre tutoriel n’est pas terminé. Complétez ce tutoriel pour votre sécurité et celle des autres.
ja: こんにちは。チュートリアルがまだクリアしていません。安全のためチュートリアルをクリアしてください。
ko: 안녕하세요. 당신의 초보자 가이드 과정이 미완성 상태입니다. 당신과 타인의 안전을 위해 초보자 가이드 과정을 완성하시길 바랍니다.
zh_hans: 您好，您的新手教学未完成，为了您和他人的安全，请完成新手教学。

# w_zhinan_step1
source: Get on Carefully
ar: اركب بحرص
fr: Montez avec prudence
ja: 正しい乗車方法
ko: 안전탑승
zh_hans: 平稳上车

# w_zhinan_step2
source: Turning
ar: دور
fr: Allumez le moteur
ja: ステアリングをしてみましょう
ko: 원위치 회전
zh_hans: 原地转向

# w_zhinan_step3
source: Practice riding forward and stopping
ar: 前进十米并停止
fr: Entraînez-vous en conduisant tout droit et en vous arrêtant.
ja: 10m進み、止まってください
ko: 진입 10미터 및 정지
zh_hans: 前进十米并停止

# w_zhinan_step4
source: Get off Carefully
ar: تحتاج إلى غلق السيارة لمعايرة موقف جهاز الاستشعار، غلق السيارة؟
fr: Descendez avec prudence
ja: 正しい降り方
ko: 안전하차
zh_hans: 平稳下车

# w_zhinan_step5
source: Practice Lifting the vehicle
ar: 正确拎起和放下
fr: Entraînez-vous avec le véhicule
ja: 持上げ方と降ろし方
ko: 올바른 휴대법
zh_hans: 正确拎起和放下

# w_balance
source: Please maintain balance
ar: اركب
fr: Maintenez un équilibre
ja: バランスを保ってください
ko: 수평을 유지하세요
zh_hans: 请保持平衡

# s_medal
source: Medal
ar: من فضلك ترجل
fr: Médaille
ja: 勲章
ko: 메달
zh_hans: 勋章

# s_medalList
source: Medal list
ko: 메달 리스트
zh_hans: 勋章列表

# w_weizhangren
source: Unoccupied
ar: ملحوظ، املأ رقم الهاتف أو/و عنوان بريدي
fr: Inoccupé
ja: 乗車者がいません
ko: 탑승 대기
zh_hans: 未站人

# s_standOn
source: Occupied
ar: 已站人
fr: Occupé
ja: 乗車者がいます
ko: 탑승 완료
zh_hans: 已站人

# j_idcard
source: ID number
fr: Numéro d’identité
ja: 身分証番号
ko: 신분증번호
zh_hans: 身份证号

# j_phone
source: Phone
fr: Téléphone
ja: 携帯番号
ko: 핸드폰번호
zh_hans: 手机号

# j_mail
source: Email address
fr: Adresse email
ja: メールアドレス
ko: 이메일
zh_hans: 邮箱

# j_next
source: Next step
fr: Prochaine étape
ja: 次へ
ko: 다음 단계
zh_hans: 下一步

# j_guid
source: Guide for Safe Driving
fr: Guide pour une conduite en sécurité
ja: 安全運転ガイド
ko: 안전주행가이드
zh_hans: 安全驾驶指南

# j_real_name
source: Name
ar: الاسم
fr: Nom
ja: フルネーム
ko: 실명
zh_hans: 真实姓名

# j_btn_subimit
source: Submit
fr: Soumettre
ja: 送信
ko: 확인
zh_hans: 提交

# j_reminder_title
source: Prompts
fr: Invités
ja: ヒント
ko: 알림
zh_hans: 温馨提示

# j_reminder_oppose
source: Insist in refusal
fr: Confirmer le refus
ja: 保険を受け取りません
ko: 거절
zh_hans: 坚持不接受

# j_reminder_accept
source: Accept insurance
fr: Accepter l’assurance
ja: 保険を受け取ります
ko: 보험승인
zh_hans: 接收保险

# j_insurance_title
source: Terms of Insurance Policy
fr: Conditions de la police d’assurance
ja: 保険契約内容
ko: 保보험약관
zh_hans: 保单条款

# j_insurance_accept
source: I accept free accident insurance.
fr: J’accepte l’assurance personnelle accidents gratuite.
ja: Ninebotからの無料保険を受け取ります。
ko: 준비중입니다.
zh_hans: 我接受免费的意外伤害保险。

# j_insurance_title_list
source: Terms of Personal Accident Insurance
fr: Conditions de la police d’assurance personnelle accidents
ja: 人身意外保険内容
ko: 人준비중입니다.
zh_hans: 人身意外伤害保险条款

# j_tip_success
source: Activation Successful! You must review the Guide for Safe Driving. Your vehicle will remain in speed limiting mode for 0.6 miles (1 km).
fr: Succès de l’activation. Vous devez revoir le guide de conduite en sécurité ou le véhicule restera en mode limite de vitesse.
ja: おめでとうございます。本登録は完了しました。続いて"チュートリアル"、をクリアしないと車両は7km/hのスピーとリミットモードになります。安全のため、運転ガイドをよくお読みください。
ko: 축하합니다. 활성화 과정이 완료되었습니다. 초보자 가이드 과정을 완성하세요. 그렇지 않으면 7km/h의 안전모드로 운행됩니다.
zh_hans: 恭喜您已成功完成激活，请您继续完成"新手教学"，否则车辆将一直处于7km/h的安全限速模式。

# j_tip_insurance_success
source: Congratulations on your successful activation. Please continue "Tutorial"，otherwise the scooter will remain under safe speed-limiting mode of 7km/h. Note： Your policy information is submitted. Please check your SMS for feedback in time.
fr: Félicitations pour votre activation. Continuez les tutoriels, sinon le véhicule restera en mode limite de vitesse (7km/h). Votre police d’assurance a été soumise ? Vérifiez vos SMS pour avoir cette information en temps réel.
ja: 附：保険に関する情報を送信しました。携帯のメールを確認してください。
ko: 축하합니다. 활성화 과정이 완료되었습니다. 초보자 가이드 과정을 완성하세요. 그렇지 않으면 7km/h의 안전모드로 운행됩니다.
zh_hans: 附：您的保险信息已成功提交，具体反馈请已手机短信为准。

# j_tip_insurance_repeat
source: You already receive the personal accident insurance provided by Ninebot, with insurance no. XXXX. Repeated receiving is not allowed.
fr: Vous avez déjà soumis à l’assurance personnelle accident fournie par Ninebot, avec le numéro d’assurance XXXX. Vous ne pouvez pas demander une seconde souscription.
ja: Ninebotからの無料保険を受取済みです。契約番号は：xxxx、重複の受取はできません。
ko: 준비중입니다.
zh_hans: 您已经领取过Ninebot赠送的人身意外保险，保单号为xxxx，不能重复领取。

# j_tip_name_nil
source: Real name can not be empty!
ar: 真实姓名不能为空!
fr: Le vrai nom ne peut pas être vide.
ja: フルネームの入力に空欄は不可です。
ko: 실명은 필수 입력 항목입니다!
zh_hans: 真实姓名不能为空！

# j_tip_sex_worng
source: Gender can not be empty!
ar: 性别不能为空!
fr: Le gendre ne peut pas être vide.
ko: 성별은 필수 입력 항목입니다!
zh_hans: 性别不能为空！

# j_tip_idcard_worng
source: ID number can not be empty!
ar: 身份证号不能为空!
fr: Le numéro d’identité ne peut pas être vide
ja: 身分証番号の入力に空欄は不可です。
ko: 신분증번호는 필수 입력 항목입니다!
zh_hans: 身份证号不能为空！

# j_tip_mail_worng
source: Email address can not be empty!
ar: 邮箱不正确!
fr: L’adresse email ne peut pas être vide
ja: メールアドレスが間違っています。
ko: 유효한 이메일 주소가 아닙니다!
zh_hans: 邮箱不正确！

# j_tip_name_worng
source: Name can not be empty!
ar: 姓名不能为空!
fr: Le nom ne peut pas être vide
ja: お名前の入力に空欄は不可です。
ko: 성명은 필수 입력 항목입니다!
zh_hans: 姓名不能为空！

# j_tip_contine
source: Continue to activate
ar: 继续激活
fr: Continuez pour l’activation
ja: 本登録を続行
ko: 계속 활성화
zh_hans: 继续激活

# j_tip_complete
source: Congratulations on completion of tutorial
ar: 恭喜您，新手教学已完成
fr: Félicitations ! Vous avez terminé le tutoriel.
ja: おめでとうございます。チュートリアルをクリアしました。
ko: 축하합니다. 초보자 가이드를 완성하였습니다.
zh_hans: 恭喜您，新手教学已完成

# s_singelTime
source: Current Ride Time
ar: وقت القيادة الحالي.
fr: Temps actuel de conduite
ja: 区間乗車時間
ko: 이번 운행시간
zh_hans: 本次行驶时间

# InputOrNumber
source: Please input letters or numbers
ar: برجاء إدخال حروف أو أرقام.
fr: Renseignez des lettres ou des numéros
ja: 半角英数字を入力してください
ko: 영문 문자 또는 숫자를 입력하세요.
zh_hans: 请输入字母或数字

# update_tip_updating_ctrl
source: Begin to update controller's firmware!
ar: البدء بتحديث نظام التحكم!
fr: Commencez par mettre à jour le logiciel de contrôle.
ja: メインコントロールボードファームウェアをアップデートしています。
ko: 메인보드 펌웨어 업그레이드 중…
zh_hans: 正在升级主控板固件

# update_tip_updating_driv
source: Begin to update driver's firmware!
ar: البدء بتحديث برامج تشغيل النظام
fr: Commencez par mettre à jour le logiciel du conducteur
ja: アップデート駆動ファームウェアをアップデートしています。
ko: 구동보드 펌웨어 업그레이드 중…
zh_hans: 正在升级驱动固件

# update_tip_updating_ahrs
source: Begin to update AHRS's firmware!
ar: الخاص بالنظام!AHRS البدء بتحديث
fr: Commencez par mettre à jour le logiciel AHRS.
ja: アップデートAHRSボードファームウェアをアップデートしています。
ko: AHRS보드 펌웨어 업그레이드 중…
zh_hans: 正在升级AHRS板固件

# update_tip_updating_dash
source: Begin to update dashboard's firmware!
ar: ! البدء بتحديث البرامج الثابتة للوحة التحكم
fr: Commencez par mettre à jour le logiciel de tableau de bord.
ja: アップデートダッシュボードファームウェアをアップデートしています。
ko: 계기판 펌웨어 업그레이드 중…
zh_hans: 正在升级仪表盘固件

# update_tip_updating_ble
source: Begin to update BLE's firmware!
ar: !BLE البدء بتحديث البرامج الثابتة لـ
fr: Commencez par mettre à jour le logiciel de BLE
ja: アップデートブルートゥースモジュールファームウェアをアップデートしています。
ko: 블루투스 모듈 펌웨어 업그레이드 중…
zh_hans: 正在升级蓝牙模块固件

# update_tip_updating_bms
source: Begin to update BMS's firmware!
ar: !BMS البدء بتحديث البرامج الثابتة لـ
fr: Commencez par mettre à jour le logiciel BMS.
ja: アップデートバッテリー管理モジュールファームウェア
ko: 배터리 컨트롤모듈 펌웨어 업그레이드 중…
zh_hans: 正在升级电池管理模块固件

# update_tip_updating_bms_success
source: Firmware upgrade success! Since the battery module firmware upgrade, the vehicle will automatically shut down, and then you manually power the vehicle connector!
ar: تم تعديل نظام السيارة بنجاح. وعليه سوف تتوقف السيارة وعليك تشغيلها يدويًا.
fr: Succès de la mise à jour du logiciel. Lors de la mise à jour du logiciel de la batterie, le véhicule va automatiquement s’éteindre, vous devrez le rallumer manuellement.
ja: ファームウェアアップデート完了。バッテリーモジュールファームウェアはアップデートしたため、車両は自動シャットダウンします。手動で起動してから再度接続をしてください。
ko: 펌웨어 업그레이드 완료. 배터리 관리모듈 펌웨어가 업그레이드 됨으로 본체 전원이 자동으로 꺼집니다. 다시 전원 켜서 연결하시길 바랍니다!
zh_hans: 固件升级成功！由于升级了电池模块固件，车辆会自动关机，请您手动开机后再进行车辆连接！
