Repository: sxm5220/sxm-ios
Catalog: Ninebot/*.lproj/Localizable.strings
Languages: ar, fr, ja, ko, zh_hans

# s_assistance_mode
source: Enter Assi mode by click pedal
ko: 발판 누르면 견인 모드로 변환합니다.
zh_hans: 点击脚踏板进入助力模式

# nb_nfans_language_apply
source: Apply to whole N fan club
ko: N밴드 전체에 적용됩니다.
zh_hans: 应用于整个N粉圈

# s_energyRecovery2
source: 中
zh_hans: 强

# s_energyRecovery1
source: 强
zh_hans: 中

# nb_nfans_send_edit
source: Confirm to quit edit?
ko: 편집을 취소하시겠습니까？
zh_hans: 确定退出此次编辑

# nb_nfans_rule_title
source: NFans Club Regulations
ar: NFans Club Regulationss
fr: NFans Club Regulationss
ja: NFans Club Regulationss
ko: N밴드 관리 규정 설명
zh_hans: N粉圈管理规则说明

# nb_search_tip_forbit
source: Forbidden %@ to post in N fans club？
ko: %@ 에 대해 게시금지 하시겠습니까?
zh_hans: 是否禁言 %@ ?

# nb_search_tip_noforbit
source: Release %@ to post in N fans club?
ko: %@ 에 대해 게시금지를 해제하시겠습니까?
zh_hans: 是否解禁 %@ ?

# s_not_filled
source: Unbound
ko: 未绑定
zh_hans: 未绑定

# s_complete_email
source: revise email
ko: 메일주소 수정
zh_hans: 邮箱修改

# s_input_newEmail
source: Input new email account
ko: 메일 주소 입력하세요
zh_hans: 请输入新的邮箱

# s_newEmail_information
source: Ninebot will send verification message to your email, please check.
ko: Ninebot등록된 메일 주소로 인증 메세지 발송이 됩니다.확인 바랍니다.
zh_hans: Ninebot会向您的新邮箱发送一条验证消息，请您及时查收

# s_emailCode_fail
source: Verification code error or out of time
ko: 인증코드 입력이 잘못 되였거나 입력 시간 초과 되였습니다.
zh_hans: 验证码错误或过期

# s_emailCode_sendFail
source: fail to send verification code
ko: 인증코드 발송 실패되였습니다.
zh_hans: 验证码发送失败

# backgroundRunSwitch
source: Switch of background run reminder
ko: 백그라운드 실행 알림 허용
zh_hans: 后台运行提醒开关

# backgroundRunSwitchTip
source: After switch turned off, if there are any abnormal ridding behaviors, app will not give a notice when app is run background.
ko: 알림 허용을 끄면 경고 및 알림 기능이 작동되지 않습니다.
zh_hans: 关闭开关后，当APP在手机后台运行时，如果有违规行为，APP将不再进行提示

# settings_other_bt_name_restart
source: Require to restart the vehicle after bluetooth name modified! please restart your vehicle!
ar: لابد لإعادة تشغيل المركبة إعادة تسمية البلوتوث! من فضلك أعد تشغيل المركبة!
fr: Nécessite le redémarrage du véhicule après la modification du nom Bluetooth. Redémarrez le véhicule
ja: ブルートゥースの名称を変更後、設定を反映するには再起動する必要があります。 手動で車両を再起動してください。
ko: 블루투스 이름 변경시 전원 재부팅 후 적용됩니다. 재연결 하십시오!
zh_hans: 修改完蓝牙名称后需要重启车辆才能生效! 请手动重启车辆!

# s_upgradeUserNameTip
source: Note：The user is used for login, only allowed to modified once, please be careful to fill in.
ko: 사용자 로그인 것은 주의하십시오 데 사용할 수 있도록 수정, 단지 한 번 조심해서 쓰세요
zh_hans: 请注意，用户名是用于登录使用，只允许修改一次，请谨慎填写!

# s_transMode
source: Shipping mode
ko: 전원버튼 설정
zh_hans: 运输模式

# s_transModeTip
source: Once this function is on, you have to press the turn on/off button for several seconds to turn on unit, which can make sure unit will not be turned on automatically when turn on/off button pressed by error or incident during delivery.
ko: 해당 기능을 활성화하면 전원버튼을 길게 눌러야 시동이 켜집니다. 이러한 설정은 운반 또는 보관중의 실수로 전원이 켜지는 것을 방지할 수 있습니다.
zh_hans: 打开此功能后，按键将会进入长按开机状态，这样可以保证运输过程中的按键误触发导致开机

# m_TeachTip_speed
source: The beginner teaching has not completed at this vehicle, the speed limit cannot be modified. Do you want to complete?
ko: 해당 제품은 초보자 가이드를 완성하지 않아 속도제한을 해제할 수 없습니다. 지금 초보자 가이드를 진행할까요?
zh_hans: 该车辆尚未完成新手教学，不能修改限速值。是否去完成新手教学？

# s_backfast_alarm
source: Warning when going back too quickly.
ko: 후진속도가 빠릅니다.
zh_hans: 后退速度过快报警

# s_parameter_nil
source: Specification is null.
ko: 파라미터 값！
zh_hans: 参数为空！

# s_openLocal
source: Are you sure to turn on current location to use this function? (Settings-Privacy-Location Service-Ninebot)
ko: 위치사용 허용을 해야 해당 기능을 사용할 수 있습니다. 위치사용 허용을 할까요?（설정->개인 정보 보호->위치 서비스->Ninebot）
zh_hans: 当前功能需要开启本地定位，否则无法使用，是否开启定位？（手机设置->隐私->定位服务->Ninebot）

# s_driverTemp
source: Temperature of driver
ko: 드라이버기판 온도
zh_hans: 驱动器温度

# l_no_search_result
source: No data found
ko: 안 데이터
zh_hans: 无搜索结果

# s_local_rank
source: Local Ranking
ar: Local Ranking list
fr: Local Ranking list
ja: Local Ranking list
ko: 현지역 랭킹
zh_hans: 本地排行

# s_currentlocal
source: Current location :
ko: 현재위치:
zh_hans: 当前位置:

# s_orig_pwdFail
source: Original password is incorrect!
ko: 기존 비밀번호가 맞지 않습니다.
zh_hans: 原密码有误！

# s_limitSpeed_Intro_tip
source: You vehicle will automatically adjust the speed limit value according to battery capacity, temperature, load and driving habits. When the pointer arrives at the red dashed part, it indicates you have exceeded the speed limit, and the vehicle will gradually lean back and limit speed. Please drive carefully.
ko: 제품은 배터리 잔량, 온도, 하중과 운전 스타일 등에 의해 자동으로 제한 속도를 조절합니다. 속도 게이지 지침 표시가 빨간색 점선까지 도달하면 과속되었음을 표시입니다.이때 제품은 서서히 뒤로 젖히면서(발판 헤드업) 속도를 줄입니다. 운전 시 주의바랍니다.
zh_hans: 车辆根据电量、温度、负载和驾驶习惯等自动调整限速值，指针到达红色虚线部分表示您已超速，车辆将逐渐后仰限速，请小心驾驶！

# s_remainderRange_tip
source: The remaining mileage is the rated value, which is associated with temperature, tire pressure, and driver’s weight. Please take the actual situation as the criterion.
ko: 해당 주행잔여거리는 정격 수치입니다. 이 수치는 온도, 타이어 공기압, 사용자 몸무게 등에 의한 오차가 있습니다. 주행잔여거리는 실제 상황에 따라 판단하시기 바랍니다.
zh_hans: 该剩余里程为额定值，剩余里程与温度、胎压、驾驶者体重相关，请以实际情况为准！

# l_nfans_forbit_title
source: Banned from posting
ko: 게시제한
zh_hans: 禁言

# s_limitSpeedMode_Tips
source: Enable speed limit mode?
ar: Are you sure to switch to the speed limited mode?
fr: Are you sure to switch to the speed limited mode?
ja: Are you sure to switch to the speed limited mode?
ko: 속도제한모드로 변경하시겠습니까?
zh_hans: 您确定要切换为限速模式吗？

# l_fans_forbit_cancle
source: Ban cancelled
ko: 사용자 리스트
zh_hans: 取消禁言

# l_fans_no_forbit
source: Ban lifted
ko: 금지 해제
zh_hans: 解禁

# l_search_user_list
source: List of users
ko: 사용자 리스트
zh_hans: 用户列表

# l_search_dynamic_list
source: List of dynamics
ko: 게시글 리스트
zh_hans: 动态列表

# l_search_forbit_list
source: List of bans
ko: 게시제한 리스트
zh_hans: 禁言列表

# l_search_more
source: View more
ko: 더 보기
zh_hans: 查看更多内容

# l_search_totle
source: Total
ko: 총
zh_hans: 共

# l_search_page
source: pages
ko: 장
zh_hans: 张

# l_search
source: Search
ko: 검색
zh_hans: 搜索

# m_goto_Activation
source: Activate
ko: 활성화로 가기
zh_hans: 去激活

# m_my_Npoints
source: My N coins
ko: 나의 N머니
zh_hans: 我的N币

# m_Npoints_Details
source: N coins in details
ko: N머니 내역
zh_hans: N币明细

# m_integral_Rule
source: Point rules
ko: 포인트 규정
zh_hans: 积分规则

# m_Npoints_Rule
source: N coin rules
ko: N머니 규정
zh_hans: N币规则

# m_MyGrade
source: My grade
ko: 나의 등급
zh_hans: 我的等级

# m_Grade_Detaile
source: Grade in details
ko: 등급 상세보기
zh_hans: 等级详情

# m_Grade_Name
source: Grade name
ko: 등급 명칭
zh_hans: 等级名称

# m_points
source: Point
ko: 포인트
zh_hans: 积分

# m_Update_NeedPoints
source: Points for upgrading
ko: 레벨업 포인트
zh_hans: 升级所需积分

# m_All_Points
source: Total points
ko: 총 포인트
zh_hans: 总积分

# m_Attendance
source: Signed in
ko: 출석체크
zh_hans: 签到

# s_userLevel
source: Level
ko: 등급
zh_hans: 等级

# Input1_15
source: Please input 1-15 characters or digits
ko: 1-15자리의 영문자 또는 숫자를 입력하세요.
zh_hans: 请输入1-15位字符

# s_rideTip
source: Drive carefully!
ko: 안전 운전 하십시오.
zh_hans: 请小心驾驶！

# s_mini_warning_1
source: Battery is too low. Please recharge!
ko: 배터리 잔량이 부족합니다. 충전하세요！
zh_hans: 电池电量过低，请充电！

# s_mini_warning_2
source: Vehicle body temperature is too high!
ko: 차체의 온도가 높습니다！
zh_hans: 车体温度过高！

# s_mini_warning_3
source: Vehicle body temperature is too low!
ko: 차체의 온도가 낮습니다！
zh_hans: 车体温度过低！

# s_mini_warning_4
source: Battery temperature is too high!
ko: 배터리의 온도가 높습니다！
zh_hans: 电池温度过高！

# s_mini_warning_5
source: Battery temperature is too low!
ko: 배터리의 온도가 낮습니다！
zh_hans: 电池温度过低！

# s_mini_warning_6
source: Reverse speed is too fast. Please drive carefully!
ko: 후진 속도가 너무 빠릅니다. 안전 운전 하세요.
zh_hans: 后退速度过快，请小心驾驶！

# s_mini_warning_7
source: Motor is stalling. Please drive carefully!
ko: 모터의 부하현상이 있습니다. 전류 오류, 안전 운전 하세요!
zh_hans: 电机堵转，请小心驾驶！

# s_mini_warning_8
source: Vehicle is tumbling accidentally. Please drive carefully!
ko: 제품이 넘어졌습니다. 안전 운전 하세요！
zh_hans: 车辆异常摔倒，请小心驾驶！

# s_mini_warning_9
source: Vehicle is in lock mode!
ko: 제품이 잠금 모드에 있습니다！
zh_hans: 车辆处于锁车模式！

# s_mini_warning_10
source: You are over the speed limit. Please drive carefully!
ko: 과속하였습니다. 안전 운전 하세요！
zh_hans: 您已超速，请小心驾驶！

# s_mini_warning_11
source: You have been over the speed limit excessively. Please drive carefully.
ko: 과속 경고입니다. 바로 감속하세요！
zh_hans: 您已严重超速，请立即减速！

# s_mini_warning_12
source: The battery voltage is too high. Please don’t drive down a slope or slam the brakes on and avoid energy recycle that leads to over-charge of the battery!
ko: 배터리 전압이 높습니다. 내리막길을 주행하거나 급브레이크를 하지마세요!
zh_hans: 电池电压过高，请勿下坡或急刹车，防止能量回收导致电池过充电！

# s_mini_warning_13
source: The motor is close to being overload. Please slow down immediately!
ko: 모터 과부하 현상이 있습니다. 가속하지 마세요！
zh_hans: 电机即将过载，请立即减速！

# s_mini_warning_14
source: The output power of your vehicle is too high. Please slow down immediately!
ko: 제품 출력이 높습니다. 가속하지 마세요！
zh_hans: 车辆输出功率过大，请立即减速！

# s_mini_warning_15
source: The motor torque is too large. Please drive carefully!
ko: 모터의 토크가 높습니다. 가속하지 마세요！
zh_hans: 电机扭矩过大，请小心驾驶！

# s_mini_warning_16
source: You are speeding up too fast. Please drive carefully!
ko: 급가속 경고입니다. 안전 운전 하세요！
zh_hans: 您加速过猛，请小心驾驶！

# s_mini_warning_17
source: Battery voltage is low, please be careful when riding.
ko: 배터리 전압이 낮습니다. 조심하여 운전하세요！
zh_hans: 电池电压过低，请小心驾驶！

# s_mini_warning_18
source: Foot sensor is tilting back because of high speed, vehicle will be slow down.
ko: 고속주행중 발판센서에서 발이 분리되었음을 감지하였습니다. 발판이 서서히 들리면서 감속될 것입니다!
zh_hans: 高速下脚踏开关抬起，车辆将逐渐后仰降速！

# s_average_power_consumption
source: Average power consumption
ko: 배터리 평균 사용량
zh_hans: 平均耗电量

# s_limit_speed
source: Max speed
ko: 속도제한
zh_hans: 限速

# s_markII_error_1
source: Fault of motor sensor or motor is not connected.
ko: 모터 홀센서 오류 또는 모터 미연결
zh_hans: 电机霍尔传感器异常，或者电机未连接。

# s_markII_error_2
source: Failure of motor A current.
ko: 드라이버 A상전류 오류
zh_hans: 驱动器A相电流异常

# s_markII_error_3
source: Failure of motor B current
ko: 드라이버 B상전류 오류
zh_hans: 驱动器B相电流异常

# s_markII_error_4
source: Failure of motor C current.
ko: 드라이버 C상전류 오류
zh_hans: 驱动器C相电流异常

# s_markII_error_6
source: Vehicle S/N is the initial S/N
ko: 본체 시리얼번호가 초기 시리얼번호입니다.
zh_hans: 车体序列号为初始序列号

# s_markII_error_10
source: Battery #1: abnormal communication.
ko: 배터리1 통신 오류
zh_hans: 电池1通信异常

# s_markII_error_11
source: Battery #2: abnormal communication.
ko: 배터리2 통신 오류
zh_hans: 电池2通信异常

# s_markII_error_12
source: Failure of gyroscope initialization
ko: 자이로스코프 초기화 오류
zh_hans: 陀螺仪初始化异常

# s_markII_error_13
source: Failure of gyroscope calibration
ko: 자이로스코프 교정 오류
zh_hans: 陀螺仪标定异常

# s_markII_error_14
source: Battery #1: abnormal output.
ko: 배터리1 출력 오류
zh_hans: 电池1输出异常

# s_markII_error_15
source: Battery #2: abnormal output.
ko: 배터리2 출력 오류
zh_hans: 电池2输出异常

# s_markII_error_16
source: Battery #1: abnormal temperature.
ko: 배터리1 온도 오류
zh_hans: 电池1温度异常

# s_markII_error_17
source: Battery #2: abnormal temperature.
ko: 배터리2 온도 오류
zh_hans: 电池2温度异常

# s_markII_error_24
source: Error of general voltage.
ko: 메인 전압 오류
zh_hans: 主电压异常

# s_markII_error_25
source: Error of voltage upgrade
ko: 승압 전압 오류
zh_hans: 升压电压异常

# s_markII_error_26
source: Error of system clock
ko: 시스템 시간에 오류가 있습니다.
zh_hans: 系统时钟存在异常

# s_markII_error_27
source: Error of current calibration.
ko: 전류 교정 오류
zh_hans: 电流标定异常

# s_markII_error_28
source: Battery #1: abnormal power supply
ko: 배터리1 전원 공급 선로 오류
zh_hans: 电池1供电通路异常

# s_markII_error_29
source: Battery #2: abnormal power supply
ko: 배터리2 전원 공급 선로 오류
zh_hans: 电池2供电通路异常

# s_markII_error_30
source: Temperature sensor open circuit.
ko: 온도 감응 센서 개회로
zh_hans: 温度传感器开路

# s_markII_error_31
source: Temperature sensor is short circuit.
ko: 온도 감응 센서 폐회로
zh_hans: 温度传感器短路

# s_markII_error_32
source: Battery 1 password incorrect.
zh_hans: 电池1密码错误

# s_markII_error_33
source: Battery 2 password incorrect.
zh_hans: 电池2密码错误

# s_markII_error_34
source: Battery cell of battery 1 is in big differential pressure.
zh_hans: 电池1电芯压差过大

# s_markII_error_35
source: Battery cell of battery 2 is in big differential pressure.
zh_hans: 电池2电芯压差过大

# s_markII_error_36
source: Battery 1 comes into testing model.
zh_hans: 电池1进入测试模式

# s_markII_error_37
source: Battery 2 comes into testing model.
zh_hans: 电池2进入测试模式

# s_error_code_desc_default
source: Undefined error.
ko: 알 수 없는 에러코드
zh_hans: 未定义

# s_ikonw
source: Well noted.
ko: 확인
zh_hans: 我知道了

# s_dashboard_tip
source: Dashboard reminder
ko: 계기판 알림
zh_hans: 仪表盘提示

# s_hightSpeed_tip
source: Red dashed line indicates over-speed, please slow down when overpassed this line.
ko: 빨간색 점선은 과속 표시입니다. 빨간 눈금선을 넘을 경우 안전에 주의하여 주행하시기 바랍니다.
zh_hans: 红色虚线部分表示速度过大，超过此刻度请注意安全驾驶

# PhoneLogin
source: Register
ko: 가입
zh_hans: 手机登录

# setting_other_sn_warnning_invalid_location
source: Location info get failure!
ko: 위치를 확인하지 못했습니다！
zh_hans: 未获取到位置信息！

# s_batterChangeTip
source: Battery change reminder
ko: 배터리 교체 알림
zh_hans: 电池变动提示

# s_oneBatterTip
source: Dear client, one battery only is detected, and please note that: 1) mileage will be
ko: 현재 귀하의 제품에 배터리가 한 개만 장착했습니다. 이로 인해 다음과 같이 성능이 하향니다： 1）배터리 만충 시 최대 주행거리
zh_hans: 尊敬的用户，检测到车辆只有一块电池，由此带来的变化如下： 1）电池满电续航里程变为

# s_oneBatterySpeedValue
source: 2) max speed is
ko: 2）최고속도
zh_hans: 2）最大速度变为

# s_batterUpgradeTip
source: Battery upgrade reminder
ko: 배터리 업그레이드 알림
zh_hans: 电池升级提示

# s_doubleBatterTip
source: Congratulations. Battery upgrade successful! After upgrade, 1) mileage will be
ko: 축하합니다. 배터리가 업그레이드 되었습니다. 업그레이드 후 성능이 다음과 같이 상향됩니다： 1）배터리 만충 시 최대 주행거리
zh_hans: 尊敬的用户，您好，恭喜您的电池升级成功！升级后： 1）满电续航里程变为

# TargetSNInputError
source: The two target Serial no. is not consistent with each other, please input again!
ko: 두번 입력한 시리얼번호가 다릅니다. 다시 입력해 주세요.
zh_hans: 两次输入目标序列号不一致，请重新输入！

# Target_identification_sn
source: Confirm the target serial no.:
ko: 변경할 시리얼번호 확인란:
zh_hans: 确认目标序列号:

# s_carrySwitch
source: Switch of auto shut off once vehicle lifted up
ko: 휴대모드 설정
zh_hans: 拎车关机开关

# s_battery1
source: Battery1
ko: 배터리1
zh_hans: 电池1

# s_battery2
source: Battery2
ko: 배터리2
zh_hans: 电池2

# speed_limit_active
source: The vehicle has not been activated, the speed limit cannot be modified
ko: 해당 제품은 활성화한 제품이 아닙니다. 주행속도를 설정할 수 없습니다.
zh_hans: 该车辆尚未激活，不能修改限速值

# l-active-Congratulations
source: Congratulations!
fr: Félicitations
ja: おめでとうございます
ko: 축하합니다
zh_hans: 恭喜

# nb_nfans_message_unread
source: Unread Message
ko: 새로운 메세지
zh_hans: 未读消息

# nb_nfans_language_title
source: Please select a language
fr: Tri par langue
ko: 언어 선택
zh_hans: 请选择语言

# s_nplace_title
source: N Fans Club
ar: Nدوران مروحة
fr: Communauté
ja: Nファンゾーン
ko: N밴드
zh_hans: N粉圈

# l-map-clear_location_fail
source: Fail to clear my location
ar: فشل في توضيح موقعي
fr: Echec pour effacer ma localisation
ja: 位置情報クリア失敗
ko: 나의 위치정보를 삭제하는데 실패하였습니다.
zh_hans: 清除我的位置信息失败

# l_map_location_error
source: Locating error, please turn on location service.
ar: خطأ في تحديد الموقع، من فضلك افتح خدمة تحديد الموقع
fr: Erreur de localisation, activez le service de localisation
ja: 位置情報機能エラー。位置情報をONにしてください。
ko: 위치정보에 접근할 수 없습니다. 먼저 위치정보 사용을 허용하세요.
zh_hans: 定位错误，请打开定位服务

# l_calculator_remian_mil
source: The remaining mileage is theoretical reference value provided under the special testing conditions. The actual mileage may differ due to different temperature, terrain, speed, rider's weight, riding habits and frequency of use and other factors.
ar: يعد إجمالي الأميال الباقية للسيارة قيمة نظرية ويخضع لظروف اختبارات خاصة. قد تختلف القيمة الفعلية مع اختلاف درجة الحرارة والتضاريس والسرعة ووزن قائد السيارة وعادات القيادة والدوام عليها وغيرها من العوامل.
fr: La fonction d’autonomie restante est un indicateur théorique selon les données renseignées et non un compteur exact. L’autonomie restante va différer selon les conditions d’utilisation : poids, température, type de terrain, style de conduite, etc.
ja: 走行可能距離数は参考用のある条件下のテスト理論値です。実際は温度、地形、速度、体重、乗車習慣、使用回数によってなど異なります。
ko: 주행가능 거리는 일정한 사용환경의 조건에 추정된 수치입니다. 실제 주행거리는 온도, 지형, 속도, 몸무게, 주행스타일, 시동횟수 등 여러가지 요소의 영향을 받습니다.
zh_hans: 剩余里程只是参考理论值，是在给定条件下测试的数值。实际续航受温度，地形，速度体重，骑行习惯和使用次数等影响会有所不同

# activate_title
source: Activate
ar: تفعيل
fr: Activer
ja: 本登録
ko: 활성화
zh_hans: 激活

# activate_ing
source: Activating...
ar: منشط..
fr: En cours d’activation...
ja: 本登録中..
ko: 활성화...
zh_hans: 激活中

# nfans-chat-new
source: Say something
ar: قل شيئا
fr: Parlez
ja: 何かを書き込みましょう
ko: 내용을 입력하십시오.
zh_hans: 说点什么呢

# map_nearby_change_google
source: Change to Google Map
ar: غير إلى خريطة جوجل
fr: Changer pour Google Map
ja: Googleマップに切替
ko: 구글맵 열기
zh_hans: 切换至谷歌地图

# map_nearby_change_baidu
source: Change to Baidu Map
fr: Changer pour Baidu Map
ja: Baiduマップに切替
ko: 바이두맵 열기
zh_hans: 切换至百度地图

# s_noMoreMessage
source: No more message
ar: لا مزيد من الرسائل
fr: Pas d’autres messages
ja: メッセージがありません。
ko: 더 이상 뉴스가 없습니다
zh_hans: 没有更多消息

# l_nfans_photo_fail
source: Save failed
ar: فشل الحفظ
fr: Echec de la sauvegarde
ja: 保存失敗
ko: 저장 실패
zh_hans: 保存失败

# l_nfans_photo_success
source: Save to album success
ar: يحفظ في ألبوم النجاحات
fr: Sauvegarde dans l’album
ja: アルバムに保存しました。
ko: 저장할 앨범 성공
zh_hans: 成功保存到相册

# t_sure_togo
source: Check
ar: تحقق
fr: Vérifier
ja: 詳細を見る
ko: 보기
zh_hans: 确认查看

# l_nfans_picture_fail
source: Image loading failed
ar: فشل في تحميل الصورة
fr: Echec du chargement de l’image
ja: 画像読込失敗
ko: 그림 불러오기 실패
zh_hans: 图片加载失败

# s_mileage_check
source: The mileage stored in the cloud server is longer than this vehicle's mileage, are you sure to synchronize the mileage?
ar: تخزين عدد الأميال في الكلاودسيرفر أطول من تخزينه على حامل الأميال هذا، هل أنت متأكد من تزامن عدد الأميال؟
fr: Le kilométrage enregistré dans le cloud du serveur est plus long que le kilométrage de ce véhicule. Etes-vous sur de synchroniser le kilométrage?
ja: クラウドで保存されている距離データは車両本体に保存している距離データを上回っていますが、クラウドと同じように同期しますか。
ko: 본 차량은 클라우드 서버에 기록된 마일리지 보다 높습니다, 마일리지를 동기화 하겠습니다？
zh_hans: 检测到该车辆储存于云服务器上的里程数高于车辆里程数，是否同步里程到车辆？

# s_no_permissions
source: You do not grant the after-sales permission, so this operation cannot be done!
ar: لم توافق على تصريح ما بعد البيع، لذا هذه العملية لن تكتمل
fr: Vous n’avez pas souscrit au service d’après-vente, cette opération ne peut pas être réalisée.
ja: アフター権限がありません。操作できません。
ko: 사용 권한이 없습니다!
zh_hans: 您没有售后权限，无法操作！

# s_sysmile_fail
source: Fail to get mileage, so the mileage cannot be synchronized!
ar: يمكن تزامنها!
fr: Echec pour récupérer le kilométrage, le kilométrage n’a pas pu être synchronisé.
ja: 距離データ取得できませんでした。同期できません。
ko: 마일리지 데이터 가져오기 실패, 동기화 실패！
zh_hans: 里程获取失败，无法继续同步里程！

# s_sysfail
source: Fail to synchronize the mileage, please try again!
ar: فشل في تزامن عدد الأميال، يرجى إعادة المحاولة مرة أخرى!
fr: Echec pour synchroniser le kilométrage, essayez encore
ja: 距離データ同期失敗、もう一度操作してください
ko: 마일리지 동기화 실패, 다시 시도하십시오！
zh_hans: 里程同步失败，请重新尝试！

# l_nfans_copy
source: Copy
ar: نسخ
fr: Copie
ja: コピー
ko: 복사
zh_hans: 复制

# t_not_login
source: Your did not login in, please login in first.
ar: لم تسجل بعد، برجاء قم بالتسجيل أولا.
fr: Vous n’êtes pas connecté. Connectez-vous en premier.
ja: ログインしていません。ログインしてください。
ko: 현재 로그아웃 상태입니다. 먼저 로그인 하세요.
zh_hans: 当前为未登录状态，请先登录

# l_user_herderImgView_success
source: Head portrait update succeeds
ar: تم تحديث صورة الرئيس بنجاح!
fr: Succès de la mise à jour de la photo de portrait
ja: プロフィール写真変更完了。
ko: 프로필 사진이 업데이트 되었습니다
zh_hans: 头像修改成功！

# l_user_headerImgView_fail
source: Head portrait update fails
ar: فشل في تحديث صورة الرئيس
fr: Echec de la mise à jour de la photo de portrait
ja: プロフィール写真変更失敗。
ko: 프로필 사진이 업데이트 실패했습니다
zh_hans: 头像修改失败！

# s_sysnmileage
source: Synchronous mileage
ar: عدد أميال متزامن
fr: En cours de synchronisation
ja: 距離データを同期します。
ko: 마일리지 동기화
zh_hans: 同步里程

# s_sysSuccess
source: Synchronized success!
ar: تزامن ناجح!
fr: Succès de la synchronisation
ja: 距離データ同期完了。
ko: 마일리지 동기화 완료！
zh_hans: 里程同步成功！

# s_tip
source: Auto-check notice
ar: إنذار بتحقق اوتوماتيكي
fr: Vérification automatique
ja: 自己チェックリマインド
ko: 자체점검 팁
zh_hans: 自检提示

# s_snError
source: The serial no. of vehicle's controller is error, please contact after-sales for service.
ar: فشل في رقم تسلسل تحكم الحامل، يرجى التواصل مع خدمة ما بعد البيع.
fr: Le numéro de série de contrôle n’est pas le bon. Contactez le service après-vente.
ja: コントローラーのシリアルナンバー異常。アフターサービス部門に連絡してください。
ko: 컨트롤s/n 이상입니다. A/S센터에 연락하시기 바랍니다.！
zh_hans: 此车控制器序列号异常，请联系售后处理，谢谢！

# l_nfans_stick_success
source: Modify successfully
ar: تمت التعديلات بنجاح
fr: Succès de la modification
ja: 設定完了
ko: 수정되었습니다
zh_hans: 设置成功

# l_nfans_stick_fail
source: Modification fails
ar: فشل التعديلات
fr: Echec de la modification
ja: 設定失敗
ko: 변경 실패
zh_hans: 设置失败

# l_nfans_manger
source: Admin
ar: المشرف
fr: Administration
ja: 管理者
ko: 관리자
zh_hans: 管理员

# s_ninebotInstruction
source: MINI Instruction
ar: تعليمات مصغرة
fr: Instruction Mini
ja: ナインボットユーザーマニュアル
ko: MINI설명서
zh_hans: 九号平衡车说明书

# l_map_friend_preBtn
source: Previous
ar: السابق
fr: Avant
ja: 前のページ
ko: 이전 페이지
zh_hans: 上一页

# l_map_friend_nextBtn
source: Next
ar: الآتي
fr: Suivant
ja: 次のページ
ko: 다음 페이지
zh_hans: 下一页

# l_map_getUp_Success
source: Singal location upload successed
ar: تم تحميل إشارة الموقع بنجاح
fr: Succès de la localisation
ja: アップロード完了
ko: 단번 위치 업로드 완료
zh_hans: 上传成功

# l_map_getUp_fail
source: Singal location upload failed
ar: فشل تحميل إشارة الموقع
fr: Echec de la localisation
ja: 検索失敗
ko: 단번 위치 업로드 실패
zh_hans: 查找失败

# l_nfans_stick
source: Top
ar: أعلى
ja: トップに出す
ko: 맨위로 고정하기
zh_hans: 置顶

# l_nfans_no_stick
source: Cancelled set top
ar: إلغاء المجموعة أعلى
fr: Annulation de la mise en route
ja: トップから消す
ko: 맨위로 고정하기 취소
zh_hans: 取消置顶

# l_map_friend_justnow
source: Just now
ar: للتو
fr: Maintenant
ja: たった今
ko: 지금
zh_hans: 刚刚

# l_map_friend_minute
source: min ago
ar: من دقيقة مضت
fr: minutes auparavant
ja: 分間前
ko: 분 전
zh_hans: 分钟前

# l_map_friend_hour
source: hr ago
ar: من ساعة مضت
fr: heures auparavant
ja: 時間前
ko: 시간 전
zh_hans: 小时前

# t_sixin_message
source: Private message
ar: رسالة خاصة
fr: Message privé
ja: プライベートメッセージ
ko: 쪽지
zh_hans: 私信消息

# t_sixin_emptyall
source: Are you sure to clear all messages?
ar: هل أنت متأكد من مسح كل الرسائل؟
fr: Effacer tous les messages?
ja: チャット履歴をクリアしますか？
ko: 채팅 기록을 모두 지우겠습니까?
zh_hans: 是否清空所有聊天记录

# l_map_no_result
source: No riders been found in 50 km.
ar: لم يوجد أية دراجين على بعد 50 كم.
fr: Aucun conducteur repéré dans les 50 kms.
ja: 付近にNファンがいません。もう一度操作してください。
ko: 주변 50KM내 사용자가 없습니다.
zh_hans: 附近无车友，请重新尝试！

# l_map_clear_mylocation
source: Clear my location successfully
ar: تم مسح موقعي بنجاح
fr: Succès pour effacer ma localisation
ja: 位置情報クリア完了
ko: 나의 위치정보를 삭제하였습니다.
zh_hans: 成功清除我的位置

# l_map_friend_fail
source: Fail to find vehicle nearby, please try again!
ar: فشل في إيجاد سيارة قريبة، برجاء إعادة المحاولة مرة أخرى!
fr: Echec pour trouver un véhicule aux alentours, essayez encore
ja: 付近のNファンの検索に失敗、もう一度操作してください。
ko: 주변 사용자 검색하는데 실패하였습니다. 다시 검색하세요!
zh_hans: 查找附近的车友失败，请重新尝试！

# t_push_notification
source: Push Notification
ar: إخطار دفع
fr: Notification Push
ja: 通知プッシュ
ko: 푸시 알림
zh_hans: 推送通知

# find_map_friends
source: Rider Nearby
ar: راكب قريب
fr: Wheelers autour de moi
ja: 近くのNファンたち
ko: 내 주변 사용자
zh_hans: 附近车友

# find_nine_club
source: Community
ar: المجموعة
fr: Communauté
ja: ナインボットコミュニティ
ko: 나인봇 밴드
zh_hans: 九号社区

# find_friend_tip
source: To use the vehicle nearby feature, it's required to upload your location. Once confirmed, your location will be uploaded automatically and seen by others. Of course, you can clear it also. Upload location?
ar: لاستخدام ميزة سيارة قريبة يتطلب تحميل تحديد موقعك، إذا تم التأكيد سيتم تحميله اوتوماتيكيا ويكون مرئي للجميع. ويمكنك مسحه أيضا بالتأكيد. تحميل الموقع؟
fr: Pour utiliser un véhicule aux alentours, il est nécessaire d’actualiser votre localisation. Une fois confirmée, votre localisation sera automatiquement mise à jour et vue par les autres. Vous pouvez l’effacer. Mettre à jour votre localisation?
ja: 「近くのNファンたち」機能を使用するために位置情報をアップロードする必要があります。確定を押すと位置情報をアップロードします。近くのNファンたちはあなたを見つけることができます。アップロード後に位置情報をクリアすることが可能です。アップロードしますか？
ko: 고객님 위치정보를 공유 하시면 본 기능으로 주변사용자 검색 할 수 있습니다. 위치정보를 공유 하시겠습니다까? (공유한 위치정보는 삭제가능합니다.)
zh_hans: 该功能主要用于查找附近的车友，但是需要上传您的位置信息，同时您的位置信息也会对其他人可见，当然您也可以随时清除，是否同意上传？
