Repository: sxm5220/sxm-ios
Catalog: Ninebot/*.lproj/Localizable.strings
Languages: ar, fr, ja, ko, zh_hans

# ErrCodeSug45
source: Generally, the error may auto disappear after restarting. In case the error still exists after restarting, please deliver the vehicle body of Ninebot to your retailer for overhauling. E-mail (Chinese/English): service@ninebot.com
ar: عموماً, قد يختفي الخطأ تلقائياً بعد إعادة التشغيل. في حال بقي الخطأ موجوداً بعد إعادة التشغيل, الرجاء توصيل جسم سيارة ناينبوت إلى بائعك للصيانة البريد الالكتروني (صيني- انكليزي): service@ninebot.com
fr: Généralement, l’erreur disparaît automatiquement après le redémarrage. Si l’erreur persiste, contactez votre revendeur ou votre centre de service véhicule. On pourrait vous demander de ramener votre véhicule pour un contrôle. E-mail (Chinois/Anglais): service@ninebot.com
ja: このエラーは一般的に再起動後に消えます。何度か再起動しても消えない場合は、サポート部門に修理についてご相談ください。電子メール(日本語)：support@e-otomo.co.jp
ko: 본 에러현상은 보통 본체 재부팅을 통해 해결되는 에러현상입니다. 본체 재부팅으로 해결이 안될 경우 본체를 구입처 또는 서비스센터에 교부하여 점검을 진행할 필요가 있습니다. 이메일: ninebot@naver.com
zh_hans: 此错误在重新开机后一般可自行消失。如重新开机后仍然出现此错误，则请将车体送交您的销售商处检修。电子邮件(中文/英语)：service@ninebot.com

# ErrCodeSug46
source: At present, reserve unused error No. Please restart twice-three times and observe whether the error disappears. In case the error No. still appears, maybe there is something wrong with your instrument panel of vehicle. Please deliver the vehicle body of Ninebot to your retailer for overhauling. E-mail (Chinese/English): service@ninebot.com
ar: في الوقت الحالي, احتفظ برقم الخطأ غير المستخدم. الرجاء إعادة التشغيل مرتين أو ثلاث واكتشاف فيما لو اختفى الخطأ. في حال بقي رقم الخطأ ظاهراً فربما هنالك ما هو خطأ في لوحة آلة ناينبوت. الرجاء توصيل جسم سيارة ناينبوت إلى بائعك للصيانة.
fr: . Tentez de redémarrer le véhicule 2 ou 3 fois et observez si l’erreur disparaît. Si l’erreur persiste, contactez votre revendeur ou votre centre de service véhicule. On pourrait vous demander de ramener votre véhicule pour un contrôle. E-mail (Chinois/Anglais): service@ninebot.com
ja: 未定義のエラーコードです。何度か再起動してエラーが消えたかを確認してください。エラーが消えない場合は、ダッシュボードが故障している可能性があります。販売店やサポート部門に修理についてご相談ください。電子メール(日本語)：support@e-otomo.co.jp
ko: 현재 보류중인 미사용 에러코드입니다. 재부팅 2-3번을 실시하여 에러현상이 해결되는지 살펴봅니다. 이상 해결 절차로 문제 해결이 안될 경우 본체 계기판 고장일 가능성이 있습니다. 본체를 구입처 또는 서비스센터에 교부하여 점검을 진행할 필요가 있습니다. 이메일:ninebot@naver.com
zh_hans: 目前保留未用的错误号。请重新开机2-3次并观察错误是否消失。如果仍然出现此错误号，可能是您的车辆仪表盘出现故障，请将Ninebot车体送交您的销售商处检修。电子邮件(中文/英语)：service@ninebot.com

# m_second_readGuide
source: You have completed 0.6 miles (1 km) of driving. For your safety please review the Guide for Driving again.
fr: Congratulations, you have been driving for more than 1 km. For your safety, please read the “Safe Driving Guide” again.
ko: 축하합니다. 귀하는 주행거리 1KM를 당성하였습니다. 안전을 위해 다시 ‘안전주행가이드’를 확인하시기 바랍니다.
zh_hans: 恭喜您，您已骑行超过1km，为了您的安全考虑，请再次阅读“安全驾驶指南”

# m_alreadyRelease_limit
source: The speed limit has been released. Please ride safely.
fr: Congratulations! Your vehicle has been released the speed limit, enjoy your safety riding!
ko: 축하합니다. 속도제한이 헤제되었습니다. 안전주행 하시기 바랍니다.
zh_hans: 恭喜您，车辆已经完全解除限速，请安全驾驶。

# s_do_over_mini
source: You have completed the New Rider Tutorial. The vehicle will be speed limited for the first 0.6 miles (1 km).
ar: You've completed the safe driving guide. The vehicle will be speed limited to 10km/h until you've ridden 1km.
fr: You've completed the safe driving guide. The véhicule will be speed limited to 10km/h until you've ridden 1km.
ja: You've completed the safe driving guide. The vehicle will be speed limited to 10km/h until you've ridden 1km.
ko: 축하합니다.초보자가이드를 완성하였으며. 당신의 안전을 위해 1KM주행거리까지 10KM/H인 속도제한모드로 운행하며 1KM주행거리 달성 시 속도제한 해제를 가능합니다.
zh_hans: 恭喜您完成新手教学，为了您的安全，车辆在前1km将限速至10km/h，骑行满1km后可以解除限速

# nb_robot_newhand_completion_tip_markII
source: You have completed the New Rider Tutorial. Your unit will be speed limited for the first 0.6 miles (1 km).
ar: Beginner tutorial has been completed, and this vehicle will be limited to 12km/h before 1 km has been finished.
fr: Beginner tutorial has been completed, and this vehicle will be limited to 12km/h before 1 km has been finished.
ja: Beginner tutorial has been completed, and this vehicle will be limited to 12km/h before 1 km has been finished.
ko: 축하합니다. 초보자 가이드를 완성하였습니다. 귀하의 안전을 위해 주행거리 1km 달성까지 12km/h의 속도로 운행되며 1km 달성 후 속도제한 해제를 가능합니다.
zh_hans: 恭喜您完成新手教学，为了您的安全，车辆在前1km将限速至12km/h，骑行满1km后将可以解除限速。

# nb_robot_driving_instruction_tip_markII
source: Thank for reading the Guide for Safe Driving. You must read the user manual and follow the New Rider Tutorial in this app before your first ride.
ar: Pleaseread the beginners tutorial, it will guide you how to ride this vehicle and enjoy your safety rides.
fr: Pleaseread the beginners tutorial, it will guide you how to ride this vehicle and enjoy your safety rides.
ja: Pleaseread the beginners tutorial, it will guide you how to ride this vehicle and enjoy your safety rides.
ko: 읽어주셔서 감사합니다. 계속하여 초보자 가이드를진행하세요. 제품의 올바른 사용과 안전 사용을 위해 필히 읽어주시기 바랍니다.
zh_hans: 感谢您的耐心阅读！请继续观看新手教学，帮助您规范学习步骤，掌握安全驾驶。

# nb_robot_driving_instruction_exercise_tip_markII
source: Please watch the 5 minute video on how to control the unit.
ar: Please finish the 5 minutes video about how to control the vehicle.
fr: Please finish the 5 minutes video about how to control the vehicle.
ja: Please finish the 5 minutes video about how to control the vehicle.
ko: 튜토리얼에 따라 5m탑승 연습을 진행하세요.
zh_hans: 请根据教学视频完成5m滑行练习。

# nb_robot_newhand_step1_markII
source: Using Ninebot One
ko: 제품 원리
zh_hans: 使用技巧

# nb_robot_newhand_step2_markII
source: Position Adjustment
ko: 수평 보정
zh_hans: 姿态校准

# nb_robot_newhand_step3_markII
source: Vehicle-Control Practice
ko: 탑승 연습
zh_hans: 控车练习

# nb_robot_newhand_step4_markII
source: Sliding Practice
ko: 탑승 연습
zh_hans: 滑行练习

# nb_robot_settings_handler_mode_switch_markII
source: Switch of lift mode
ko: 휴대모드 설정
zh_hans: 拎起模式开关

# nb_robot_settings_handler_mode_tips_markII
source: When lift mode is on, wheel will not spin rapidly. When lift mode is off, wheel will spin rapidly once vehicle is lifted up.
ko: 휴대모드 활성화 시 제품을 들어올려도 타이어가 돌아가지 않습니다. 비활성화 시 제품을 들어올리면 타이어가 돌아갑니다.
zh_hans: 拎起模式开启，拎起提手后车轮不会飞转。关闭开关，则拎起提手后，车轮会飞转。

# nb_robot_settings_handler_settings_markII
source: Handle bar setting
ko: 손잡이 설정
zh_hans: 提手设置

# nb_robot_settings_handler_calibration_markII
source: Handle bar calibration
ko: 손잡이 보정
zh_hans: 提手校准

# nb_robot_settings_handler_calibration_start_markII
source: Vehicle should be locked before handle bar calibration, please confirm if it is ok to lock the vehicle.
ko: 손잡이 보정 시 먼저 제품을 잠금모드로변경해야 합니다. 제품을 잠금모드로 변경할까요?
zh_hans: 提手校准前需要锁车，是否锁车？

# nb_robot_settings_handler_calibration_up_markII
source: 1/2 Please lift your up vehicle before pressing "Sure", otherwise the lift function will not be working.
ko: 1/2 먼저 제품을 들어올린 후 ‘확인’을 터치하세요. 그렇지 않으면 손잡이의 간편휴대 기능이 작동되지 않을 수 있습니다.
zh_hans: 1/2 请先拎起车辆再点击“确定”按钮，否则可能会导致提手功能失效。

# nb_robot_settings_handler_calibration_down_markII
source: 2/2 Please lift your vehicle down before pressing "Sure", otherwise the lift function will not be not working.
ko: 2/2 먼저 제품을 내려놓고 손잡이를 내려누르는 상테에서 ‘확인’을 터치하세요. 그렇지 않으면 손잡이의 간편휴대 기능이 작동되지 않을 수 있습니다.
zh_hans: 2/2 请先放下车辆并按下提手，再点击“确定”，否则可能会导致提手功能失效。

# nb_robot_settings_handler_calibration_complete_markII
source: Handle bar calibration completed.
ko: 손잡이 보정이 완료되었습니다.
zh_hans: 提手校准已完成。

# nb_robot_activate_success_tip_markII
source: Activation Successful! You must review the Guide for Safe Driving. Your unit will remain in speed limiting mode for 0.6 miles (1 km).
ar: This vehicle has been initialized, please read user manual carefully, if not your vehicle will be in limited mode of 7km/h.
fr: This vehicle has been initialized, please read user manual carefully, if not your vehicle will be in limited mode of 7km/h.
ja: This vehicle has been initialized, please read user manual carefully, if not your vehicle will be in limited mode of 7km/h.
ko: 축하합니다. 활성화 되었습니다. 귀하의 안전을 위해계속하여 주행가이드를 진행하세요. 주행가이드 미완성 시 제품의 속도는 7km/h로 제한됩니다.
zh_hans: 恭喜您已成功完成激活，为了您的安全，请继续阅读驾驶指南，否则车辆将一直处于7km/h限速模式。

# nb_robot_unactivate_tips_markII
source: Your unit is not activated. Please follow the activation procedure.
ar: Your vehicle is a new vehicle, please initialize your vehicle according to the guideline page, or your vehicle cannot be used.
fr: Your vehicle is a new vehicle, please initialize your vehicle according to the guideline page, or your vehicle cannot be used.
ja: Your vehicle is a new vehicle, please initialize your vehicle according to the guideline page, or your vehicle cannot be used.
ko: 귀하의 차량 는 아직 비활성화 상태입니다. 안내에 따라 제품 활성화를 진행하세요. 비활성화 상태인 제품은 정상 작동이 안됩니다.
zh_hans: 您的车辆是未激活的新车，请您按照引导页面进行激活，否则车辆将无法正常使用。

# nb_robot_driving_instruction_next
source: Next
ko: 다음 단계
zh_hans: 下一步

# nb_robot_driving_instruction_prev
source: Previous
ko: 한 걸음
zh_hans: 上一步

# nb_robot_activate_network_error
source: Dear Users, server is busy now, please try later.
ko: 현재 서버의 동시 접속자가 많아 활성화할 수 없습니다. 잠시 후에 다시 시도해 주세요.
zh_hans: 尊敬的用户，当前服务器繁忙，请稍候重新尝试激活。

# nb_robot_activate_xiaomi_tip
source: Please note that this product can only be activated by mobile phone number of China Mainland, Hong Kong, Maco and Taiwan regions.
ko: 해당 제품은 중국 외의 지역에서는 사용할 수 없습니다.
zh_hans: 该型号产品只支持中国大陆及港澳台地区的手机号码进行验证激活，敬请留意。

# s_all_run
source: Have been driving
ar: تمت القيادة
fr: Conduit
ko: 운행 중

# ShareType_10
source: Facebook
ar: فيسبوك

# ShareType_11
source: Twitter
ar: تويتر

# ShareType_13
source: Foursquare
ar: فورسكوير

# ShareType_14
source: Google+
ar: غوغل+

# ShareType_15
source: Instagram
ar: انستاغرام

# ShareType_16
source: LinkedIn
ar: لينكدإن

# ShareType_17
source: Tumblr
ar: تامبلر

# ShareType_24
source: QQ
ar: كيو كيو

# ShareType_25
source: Instapaper
ar: انستابيبر

# ShareType_26
source: Pocket
ar: جيب

# ShareType_30
source: Pinterest
ar: بي انتريست

# ShareType_34
source: Flickr
ar: فليكر

# ShareType_35
source: Dropbox
ar: دروب بوكس

# ShareType_36
source: VKontakte
ar: فيكونتاكت

# ShareType_42
source: Line
ar: لاين

# ShareType_43
source: WhatsApp
ar: واتساب

# ShareType_44
source: KakaoTalk
ar: كاكاوتوك

# ShareType_45
source: KakaoStory
ar: كاكاوستوري

# Pitch Angle
source: The current pitching angle
ar: زاوية المحور الأمامي الحالية
fr: Angle d’assiette (avant-arrière)
