Repository: sxm5220/sxm-ios
Catalog: Ninebot/*.lproj/Localizable.strings
Languages: ar, fr, ja, ko, zh_hans

# find_friend_quit
source: Clear location info and exit
ar: مسح معلومات الموقع و الخروج
fr: Effacer ma localisation et sortir
ja: 位置情報をクリアし終了
ko: 클리어 위치
zh_hans: 清除位置信息并退出

# s_restore_factory
source: Restore to factory settings
ar: إعادة الضبط
fr: Restaurer les paramètres d’usine
ja: 工場初期設定にリセット
ko: 제품 초기화
zh_hans: 恢复出厂设置

# s_restore_factory_tip
source: Are you sure reset all settings?
ar: هل أنت متأكد من إعادة الضبط لما كان عليه سابقا?
fr: Etes-vous sûr de vouloir restaurer tous les paramètres?
ja: 工場初期設定にリセットしますか？
ko: 초기화를 하시겠습니까？
zh_hans: 您确定恢复出厂设置吗？

# s_open_camera
source: Enable Ninebot to open Camera: Setting-Privacy-Camera-Ninebot
ar: السماح للناينبوت بفتح الكاميرا، اعدادات-خاصة-كاميرا-ناينبوت
fr: Permettre à Ninebot d’allumer l’appareil photo: Paramètres privés l’appareil photo Ninebot
ja: Ninebotにカメラの使用権限を有効にしてください。カメラ権限設定：設定->プライバシー->カメラ->Ninebot（Onにしてください）
ko: 카메라 사용을 허용하세요.：설정->개인보호설정->카메라->Ninebot（허용）
zh_hans: 请为Ninebot开放相机权限：手机设置->隐私->相机->Ninebot（打开）

# s_softAndHard
source: Automatic suspension sensitivity
ar: الضبط الخفيف اوتوماتيكيا
fr: Ajustement automatique de la sensibilité
ja: 乗車感度自動調節
ko: 탑승감도 자동모드
zh_hans: 骑行灵敏度自动调节

# m_sorfthard_tip
source: Adjust suspension sensitivity to reduce vibrations that occur while you are riding
ar: إذا اهتز العجل خلال الركوب برجاء محاولة الضبط بنعومة.
fr: Si le véhicule vibre pendant la conduite, essayez d’ajuster la sensibilité
ja: 乗車時に車両本体が振れる現象があれば、乗車の感度を落とせばば解決できます。
ko: 주행시 차량 진동의 현상이 발생하면, 탑승감도를 낮춰서 해결할 수 있습니다.
zh_hans: 若在骑行时出现车辆振动现象，可尝试调低骑行灵敏度来解决该问题。

# s_sorfthard_value
source: Suspension sensitivity
ar: نعومة
fr: Sensibilité avant-arrière
ko: 주행 감도
zh_hans: 骑行灵敏度

# s_blance
source: Balance of assisstant mode setting
ar: التوازن في ضبط الوضع المساعد
fr: Paramètres du mode équilibre
ja: アシストモードバランス調節
ko: 견인모드 균형 포인트 조절
zh_hans: 助力模式平衡点调节

# s_blance_point
source: Balance assistance mode
ar: التوازن في النموذج المساعد
fr: Modèle d’assistance
ja: アシストモードバランス
ko: 균형 포인트
zh_hans: 助力模式平衡点

# s_blance_intr
source: Adjust the balance assistance mode if your vehicle is moving when you are not riding it.
ar: إذا كان العجل على وضع المساعد ويعمل اوتوماتيكيا، إذن عليك حل مشكلة ضبط قيمة الرصيد
fr: Si votre véhicule est en mode assistance et qu’il bouge automatiquement, vous pouvez essayer de résoudre ce problème en ajustant la valeur d’équilibre.
ja: 降りても車両が勝手に進む、もしくはバックする場合、バランスの調整をしてみてください。
ko: 하차후 차량이 자동으로 전진 또는 후진시 수평 센서 보정을 통해 해결할 수 있습니다.
zh_hans: 当下车后车辆自动前进或后退时，可以尝试调节平衡点

# n_fans_manage
source: Administrate
ar: تول
fr: Administrer
ja: 管理
ko: 관리
zh_hans: 管理

# n_fans_essence
source: Set as recommended
ar: على النحو الموصي به
fr: Lancer le paramétrage automatique
ja: お気に入り設定
ko: 추천 글 설정
zh_hans: 设置精华

# n_fans_noessence
source: Cancel recommended
ar: إلغاء التوصية
fr: Annuler le paramétrage recommandé
ja: お気に入り取消
ko: 추천글 취
zh_hans: 取消精华

# n_fans_essence_success
source: Set Recommended successfully
ar: ضبط التوصية بنجاح
fr: Succès du paramétrage recommandé
ja: 設定お気に入り完了
ko: 추천글 설정 성공
zh_hans: 设置精华成功

# n_fans_essence_fail
source: Fail to set as recommended
ar: فشل في ضبط التوصية
fr: Echec du paramétrage recommandé
ja: お気に入り設定失敗
ko: 추천글 설정 실패
zh_hans: 设置精华失败

# n_fans_noessence_success
source: Successfully Cancelled recommended
ar: إلغاء التوصية بنجاح
fr: Succès de l’annulation du paramétrage recommandé
ja: お気に入り取消完了
ko: 추천글 취소
zh_hans: 取消精华成功

# n_fans_noessence_fail
source: Failed to cancel recommended
ar: فشل في إلغاء التوصية
fr: Echec de l’annulation du paramétrage recommandé
ja: お気に入り取消失敗
ko: 추천글 취소 실패
zh_hans: 取消精华失败

# n_fans_dynamic_delete
source: This information has been deleted!
ar: 该条动态不存在或已删除
ko: 내용이 삭제 되였습니다!
zh_hans: 该条动态不存在或已删除

# s_allow_shutdown
source: Power off if locked
ar: إذ ا أغلق يتم إيقاف التشغيل
fr: Extinction même si verrouillé
ja: ロック時でのシャットダウン許可
ko: 잠금 후 전원 끄기 허용
zh_hans: 锁车后允许关机

# s_no_alarm
source: No alarm if locked
ar: لا يوجد تنبيه إذا أغلق
fr: Pas d’alarme si verrouillage
ja: 警告なしでロック
ko: 잠금 후 경보 금지
zh_hans: 锁车后不报警

# s_please_upfirm
source: Please update firmware first!
ar: برجاء تحديث البرامج الثابتة أولا
fr: Mettez à jour le logiciel en premier
ja: ファームウェアをアップデートしてください。
ko: 먼저 펌웨어를 업데이트 하세요！
zh_hans: 请先升级固件！

# n_personal
source: Personal Profile
ar: الملف الشخصي
fr: Profil personnel
ja: 個人ページ
ko: 개인 페이지
zh_hans: 个人主页

# n_message_comment_clear
source: Are you sure to clear comment list?
ar: هل انت متأكد من مسح قائمة التعليقات؟
fr: Etes-vous sûr de vouloir effacer les commentaires?
ja: レビュー内容をクリアしますか？
ko: 모든 댓글 알림 리스트를 지우시겠습니까？
zh_hans: 您确定清空评论消息列表吗？

# n_message_praise_clear
source: Are you sure to clear all liked list?
ar: هل أنت متأكد من مسج كافة قوائم الإعجاب؟
fr: Etes-vous sûr de vouloir effacer les mentions “j’aime”?
ja: 「いいね！」の履歴内容をクリアしますか？
ko: 추천 알림 리스트를 지우시겠습니까？
zh_hans: 您确定清空点赞消息列表吗？

# n_userInfor_fail
source: Failed to get user info.
ar: فشل في الحصول على معلومات المستخدم
fr: Echec pour retrouver les informations de l’utilisateur.
ja: ユーザー情報取得失敗
ko: 계정 정보를 읽는데 실패하였습니다.
zh_hans: 获取用户信息失败

# s_black_upload_success
source: Data upload successfully, our after-sales engineer will handle this shortly!
ar: تحديث البيانات بنجاح، مهندس مابعد البيع سيعالج هذا في وقت قصير
fr: Succès de la mise à jour des données, un responsable du service après-vente vous contactera prochainement.
ja: データはサーバーへ送信済みです。サポート担当が処理を致します。
ko: 등록 되였습니다.A/S담당자께서 연락드리도록 하겠습니다.
zh_hans: 数据已经成功上报到服务器，我们的售后人员会及时进行处理！

# s_blackbox
source: Reading blackbox data
ar: قراءة بيانات الصندوق الأسود
fr: Lecture des données de la boîte noire
ko: 블랙박스 데이터 설정(관리자외 사용불가)
zh_hans: 黑匣子数据读取

# s_quest
source: Problem description: input problem description less than 500 digits.
ar: تفاصيل المشكلة، أدخل تفاصيل المشكلة لي أقل من 500 رقم
fr: Description du problème: La description doit faire moins de 500 caractères.
ja: 問題の記述:500文字以内の内容を入力してください。
ko: 문제 피드백:500자 내의 의견을 작성하십시오.
zh_hans: 问题描述:请输入不多于500字数的问题描述

# s_blackbox_lock
source: Need to lock the vehicle before reading black box data, lock vehicle?
ar: تحتاج إلى غلق العجل قبل قراءة بيانات الصندوق الأسود، اغلاق العجل؟
fr: Le véhicule doit être éteint pour lire les données de la boîte noire. Verrouiller le véhicule?
ja: ブラックボックスを読込前に、ロックする必要があります。ロックしますか？
ko: 블랙박스 데이터 추출하려면 본체를 잠가야 합니다. 본체를 잠글까요？
zh_hans: 读取黑匣子前需要锁车，是否锁车？

# s_blackbox_unlock
source: Finished reading black box data, Unlock vehicle?
ar: الإنتهاء من قراءة بيانات الصندوق الأسود، فتح العجل؟?
fr: Lecture des données de la boîte noire terminée. Déverrouiller le véhicule?
ja: ブラックボックスデータ読込み完了、ロックを解除しますか？
ko: 블랙박스 데어터 추출 완료했습니다. 본체 잠금을 해제할까요？
zh_hans: 黑匣子数据读取完成，是否解锁？

# s_blackBox_item
source: From, Time, Black Code, Addition Inf
ar: من، الوقت، الكود الأسود، إضافة معلومات
fr: Depuis, Temps, Code noir, Addition
ja: ルート/時間/コード/追加情報
ko: 에러원인,시간,블랙박스코드,부가정보
zh_hans: 来源，时间，代码，附加信息

# error_code_control
source: Controller
ar: المراقب
fr: Contrôleur
ja: メインコントローラー
ko: 메인 컨트롤러
zh_hans: 主控

# error_code_driver
source: Driver
ar: السائق
fr: Conducteur
ja: 駆動
ko: 드라이버
zh_hans: 驱动

# error_code_tip
source: Input problem description!
ar: أدخل تفاصيل المشكلة
fr: Rentrez la description du problème.
ja: 問題記述や情報を入力してください。
ko: 문제 서술을 입력하세요!
zh_hans: 请填写问题描述信息！

# error_code_file
source: Data
ar: البيانات
fr: Données
ja: データファイル
ko: 데이터 파일
zh_hans: 数据文件

# s_fail_profile_upload
source: Upload file failed!
ar: فشل تحديث الملف
fr: Echec du téléchargement du fichier
ja: ファイルアップロード失敗。
ko: 파일 업로드 실패!
zh_hans: 文件上传失败！

# s_blackbox_fail
source: Failed to get blackbox data, please try again!
ar: فشل في الحصول على الصندوق الأسود، برجاء المحاولة مرة أخرى
fr: Echec pour récupérer les données de la boîte noire, essayez encore.
ja: ブラックボックスデータ読込み失敗、もう一度操作してください。
ko: 블랙박스 데이터 추출 실패, 다시 시도하세요！
zh_hans: 黑匣子数据读取失败，请重试！

# s_q_error
source: Describe problem in less than 500 words.
ar: أوصف المشكلة في أقل من 500كلمة
fr: La description du problème doit comporter moins de 500 mots.
ja: 問題の記述は500文字以内にしてください。
ko: 문제 설명 500자를 초과하였습니다！
zh_hans: 问题描述不能大于500！

# s_firm_instro
source: Firmware verison description
ar: تفاصيل الاصدارات من البرامج الثابتة
fr: Description de la version du logiciel.
ja: ファームウェアバージョン説明
ko: 펌웨어버전 설명
zh_hans: 固件版本说明

# s_read_outtime
source: Reading timeout
ar: نفاذ وقت القراءة
fr: Temps de lecture écoulé
ja: 読込みタイムアウト。
ko: 읽기의 규정 시간을 초과하였습니다!
zh_hans: 读取超时！

# s_b1
source: No error!
ar: لا يوجد خطأ!
fr: Pas d’erreur
ja: エラーなし。
ko: 오류 없음!
zh_hans: 无错误！

# s_b2
source: extended address over the limit
ar: مد العنوان فوق الحد
fr: L’adresse rentrée dépasse la limite de caractères
ja: 拡張アドレス範囲オーバー
ko: 확장 어드레스 지정이 제한값을 초과하였습니다.
zh_hans: 扩展地址超范围

# s_b3
source: Vehicle does not lock
ar: العجل لا يغلق
fr: Le véhicule ne se verrouille pas
ja: 車両はロックされていません。
ko: 본체 잠금 비활성화
zh_hans: 车辆未锁定

# s_qq_copy
source: Are you copy group no and open QQ?
ar: هل نسخت رقم المجموعة وفتحQQ?
fr: Etes-vous un groupe? Souhaitez-vous ouvrir QQ?
ja: グループ番号をコピーしてQQを開きますか？
ko: 채팅방 번호를 복사하며 QQ프로그램을 실행할까요?
zh_hans: 是否复制群号并打开QQ客户端

# s_qq
source: QQ Group
ar: QQ مجموعة
fr: Groupe QQ
ja: QQ交流グループ
ko: QQ채팅그룹
zh_hans: QQ讨论群

# s_q_a
source: Answers to FAQ
ar: اجابة التعليمات
fr: Réponses aux FAQ
ja: よくある質問
ko: 자주 찾는 질문
zh_hans: 常见问题解答

# s_app_intro
source: Your phone has not installed this app, so you cannot login..
ar: هاتفك لم يثبت هذا التطبيق لذلك لا يمكن تسجيل الدخول.
fr: Vous n’avez pas installé l’application sur votre téléphone, vous ne pouvez pas vous connecter
ja: このAPPはインストールされていないため、ログインできません。
ko: 모바일에 설치되있지 않는 프로그램입니다. 로그인 할 수 없습니다！
zh_hans: 您的手机没有安装此应用，无法进行登录！

# s_loginTitle
source: Other account login:
ar: تسجيل الدخول من حساب آخر
fr: Autres connexions:
ja: 別のアカウントログイン:
ko: 다른 아이디로 로그인:
zh_hans: 其他账号登录:

# n_fans_clear_fail
source: Connection timeout, clear message failed
ar: نفاذ وقت الاتصال، فشل في مسح الرسائل
fr: Temps de connexion dépassé, échec de l’effacement des messages
ja: クリアに失敗しました。もう一度操作してください
ko: 연결실패로 비우기 실패
zh_hans: 清空失败，请重新尝试

# n_fans_praise_fail
source: Connection timeout, Like failed
ar: نفاذ وقت الاتصال، فشل في مسح الإعجابات
fr: Temps de connexion dépassé, échec des mentions “j’aime”
ja: 「いいね！」に失敗しました。もう一度操作してください
ko: 연결실패로 좋아요 누르기 실패
zh_hans: 点赞失败，请重新尝试

# n_fans_delete_fail
source: Connection timeout,delete message maybe failed
ar: نفاذ وقت الاتصال، قد يحدث فشل في الرسائل
fr: Temps de connexion dépassé, échec de l’effacement des messages
ja: 削除に失敗しました。もう一度操作してください
ko: 연결실패로 삭제 실패
zh_hans: 删除失败，请重新尝试

# n_fans_send_fail
source: Connection timeout,comment maybe failed
ar: نفاذ وقت الاتصال، قد يحدث فشل في التعليقات
fr: Temps de connexion dépassé, échec des commentaires
ja: 送信に失敗しました。もう一度操作してください
ko: 연결실패로 발송 실패
zh_hans: 发送失败，请重新尝试

# n_fans_comment_success
source: Successfully comment!
ar: تم التعليق بنجاح
fr: Commentaire affiché avec succès!
ja: レビュー完了
ko: 댓글 완료！
zh_hans: 评论成功

# n_fans_comment_fail
source: Comment fails!
ar: فشل التعليق
fr: Echec du commentaire
ja: レビュー失敗
ko: 댓글 실패！
zh_hans: 评论失败

# s_conn_tip
source: The Bluetooth password has not been set. Would you like to set it now?
ar: The vehicle connection password has not been set. Please set a password to avoid other users from accessing your vehicle.
fr: The vehicle connection password has not been set. Please set a password to avoid other users from accessing your vehicle.
ja: The vehicle connection password has not been set. Please set a password to avoid other users from accessing your vehicle.
ko: 비밀번호을 설정하지 않았습니다. 타 사용자가 연결방지 위해 차체 비밀번호 설정해주세요!
zh_hans: 您尚未设置车辆密码，为防止他人连接您的车辆，请设置您的车辆密码！

# s_no_changeSN
source: Current Serial No.is not the manufacture serial no, so this cannot be revised!
ar: رقم التسلسل الحالي مختلف عن رقم التسلسل الأصلي لذا لا يمكن مراجعته
fr: Le numéro de série actuel n’est pas le numéro de fabrication, il ne peut pas être révisé.
ja: 現在の車両のシリアルナンバーは初期シリアルナンバーではありません。変更不可です！
ko: 현 S/N 요구에 맞지 않아. 수정 불가합니다.
zh_hans: 当前车辆序列号不是出厂序列号，不允许修改！

# lPutEmailNum
source: Input email
ar: أدخل الإيميل
fr: Renseignez votre email
ko: E-mail을 입력해주세요
zh_hans: 请输入邮箱

# s_error_5
source: 12V voltage error, please check control board.
ar: خطأ 12فولت، برجى التحقق من لوح التحكم
fr: Erreur de voltage12V, contrôlez votre tableau de bord.
ja: 12V電圧異常。メインコントロールボードを点検する必要があります。
ko: 12V전압 오류, 메인보드를 검사하세요.
zh_hans: 12V电压异常，需检查主控板

# s_error_6
source: 5V voltage error, please check control board.
ar: خطأ 5فولت، يرجى التحقق من لوحة التحكم
fr: Erreur de voltage 5V, contrôlez votre tableau de bord.
ja: 5V電圧異常。メインコントロールボードを点検する必要があります。
ko: 5V전압 오류，메인보드를 검사하세요.
zh_hans: 5V电压异常，需检查主控板

# s_error_7
source: 3.3V voltage error, please check control board.
ar: خطأ 3.3فولت، برجى التحقق من لوحة التحكم
fr: Erreur de voltage 3.3V, contrôlez votre tableau de bord.
ja: 3.3V電圧異常。メインコントロールボードを点検する必要があります。.
ko: 3.3V전압 오류,메인보드를 검사하세요.
zh_hans: 3.3V电压异常，需检查主控板

# s_error_9_28_29
source: CPU start error, please check control board.
ar: خطأ في زر البداية في وحدة المعالجة المركزية، برجى التحقق من لوحة التحكم
fr: Erreur de mise en route CPU contrôlez votre tableau de bord.
ja: CPU初期化異常。メインコントロールボードを点検する必要があります。
ko: CPU초기화 오류, 메인보드를 검사하세요.
zh_hans: CPU初始化异常，需检查主控板

# s_error_11_13
source: Left motor sensor error, please check control board.
ar: خطأ في جهاز الاستشعار في الموتور الأيسر، يرجى التحقق من لوحة التحكم
fr: Erreur du capteur du moteur gauche, contrôlez votre tableau de bord
ja: 左側モーターの電流センサー異常。メインコントロールボードを点検する必要があります。
ko: 좌측 모터 전류 감응장치 오류, 메인보드를 검사하세요.
zh_hans: 左侧电机电流传感器异常，需检查主控板

# s_error_14_16
source: Right motor sensor error, please check control board.
ar: خطأ في جهاز الاستشعار في الموتور الأيمن، يرجى التحقق من لوحة التحكم
fr: Erreur du capteur du moteur droit, contrôlez votre tableau de bord
ja: 右側モーターの電流センサー異常。メインコントロールボードを点検する必要があります。
ko: 우측 모터 전류 감응장치 오류, 메인보드를 검사하세요.
zh_hans: 右侧电机电流传感器异常，需检查主控板

# s_error_17
source: Firmware of battery is not availiable now, please update battery firmware.
ar: بطارية البرامج الثابتة غير متاحة الآن، يرجى تحديث بطارية البرامج الثابتة
fr: Le niveau de batterie du logiciel n’est pas disponible. Mettez à jour la batterie du logiciel.
ja: バッテリーファームウェアは古いバージョンです。バッテリーファームウェアをアップデートする必要があります。
ko: 배터리 펌웨어버전 낮음,배터리 펌웨어버전을 업그레이드 하세요.
zh_hans: 电池固件版本号过低，需更新电池固件

# s_error_18
source: Left foot sensor error, please check foot sensor or foot pedal switch cable.
ar: خطأ في جهاز استشعار عند القدم اليسرى، برجاء التحقق من جهاز الاستشعار أو كابل دواسة القدم
fr: Erreur du capteur du pied gauche, contrôlez le capteur ou le câble de la pédale
ja: 左側フットマットスイッチ異常。フットマットスイッチのプラスチックボウル及びフットマットスイッチの接続異常。を点検する必要があります。
ko: 좌측 발판 스위치 오류, 발판의 스위치 고무패드 또는 발판 스위치 배선을 검사하세요.
zh_hans: 左侧脚踏开关异常，需检查脚踏开关胶碗以及脚踏开关连线是否正常

# s_error_19
source: Right foot sensor error, please check foot sensor or foot pedal switch cable.
ar: خطأ في جهاز استشعار عند القدم اليمنى، برجاء التحقق من جهاز الاستشعار أو كابل دواسة القدم
fr: Erreur du capteur du pied droit, contrôlez le capteur ou le câble de la pédale.
ja: 右側フットマットスイッチ異常。フットマットスイッチのプラスチックボウル及びフットマットスイッチの接続異常。を点検する必要があります。
ko: 우측 발판 스위치 오류, 발판의 스위치 고무패드 또는 발판 스위치 배선을 검사하세요.
zh_hans: 右侧脚踏开关异常，需检查脚踏开关胶碗以及脚踏开关连线是否正常

# s_error_21
source: Knee control turning sensor error, please check knee control sensor or the connecting cable.
ar: خطأ في جهاز استشعار التحكم في تحويل الفتيس، يرجى التحقق من جهاز الاستشعار أو كابل التوصيل
fr: Erreur du capteur du genou, contrôlez le capteur ou le câble de connexion.
ja: ハンズフリーバーステアリングセンサー異常。ハンズフリーバーセンサーの接続を点検する必要があります。
ko: 무릎바 방향 회전 감응장치 오류, 무릎바 감응장치가 풀어졌거나(느슨한 현상)연결 배선을 검사하세요.
zh_hans: 脚控转向传感器检测异常，需检查脚控传感器是否松动以及连线是否正常

# s_error_22
source: Gravity sendor error.
ar: خطأ في جهاز استشعار الخطر
fr: Erreur du capteur de gravité.
ja: 重力センサー異常。
ko: 중력(무게) 감지장치 오류
zh_hans: 重力传感器异常

# s_error_23
source: Batter connection error, please check the battery connection.
ar: خطأ في بطارية الاتصال، برجاء التحقق من بطارية الاتصال
fr: Erreur de connexion au batteur. Contrôlez la connexion au batteur.
ja: バッテリー通信異常。バッテリー接続状況を確認してください。
ko: 배터리 통신 이상, 배터리 연결 상태를 확인하세요.
zh_hans: 电池通讯异常，请检查电池连接情况

# s_error_24
source: Battery password error, please change the correct battery.
ar: خطأ في كلمة المرور للبطارية، برجاء تغيير البطارية الصحيحة
fr: Erreur du mot de passe de la batterie, changez la batterie.
ja: バッテリーパスワードが正しくありません。正常なバッテリーと交換してください。
ko: 배터리 암호가 맞지 않습니다. 정규적인 배터리를 장착하세요.
zh_hans: 电池密码错误，请更换正常电池

# s_error_26
source: Drive voltage error, please check control board and battery voltage.
ar: خطأ في قيادة الفولت، برجاء التحقق من لوحة التحكم وفولت البطارية
fr: Erreur du voltage de conduit, contrôlez le tableau de bord et le voltage de la batterie.
ja: 駆動電圧異常。メインコントロールボードを点検する必要があります。また、バッテリーの電圧異常がないか確認してください。
ko: 구동 전압 오류, 메인보드와 배터리의 전압을 검사하세요.
zh_hans: 驱动电压异常，需检查主控板以及电池电压是否正常

# s_error_27
source: Cannot power off.
ar: لا يمكن إيقاف التشغيل
fr: Impossible d’éteindre.
ja: 通常のシャットダウンができません
ko: 정상적인 부팅을 할 수 없습니다.
zh_hans: 无法正常关机

# s_error_31
source: Left motor drive sensor error, please check control board.
ar: خطأ في محرك السيارة الايسر، برجاء التحقق من لوحة التحكم
fr: Erreur du capteur du moteur gauche, contrôlez votre tableau de bord.
ja: 左側モーターの駆動器異常。メインコントロールボードを点検する必要があります。
ko: 좌측 모터 구동기 오류, 메인보드를 검사하세요.
zh_hans: 左侧电机驱动器异常，需检查主控板

# s_error_32
source: Right motor drive sensor error, please check control board.
ar: خطأ في محرك السيارة الأيمن، برجاء التحقق من لوحة التحكم
fr: Erreur du capteur du moteur droit, contrôlez votre tableau de bord
ja: 右側モーターの駆動器異常。メインコントロールボードを点検する必要があります。
ko: 우측 모터 구동기 오류, 메인보드를 검사하세요.
zh_hans: 右侧电机驱动器异常，需检查主控板

# s_error_33
source: Over angle protection.
ar: زاوية الحماية
fr: Protection d’angle.
ja: 角度が大きくなりすぎないための保護。
ko: 기울림(각도) 초과 보호기능 작동
zh_hans: 倾角过大保护

# s_error_34
source: Firmware downloading error, please upgrade firmware.
ar: خطأ في تنزيل البرامج الثابتة، برجاء تحسين البرامج الثابتة
fr: Erreur de téléchargement du logiciel, mettez à jour le logiciel.
ja: ファームウェアのダウンロード異常。再度ファームウェアをアップデートしてください。
ko: 펌웨어 다운로드 오류, 다시 시도해 주세요.
zh_hans: 固件下载异常，请重新更新固件

# s_error_35
source: Gyroscope error, please check control board.
ar: خطأ في جيروسكوب، برجاء التحقق من لوحة التحكم
fr: Erreur du gyroscope, contrôlez le tableau de bord
ja: ジャイロの初期化異常。メインコントロールボードをチェックしてください。
ko: 자이로스코프 초기화 오류, 메인보드를 검사하세요.
zh_hans: 陀螺仪初始化异常，请检查主控板

# s_error_36_38
source: Left motor sensor error, please check motor cable or change motor.
ar: خطأ في جهاز الاستشعار في الموتور الأيسر، برجاء التحقق من كابل الموتور أو تغيير الموتور
fr: Erreur du capteur du moteur gauche, vérifiez le câble du moteur ou changez le moteur.
ja: 左側モーターのホールセンサー異常。モーターの接続を確認してください。もしくはモーターを交換が必要な可能性があります。
ko: 좌측 홀센서 오류, 모터 연결 배선을 검사하세요. 또는 배터리를 교체해 보세요.
zh_hans: 左侧电机霍尔传感器异常，请检查电机接线是否正常，或更换电机

# s_error_39_41
source: Right motor sensor error, please check motor cable or change motor.
ar: خطأ في جهاز الاستشعار في الموتور الأيمن، برجاء التحقق من كابل الموتور أو تغيير الموتور
fr: Erreur du capteur du moteur droit, vérifiez le câble du moteur ou changez le moteur.
ja: 右側モーターホールセンサー異常。モーターの接続を確認してください、もしくはモーターを交換が必要な可能性があります。
ko: 우측 홀센서 오류, 모터 연결 배선을 검사하세요. 또는 배터리를 교체해 보세요.
zh_hans: 右侧电机霍尔传感器异常，请检查电机接线是否正常，或更换电机

# s_error_51
source: Battery temperature error, please make sure the temperature is around -10℃~50℃.
ar: خطأ في درجة حرارة البطارية، برجاء التأكد من أن تكون درجتها بين-10℃~50℃.
fr: Erreur de la température de la batterie, assurez-vous que la température est comprise entre -10℃ et 50℃.
ja: バッテリー温度異常。環境温度は-10℃~50℃であることを確認してください。バッテリーを交換が必要な可能性があります。
ko: 배터리 온도 오류, 사용 환경의 온도가 -10℃~50℃범위 내인지 확인하세요. 또는 배터리를 교체해 보세요.
zh_hans: 电池温度异常，请确保环境温度在-10℃~50℃范围内，否则需更换电池

# s_error_52
source: Error of battery cell's voltage, please contact after-sales service.
ar: خطأ في فولت البطارية، برجاء الاتصال بخدمة ما بعد البيع
fr: Erreur du voltage de la cellule de la batterie. Contactez le service après-vente.
ja: バッテリーコアの電圧異常。販売店やサポート部門に連絡してください。
ko: 배터리 셀 전압 오류, 서비스센터에 연락하시길 바랍니다.
zh_hans: 电池电芯电压异常，请联系售后服务。

# s_error_53
source: The battery's serial number is illegal.
zh_hans: 电池序列号错误

# n_nfans_uploading
source: Uploading
ar: تحميل
fr: Chargement
ja: アップロード中
ko: 업로드 중
zh_hans: 正在上传

# n_detail_limited
source: You cannot reply to yourself!
ar: لا يمكن الرد على نفسك
fr: Vous ne pouvez pas vous répondre
ja: 自分への返信はできません。
ko: 자신한테 댓글 달 수 없습니다！
zh_hans: 不能回复自己

# n_message_clear_succeed
source: Clear success
ar: تم المسح بنجاح
fr: Succès de l’effacement
ja: クリア完了
ko: 초기화 완료
zh_hans: 清空成功

# n_upload_images_most
source: Choose 9 pictures at most
ar: اختر 9صور على الأكثر
fr: Choisissez 9 images maximum
ja: 画像のアップロード枚数は最大9枚までです
ko: 최대 9개 이미지를 선택할 수 있습니다.
zh_hans: 图片最多能上传9张

# n_message_front
source: You have
ar: لديك
fr: Vous avez
ja: あなたは
ko: 현재
zh_hans: 您有

# n_message_behine
source: unread messages...
ar: رسائل غير مقروءة
fr: messages non lus...
ja: 件の新着メッセージ...
ko: 미확인 메시지•••
zh_hans: 条未读消息...

# n_fans_upload_sussece
source: Published successfully!
ar: تم النشر بنجاح
fr: Publiés avec succès!
ja: 投稿完了。
ko: 글쓰기 완료!
zh_hans: 发表成功！

# n_fans_check_all
source: Check all
ar: تحقق من الكل
fr: Tout vérifier
ja: すべてを見る
ko: 모두 보기
zh_hans: 查看全部

# n_fans_praise_sussece
source: Successfully liked!
ar: تم الإعجاب بنجاح
fr: Succès de la mention ”j’aime”
ja: 「いいね！」しました。
ko: 추천 완료！
zh_hans: 点赞成功

# n_fans_delete_success
source: Successfully deletes your trends!
ar: تم مسح اتجاهاتك بنجاح
fr: Succès de l’effacement de vos tendances!
ja: 削除完了
ko: 최근활동 삭제 완료！
zh_hans: 删除成功

# s_userName_no
source: Username cannot contains Space.
ar: اسم المستخدم بدون مسافات
fr: Le nom d’utilisateur ne peut pas contenir d’espace.
ja: ユーザー名にスペースは使用できません。
ko: 공백 사용할 수 없습니다.
zh_hans: 用户名中不能包含空格！

# s_pwd_fail
source: Input 6-20 password,can not enter the Chinese characters.
ar: أدخل من 6-20 كلمة مرور، لا تحتوي على رموز صينية
fr: Le mot de passe doit contenir entre 6 et 20 caractères.
ja: パスワードに漢字は使用できません。
ko: 비밀번호 중 한자를 못 들어.
zh_hans: 密码中不能包含汉字！

# s_userName_len
source: The length of userName cannot be more than 20
ar: طول اسم المستخدم لا يزيد عن 20
fr: La longueur du mot de passe ne doit pas dépasser 20 caractères.
ja: ユーザー名は20文字以下にしてください
ko: 사용자 이름 길이를 못 보다 20
zh_hans: 用户名长度不能大于20

# s_pwd_reset_success
source: Reset successfully!
ar: تمت إعادة التشغيل بنجاح
fr: Succès de la remise à 0
ja: パスワードをリセットしました。
ko: 변경 완료
zh_hans: 密码重置成功！

# s_code_fail
source: Request failed, Please try again.
ar: فشل في الطلب، يرجى المحاولة مرة أخرى
fr: Echec de la demande, essayez encore.
ja: リクエストに失敗しました。もう一度操作してください。
ko: 요청이 실패했습니다. 다시 시도해 주십시오.
zh_hans: 请求失败，请重新尝试！

# s_email_and_iphone
source: phone no. and your
ar: رقم التليفون وأنت
fr: numéro de téléphone
ja: の携帯番号とあなたの
ko: 의 휴대폰 번화는 당신의
zh_hans: 的手机号上和您的

# s_registerFail
source: Registeration Failed!
ar: فشل التسجيل
fr: Echec de l’enregistrement
ja: 登録失敗。
ko: 가입실패!
zh_hans: 注册失败！

# s_chenge_fail
source: Revision failed!
ar: فشل المراجعة
fr: Echec de la révision
ja: 変更失敗。
ko: 변경실패!
zh_hans: 修改失败！

# s_new_pwd
source: New passowrd
ar: كلمة مرور جديدة
fr: Nouveau mot de passe
ja: 新しいパスワード
ko: 새 비밀번호
zh_hans: 新密码

# s_regist_pwd
source: Reset password
ar: إعادة تعيين كلمة مرور
fr: Entrez un nouveau mot de passe
ja: パスワードリセット
ko: 비밀번호 초기화
zh_hans: 重置密码

# s_code_find
source: Verification code has been sent to your
ar: تم ارسال رمز التحقق إلى
fr: Le code de vérification vous a été envoyé
ja: 認証コードはあなたの
ko: 인증번호를
zh_hans: 验证码已经发送到您的

# s_phone_find
source: mobible phone, please check
ar: تحقق من هاتفك
fr: téléphone portable, vérifiez
ja: 携帯番号に送信しました。確認してください。
ko: 의 휴대폰 번호로 발송하였습니다.
zh_hans: 的手机号上，请及时查收

# s_email_find
source: mail box, please check
ar: رجاء تحقق من صندوق البريد
fr: email, vérifiez
ja: メールアドレスに送信しました、確認してください。
ko: 의 이메일로 발송하였습니다.
zh_hans: 的邮箱里，请及时查收

# s_user_notFound
source: Username dose not exist!
ar: اسم مستخدم غير موجود
fr: L’utilisateur n’existe pas
ja: ユーザー名は存在していません。
ko: 존재하지 않는 아이디입니다!
zh_hans: 用户名不存在！

# s_find_pwd
source: Forget password
ar: نسيت كلمة المرور
fr: Mot de passe oublié
ja: パスワードを忘れたら
ko: 비밀번호 찾기
zh_hans: 忘记密码

# s_success_state
source: Succeed!
ar: نجح
fr: Succès
ja: 完了。
ko: 성공!
zh_hans: 成功！
