Repository: sxm5220/sxm-ios
Catalog: Ninebot/*.lproj/Localizable.strings
Languages: ar, fr, ja, ko, zh_hans

# lLogoutSure
source: Are you sure to logout the current account?
ar: هل انت متأكد من رغبتك في الخروج من الحساب الحالي؟
fr: Etes-vous sûr de vouloir vous déconnecter?
ja: 現在のアカウントをログアウトしますか。
ko: 회원 탈퇴를 하시겠습니까?
zh_hans: 您确定要注销当前账号吗

# lMachinVer
source: Owner authentication
ar: مصادقة المالك
fr: Authentification du propriétaire
ja: オーナー認証
ko: 사용자 인증
zh_hans: 车主认证

# lLinkMachinFirst
source: Please firstly connect the vehicle!
ar: الرجاء توصيل السيارة أولاً!
fr: Connectez le véhicule en premier
ja: 車両を接続してください。
ko: 연결하세요
zh_hans: 请先连接车！

# lvertify
source: Authentication
ar: مصادقة
fr: Authentification
ja: 認証
ko: 인증
zh_hans: 认证

# lAuthed
source: You have authenticated Ninebot series balance vehicle:
ar: لقد صادقت على سيارة التوازن ناينبوت
fr: Vous avez authentifié un véhicule Ninebot
ja: 認証のninebotシリーズ製品:
ko: Ninebot에 정상적으로 연결되었습니다.
zh_hans: 您已认证的Ninebot系列平衡车:

# lAuth_
source: *You have been authenticated
ar: تمت المصادقة عليك
fr: Vous avez été authentifié
ja: *認証済
ko: *이미 인증이 완료되었습니다.
zh_hans: *您已认证

# l_machins
source: Ninebot series of balance vehicle:
ar: سيارة التوازن ناينبوت:
fr: Série Ninebot:
ja: 台ninebotシリーズ製品:
ko: Ninebot계열 제품
zh_hans: 台Ninebot系列平衡车:

# lmachinNum
source: Ninebot No.:
ar: ناينبوت رقم:
fr: Ninebot N°.:
ja: 車体番号
ko: 시리얼 넘버를 확인해주세요.
zh_hans: 车架号

# lLinkFirst
source: Connect the vehicle firstly!
ar: قم بتوصيل السيارة أولاً
fr: Connectez le véhicule en premier
ja: 車両を接続してください。
ko: 블루투스를 연결해주세요.
zh_hans: 请先连接车！

# lPhoneNum
source: Phone:
ar: هاتف:
fr: Téléphone:
ja: 携帯電話の番号:
ko: 휴대폰 번호:
zh_hans: 手机号:

# lReply
source: Reply
ar: رد
fr: Répondre
ja: 返信
ko: 댓글
zh_hans: 回复

# s_searchDevice
source: Search for device
ar: البحث عن أجهزة
fr: Recherche d’un véhicule
ja: デバイス検索
ko: 검색
zh_hans: 查找设备

# s_reSearch
source: Search again
ar: البحث ثانية
fr: Rechercher
ja: 再度検索
ko: 다시 검색
zh_hans: 重新搜索

# s_searching
source: Searching the device
ar: البحث في الجهاز
fr: Recherche d’un véhicule
ja: デバイス検索中
ko: 검색중…
zh_hans: 正在搜索设备

# s_nofound
source: Not find any devices
ar: تجهيز غير موجود
fr: Aucun véhicule trouvé
ja: デバイスは見つかりませんでした。
ko: 검색 실패
zh_hans: 未找到设备

# s_pconn
source: Please connect the device
ar: الرجاء توصيل الجهاز
fr: Connectez le véhicule
ja: デバイスを接続してください。
ko: 연결하세요
zh_hans: 请连接设备

# s_services
source: Service
ar: الخدمة
fr: Outils
ja: サービス
ko: 더 많은 기능
zh_hans: 服务

# s_find
source: Find
ar: يجد
fr: Cherchez
ja: 発見
ko: 발견
zh_hans: 发现

# s_nplace
source: N Fans
ar: Nدوران مروحة
fr: Actus
ja: Nファンゾーン
ko: N밴드
zh_hans: N粉圈

# s_M_rank
source: Ranking
ar: قائمة الترتيب
fr: Classement
ja: ランキング
ko: 랭킹
zh_hans: 排行榜

# s_my
source: My
ar: لي
fr: Moi
ko: 나의정보
zh_hans: 我的

# s_sin
source: Already signed in
ar: مسجل الدخول مسبقاً
fr: Déjà enregistré en tant que
ja: サインイン済
ko: 출석 체크
zh_hans: 已签到

# s_mil_km
source: Unit Settings
ar: إعدادات وحدة
fr: Paramètres
ja: 単位設定
ko: 단위 설정
zh_hans: 单位设置

# s_device_setting
source: Device settings
ar: إعدادات الجهاز
fr: Paramètres du véhicule
ja: デバイス設定
ko: 설정
zh_hans: 设备设置

# s_deviceInfo
source: Device information
ar: معلومات الجهاز
fr: Information du véhicule
ja: デバイス情報
ko: 정보
zh_hans: 设备信息

# s_setting
source: Software settings
ar: إعدادات السوفتوير
fr: Paramètres du logiciel
ja: ソフトウェア設定
ko: 소프트웨어 설정
zh_hans: 软件设置

# s_more
source: More
ar: أكثر
fr: Plus
ko: 더 보기
zh_hans: 更多

# s_outtimer
source: Network request timeout！
ar: طلب الموقع تجاوز حد الوقت
fr: Echec de la requête au réseau
ja: インターネットにアクセスするリクエストタイムアウト。
ko: 시간 초과
zh_hans: 网络请求超时！

# s_active
source: Activate
ar: يفعل
fr: Activer
ja: デバイスをアクティブにします。
ko: 활성화
zh_hans: 激活设备

# s_goon
source: Still can continue to drive
ar: بالإمكان المتابعة إلى القيادة
fr: Vous pouvez continuer de conduire
ja: 継続走行可能
ko: 운행 가능
zh_hans: 还能继续行驶

# s_singlerun
source: Max Speed (Current ride)
ar: سرعة قصوى وحيدة
fr: Vitesse maximale (Conduite actuelle)
ja: 区間最高速度
ko: 최고 시속
zh_hans: 单次最高速度

# s_avgspeed
source: Average Speed
ar: متوسط سرعة القيادة
fr: Vitesse moyenne
ja: 平均走行速度
ko: 평균 시속
zh_hans: 平均行驶速度

# s_limte_speed
source: Speed limit
ar: وضعية السرعة المحددة
fr: Mode piéton : vitesse bridée
ja: スピードリミットモード
ko: 속도 제한 모드
zh_hans: 限速模式

# s_canrun
source: Remaining Mileage
ar: يمكن لها التوقف/ القيادة
fr: Kilométrage restant
ja: 可能 走行距離
ko: 잔여 거리
zh_hans: 还能 行驶

# s_n
source: North
ar: الشمال
fr: Nord
ja: 北
ko: 북
zh_hans: 北

# s_dn
source: Northeast
ar: الشمال الشرقي
fr: Nord-Est
ja: 北東
ko: 동북
zh_hans: 东北

# s_d
source: East
ar: الشرق
fr: Est
ja: 東
ko: 동
zh_hans: 东

# s_ds
source: Southeast
ar: الجنوب الشرقي
fr: Sud-Est
ja: 南東
ko: 동남
zh_hans: 东南

# s_s
source: South
ar: الجنوب
fr: Sud
ja: 南
ko: 남
zh_hans: 南

# s_xs
source: Southwest
ar: الجنوب الغربي
fr: Sud-Ouest
ja: 南西
ko: 서남
zh_hans: 西南

# s_x
source: West
ar: الغرب
fr: Ouest
ja: 西
ko: 서
zh_hans: 西

# s_sn
source: Northwest
ar: الشمال الغربي
fr: Nord-Ouest
ja: 北西
ko: 서북
zh_hans: 西北

# s_updateing
source: The firmware is being upgraded; please wait...
ar: تتم ترقية البرامج الثابتة, الرجاء الانتظار..
fr: Le logiciel est en train d’être mis à jour. Veuillez attendre...
ja: ファームウェアをアップデート中です。少々お待ちください...
ko: 펌웨어 업데이트 중…
zh_hans: 正在更新固件中，请稍后...

# s_is_up
source: Detect a new version of firmware, whether to upgrade? Notes: The vehicle will be automatically locked before updating!
ar: الكشف عن نسخة جديدة من البرامج الثابتة, هل تود الترقية؟ /ملاحظة: سوف يتم إقفال المركبة أوتوماتيكياً قبل الترقية!
fr: Détection d’une nouvelle version du logiciel, souhaitez-vous mettre à jour ? Note: Le véhicule sera automatiquement verrouillé avant la mise à jour.
ja: ファームウェアの新しいバージョンがあります。アップデートしますか? 注意：アップデートする前に車両は自動にロックされます。
ko: 펌웨어 업데이트를 진행하시겠습니까?
zh_hans: 检测到新版本固件，是否要升级? 注意：升级前会自动锁车！

# s_speed
source: Speed
ar: السرعة
fr: Vitesse
ja: 速度
ko: 속도
zh_hans: 速度

# s_power_
source: battery remaining
ar: الطاقة المتبقية
fr: Batterie restante
ja: バッテリー残量
ko: 배터리 잔량
zh_hans: 剩余电量

# s_mil
source: Residual mileage
ar: عدد الكيلومترات المتبقية
fr: Autonomie restante estimée
ja: 走行可能距離
ko: 잔여 거리
zh_hans: 剩余里程

# s_tmp
source: Vehicle Temp.
ar: درجة الحرارة المركزية
fr: Température du véhicule
ja: 車体温度
ko: 차체 온도
zh_hans: 车体温度

# s_update_ok
source: Submit
ar: عرض
fr: Envoyer
ja: 送信
ko: 확인
zh_hans: 提交

# s_j1
source: Dear Users, vehicle is initialized failed, please try again.
ar: فشل التفعيل
fr: Echec de l’activation
ja: 本登録失敗。
ko: 활성화가 실패했습니다. 다시 활성화 하세요.
zh_hans: 尊敬的用户，当前激活失败，请重新进行尝试。

# s_j2
source: Activation succeeds
ar: نجح التفعيل
fr: Succès de l’activation
ja: 本登録完了。
ko: 활성화 성공!
zh_hans: 激活成功！

# s_j3
source: Has been activated!
ar: تم تفعيلها!
fr: A été activé
ja: 本登録済みです。
ko: 이미 활성화 되었습니다!
zh_hans: 已经激活过了！

# s_j4
source: The required item shall be empty
ar: يجب أن يكون البند المطلوب فارغاً
fr: L’objet suivant devrait être vide
ja: 必須項目が空欄になっています。
ko: 필수 입력 항목입니다.
zh_hans: 必须项为空！

# s_j5
source: The phone format is incorrect
ar: شكل رقم الهاتف غير صحيح!
fr: Le format du téléphone est incorrect
ja: 携帯の形式が間違っています。
ko: 전화번화를 다시 확인해주세요.
zh_hans: 手机格式不正确！

# s_j6
source: Mailbox format is incorrect!
ar: شكل صندوق البريد غير صحيح!
fr: Le format de l’email est incorrect
ja: メールアドレスの形式が間違っています。
ko: 이메일 주소를 다시 확인해주세요.
zh_hans: 邮箱格式不正确！

# s_i_a
source: Phone/mailbox
ar: الهاتف / البريد
fr: Téléphone/email
ja: 携帯/メールアドレス
ko: 전화번호/이메일
zh_hans: 手机/邮箱

# s_pcheck
source: Please check that whether the phone number or mailbox number is correct
ar: الرجاء التأكد فيما لو كان رقم الهاتف او صندوق البريد صحيحاً
fr: Vérifiez que le téléphone et l’email soient corrects
ja: 携帯/メールアドレスは正しいかを確認してください。
ko: 전화번호/이메일을 다시 확인해주세요.
zh_hans: 请检查手机或邮箱号是否正确

# s_safe_vdio
source: Safe video
ar: فيديو آمن
fr: Vidéo de sécurité
ja: 安全ビデオ
ko: 안전 교육 영상
zh_hans: 安全视频

# s_infor
source: Details
ar: تفاصيل
fr: Détails
ja: 詳細
ko: 상세정보
zh_hans: 详情

# s_send
source: Send
ar: إرسال
fr: Envoyer
ja: 送信
ko: 발송
zh_hans: 发 送

# s_pl
source: Review
ar: عرض
fr: Revoir
ja: レビュー
ko: 댓글
zh_hans: 评论

# s_z
source: Praise
ar: مديح
fr: Commentaires
ja: 「いいね！」
ko: 좋아요
zh_hans: 赞

# s_no_content
source: The content shall not be empty
ar: لا يجب أن يكون المحتوى فارغاً
fr: Ce contenu ne peut pas être vide
ja: 送信内容の入力に空欄は使用できません
ko: 필수 입력 항목입니다.
zh_hans: 发送内容不能为空

# s_delete
source: Are you sure to delete the Review?
ar: هل أنت متأكد من مسح العرض؟
fr: Etes-vous sûr de vouloir effacer les commentaires ?
ja: レビューを削除してもよろしいですか?
ko: 댓글 내용 삭제 하겠습니까?
zh_hans: 您确定要删除本条动态吗?

# s_loading
source: Loading
ar: تحميل
fr: Chargement
ja: ローディング中
ko: 준비
zh_hans: 正在加载

# s_loading_
source: Loading…
ar: تحميل ...
fr: En train de charger…
ja: ローディング中...
ko: 준비 중…
zh_hans: 正在加载...

# s_haveno
source: No more data
ar: لا بيانات إضافية
fr: Plus de données
ja: データがありません
ko: 데이터 정보가 없습니다.
zh_hans: 没有更多数据

# s_newshare
source: New share
ar: مشاركة جديدة
fr: Nouveau partage
ja: 新規シェア
ko: 공유
zh_hans: 新分享

# s_over
source: Finish
ar: انتهاء
fr: Finir
ja: 完成
ko: 완성
zh_hans: 完成

# s_publish
source: Release
ar: تحرير
fr: Envoyer
ja: 公開
ko: 발표
zh_hans: 发布

# s_chose
source: Select
ar: اختر
fr: Sélectionner
ja: 選択
ko: 선택
zh_hans: 选择

# nb_carSpeed
source: Speed Settings
ar: إعدادات السرعة
fr: Mode piéton : vitesse bridée
ja: 速度設定
ko: 속도 설정
zh_hans: 车速设置

# nb_carLight
source: Lights Settings
ar: إعدادات الإنارة
fr: Paramètres de lumière
ja: LED設定
ko: 차체 라이트 설정
zh_hans: 灯光设置

# nb_carSound
source: Sound and alarm
ar: الصوت والتنبيه
fr: Sons et alarmes
ja: サウンドと警告音
ko: 경고음 설정
zh_hans: 声音和报警

# nb_carSense
source: Sensor Settings
ar: إعدادات الحساس
fr: Paramètres de capteurs
ja: センサー設定
ko: 센서 세팅
zh_hans: 传感器设置

# nb_carUpdate
source: Firmware Update
ar: تحديث البرامج الثابتة
fr: Mise à jour de logiciel
ja: ファームウェアアップデート
ko: 펌웨어 업그레이드
zh_hans: 固件升级

# nb_carOtherSeting
source: Other Settings
ar: إعدادات أخرى
fr: Autres paramètres
ja: その他設定
ko: 기타 설정
zh_hans: 其他设置

source: Please wait…
ar: الرجاء الإنتظار
fr: Veuillez patienter
ja: 少々お待ちください...
ko: 잠시만 기다려주세요.
zh_hans: 请稍等...

# nb_speedSetting
source: Speed settings
ar: إعدادات السرعة
fr: Paramètres de vitesse
ja: 速度設定
ko: 속도 설정
zh_hans: 速度设置

# yNewIntr
source: Features
ar: مقدمة عن وظائف جديدة
fr: Astuces
ja: 新機能紹介
ko: 새로운 기능
zh_hans: 新功能介绍

# Thanks
source: Acknowledgment
ar: شكر خاص
fr: Remerciements
ja: 特別感謝
ko: 제작 지원
zh_hans: 特别感谢

# yUpdate
source: Version upgrade
ar: ترقية النسخة
fr: Mise à jour de la version
ja: バージョンアップデート
ko: 버전 업그레이드
zh_hans: 版本升级

# yGuanwang
source: Visit the official website
ar: زيارة الموقع الرسمي.
fr: Visitez le site officiel
ja: ホームページにアクセス
ko: 홈페이지 연결
zh_hans: 访问官网

# ySystemMsg
source: System message
fr: Logs des mises à jour
ko: 공지사항
zh_hans: 系统消息

# yBanquan
source: Ninebot (Beijing) Technology Co., Ltd. All rights reserved
ar: جميع الحقوق محفوظة لصالح شركة ناينبوت (بيجينغ) للتقنيات المحدودة المسؤولية
fr: Ninebot (Beijing) Technology Co., Ltd. Tous droits réservés
ja: 知的財産権はナインボット（北京）科技有限会社が所有します。
ko: 저작권 소유 - NINEBOT INC.
zh_hans: 纳恩博（北京）科技有限公司 版权所有

# yNaen
source: Ninebot
ar: ناينبوت
ja: ナインボット
zh_hans: 纳恩博

# yIntroa
source: 1.A new interface, more convenient application experience
ar: 1-واجهة جديدة وخبرة ملائمة أكثر للتطبيق
fr: 1.Une nouvelle interface, plus pratique, avec une meilleure expérience sur l’application
ja: 1. 新しい操作画面は軽くて簡単
ko: 1.새로운 앱 화면
zh_hans: 1.全新界面，应用体验更轻便

# yIntrob
source: 2.Fast login, enjoy more convenient fun
ar: 2- تسجيل دخول سريع, استمتع بمرح أكثر
fr: 2.Connexion rapide, profitez plus
ja: 2. 簡単ログインで楽しく便利
ko: 2.간편 로그인
zh_hans: 2.快速登录，享受乐趣更健康

# yIntroc
source: 3.Fresh experience of cool vehicle control
ar: 3- اختبار ممتع للتحكم السلس بالمركبة
fr: 3.Un nouvelle expérience, avec un meilleur contrôle des véhicules.
ja: 3. 新感覚の車両コントロールで車両を遊びこなそう
ko: 3.컨트롤 화면
zh_hans: 3.炫酷车控，玩转爱车新体验

# yIntrod
source: 4.Switch sceneries as you wish
ar: 4- بدل المناظر كما يحلو لك
fr: 4.Changez d’environnement comme vous le souhaitez
ja: 4. リアル写真切替/ワンボタンでスクリーンショットなど自由自在
ko: 4.실시간 카메라화면
zh_hans: 4.切换实景，一键截屏任我刷屏

# yIntroe
source: 5.Add N fan to get the latest trends real-time sharing
ar: 5- أضف المروحة للحصول على آخر الصيحات والمشاركة الحقيقية
fr: 5.Ajoutez N fan pour recevoir les derniers partages en temps réel.
ja: 5. Nファンになろう！最新近況をリアルタイムで友達にシェア！
ko: 5.N밴드 가입
zh_hans: 5.加入N粉，最新动态实时分享

# yIntrof
source: 6.More services, there are ways to solve various problems
ar: 6- خدمات أكثر, طرق لحل مشكلات متنوعة
fr: 6.Plus de services, il y a plus différentes façons de résoudre un souci.
ja: 6. 各種サービスで疑問を解決できます。
ko: 6.문제 해결
zh_hans: 6.更多服务，解决问题有途径

# yAttria
source: Deep blue color with more modern science and technology
ar: لون أزرق غامق مع علوم حديثة وتكنولوجيا أكثر
fr: Couleur bleu foncé avec une technologie et une science moderne.
ja: ダークブルー基調で現代感を表現
ko: 테마1–차세대
zh_hans: 深蓝主色调，更具现代科技感

# yAttrib
source: Support login with account of No. 9 Community, MIUI account, or phone account fast login
ar: دعم تسجيل الدخول بحساب للمجتمع رقم 9, حساب ميوي , أو حساب هاتفي سريع الدخول
fr: Communautés de support en vous connectant sur 9 Community, MIUI ou sur votre téléphone
ja: ナインボットコミュニティアカウント/携帯アカウントに対応。簡単登録
ko: 나인봇계정, 샤오미계정, 핸드폰번호의 간편로그인을 모드 지원합니다.
zh_hans: 支持九号社区账号登录、小米账号登录、手机账号快速注册登录

# yAttriC
source: You can switch control background to real scene
ar: بإمكانك تحويل خلفية التحكم إلى مشهد حقيقي
fr: Vous pouvez changer d’un environnement de contrôle à une scène réelle.
ja: 背景をリアル写真に変更可能。スクリーンショットをシェアしましょう
ko: 배경을 카메라화면으로 변경하여 화면캡쳐 및 공유할 수 있습니다.
zh_hans: 可切换车控背景为实景，截屏分享

# yAttrid
source: Newly adding functions of product repair, mileage calculator, network of maintenance
ar: وظائف مضافة حديثاً لصيانة المنتج, عداد كيلومترات وشبكة صيانة
fr: Fonctionnalités récemment ajoutées pour les réparations, le calcul du kilométrage, les maintenances du réseau.
ja: 製品修理依頼、距離計算機能、修理スポット機能を追加
ko: A/S접수 기능, 누적 주행거리 기능, 서비스 센터 정보
zh_hans: 新增产品报修、里程计算器 、维修网点功能

# yGo
source: Start to experience
ar: البدء باختبار تجربة
fr: Commencez l’expérience
ja: 今すぐ体験します。
ko: 체험
zh_hans: 立即体验

# Nb_probInf
source: Fault information
ar: معلومات الخطأ
fr: Information par défaut
ja: 故障情報
ko: 고장 정보
zh_hans: 故障信息

# Nb_serviecePlace
source: Maintenance network
ar: شبكة الصيانة
fr: Maintenance du réseau
ja: 修理スポット
ko: 서비스 센터
zh_hans: 维修网点

# Nb_calculator
source: Mileage calculator
ar: عداد الكيلومترات
fr: Calcul du kilométrage
ja: 距離計算機能
ko: 성능 계산기
zh_hans: 里程计算器

# Nb_probCommit
source: Product repairs
ar: صيانات المنتج
fr: Réparation du produit
ja: 製品修理依頼
ko: A/S신청
zh_hans: 产品报修

# Nb_service
source: Service
ar: الخدمة
ja: サービス
ko: 서비스
zh_hans: 服务

# NB_address
source: Contact address
ar: عنوان الاتصال
fr: Adresse de contact
ja: 住所
ko: 주소
zh_hans: 联系地址

# NB_mobile
source: Phone
ar: الهاتف
fr: Téléphone
ja: 携帯
ko: 휴대폰 번호
zh_hans: 手机

# NB_cellPhone
source: Telephone
ar: هاتف
fr: Téléphone
ja: 固定電話
ko: 일반 전화
zh_hans: 固定电话

# NB_byTime
source: Invoice time
ar: وقت الفاتورة
fr: Temps de facture
ja: 領収書日付
ko: 구매일자
zh_hans: 发票时间

# NB_byWay
source: Purchase channels
ar: قنوات الشراء
fr: Canaux de distribution
ja: 購入場所
ko: 구매처
zh_hans: 购买渠道

# NB_sn
source: Series No.
ar: الرقم التسلسلي
fr: Numéro de série.
ja: シリアルナンバー
ko: 시리얼 넘버
zh_hans: 序列号

# NB_errorCode
source: Fault code
ar: رمز الخطأ
fr: Code par défaut
ja: 故障コード
ko: 에러 코드
zh_hans: 故障代码

# NB_probText
source: Fault description
ar: وصف الخطأ
fr: Description par défaut
ja: 故障内容
ko: 고장 설명
zh_hans: 故障描述

# NB_commitAlert
source: Honorific Ninebot user, we have successfully received your problems, and our after-sales personnel will contact you in first time. Please wait patiently.
ar: السيد مستخدم ناينبوت الكريم, تلقينا مشاكلك بنجاح، وسوف يتصل بك موظفونا المختصون بما بعد البيع بأقرب وقت ممكن. يرجى التفضل بالانتظار بصبر.
fr: Cher utilisateur de Ninebot, nous avons reçu la description de vos problèmes et un représentant de notre service après-vente vous contactera prochainement. Soyez patients.
ja: お客様の送信内容を受け付けました。サポートから後日連絡致しますのでしばらくお待ちください。
ko: 정상 접수 되었습니다. 확인 후 연락 드리도록 하겠습니다.
zh_hans: 尊敬的Ninebot用户您好，您的问题我们已经成功接收，我们的售后人员会在第一时间跟您联系，请耐心等待。

# NB_connectFail
source: Network request failed
ar: فشل طلب الموقع
fr: Echec de la requête du réseau
ja: インターネットへのアクセスリクエスト失敗。
ko: 접속이 실패했습니다
zh_hans: 网络请求失败！

# NB_connect_Exception
source: Network request exception
ar: طلب استثنائي للشبكة
fr: Demande du réseau exceptionnelle
ja: インターネットへのアクセスリクエスト異常。
ko: 웹 요청 이상
zh_hans: 网络请求异常

# yCommit
source: Submit
ar: عرض
fr: Envoyer
ja: 送信
ko: 입력
zh_hans: 提交

# yYear
source: Year
ar: سنة
fr: Année
ja: 年
ko: 년
zh_hans: 年

# yMonth
source: Month
ar: شهر
fr: Mois
ja: 月
ko: 월
zh_hans: 月

# yDay
source: Day
ar: يوم
fr: Jour
ja: 日
ko: 일
zh_hans: 日

# nb_placehold
source: Please input the contents
ar: الرجاء إدخال المحتويات
fr: Renseignez les contenus
ja: 内容を入力してください
ko: 입력하세요
zh_hans: 请输入内容

# NB_modelNumber
source: Model
ar: طراز
fr: Modèle
ja: 型番
ko: 모델명
zh_hans: 型号

# NB_calcuVolume
source: Battery volume
ar: سعة البطارية
fr: Capacité de la batterie
ja: バッテリー容量
ko: 배터리 용량
zh_hans: 电池容量

# NB_height
source: Weight
ar: الوزن
fr: Poids supporté
ja: 体重
ko: 체중
zh_hans: 体重

# NB_capture
source: Air Temperature
ar: درجة حرارة الهواء المحيط
fr: Température de l’air
ja: 環境温度
ko: 온도
zh_hans: 环境气温

# NB_driveStyle
source: Driving style
ar: نمط القيادة
fr: Style de conduite
ja: 乗車習慣
ko: 드라이브 스타일
zh_hans: 驾驶风格

# NB_battryUse
source: Times fully charged
ar: مرات شحن البطارية
fr: Nombre de recharges complètes
ja: 満充電回数
ko: 배터리 충전 횟수
zh_hans: 完全充电次数

# nb_calculateFail
source: The machine information is not complete; please complete your machine information
ar: معلومات الآلة غير كاملة, الرجاء استكمال معلومات الآلة
fr: Les informations sur le véhicule ne sont pas renseignés, veuillez les renseigner
ja: 機器情報が不足しています。機器情報を追加してください。
ko: 기계정보가 일치하지 않습니다. 기계 상태를 확인 바랍니다.
zh_hans: 机器信息不完整，请完善您的机器信息

# yPleawrite
source: Please fill in
ar: الرجاء التعبئة
fr: Remplissez
ja: 記入してください。
ko: 입력하세요
zh_hans: 请填写

# yCi
source: Times
fr: Cycles
ja: 回
ko: 회
zh_hans: 次

# yOutRange
source: Beyond the scope; please input it again
ar: خارج النطاق, الرجاء الإدخال مرة اخرى
fr: En dessous de la prévision; remplissez encore
ja: 範囲オーバー、もう一度入力してください。
ko: 입력 범위를 초과하였습니다. 재입력바랍니다.
zh_hans: 超出范围，请重新输入

# yRane
source: Scope
ar: نطاق
fr: Prévision
ja: 範囲
ko: 범위
zh_hans: 范围

# yStylesa
source: Driving at a constant speed
ar: القيادة بسرعة ثابتة
fr: Conduite à vitesse constante (15 km/h)
ja: 均一速度で走行
ko: 일정 속도 유지
zh_hans: 匀速行驶

# yStylesb
source: Urban road (frequent speed acceleration and deceleration)
ar: الطرق في المناطق الحضرية (تكرار زيادة التسارع والتباطؤ)
fr: Conduite sportive(accélérations & freinages fréquents)
ja: 都市型の道路状況(頻繁にスピード変化)
ko: 도로주행 감속 가속
zh_hans: 城市路况加减速

# yStylesc
source: Stunt show driving
ar: قيادة عرض بهلواني
fr: Conduite acrobatique(sur place, sauts, etc.)
ja: 演出/展示/ショーでの運転
ko: 묘기 모드
zh_hans: 特技表演驾驶

# yCalculate
source: Mileage calculates
ar: مجموع المسافات
fr: Estimation d’autonomie
ja: 距離計算
ko: 계산
zh_hans: 里程计算

# y_no
source: Exclude fully charged times
ar: استثناء مرات الشحن
fr: Recharge exclue
ja: 満充電回数を含めない
ko: 완전히 충전된 횟수 불포함
zh_hans: 不含完全充电次数

# y_have
source: Include fully charged times
ar: احتساب مرات الشحن
fr: Recharge incluse
ja: 満充電回数を含める
ko: 완전히 충전된 횟수 포함
zh_hans: 含完全充电次数

# CFBundleDisplayName
source: Ninebot
ar: ناينبوت
ja: ナインボット
zh_hans: 九号

# no_network
source: There is no available network
ar: دون اكتشاف أي موقع متوفر!
fr: Il n’y a pas de réseau disponible
ja: 使用できるネット環境はありません。
ko: 네트워크 연결하십시오!
zh_hans: 没有检测到可用网络！

# nb_perInfo
source: Personal information
ar: معلومات شخصية
fr: Information personnelle
ja: 個人情報
ko: 개인 정보
zh_hans: 个人信息

# s_inPutUserName
source: Username/Email
fr: nom d'utilisateur/email
ja: ユーザー名/メール
ko: 사용자 이름 / 이메일
zh_hans: 用户名/邮箱/手机号

# nb_l
source: Hard
ar: قاس
fr: Dur
ja: ハード
ko: 단단함
zh_hans: 硬

# nb_r
source: Soft
ar: طري
fr: Doux
ja: ソフト
ko: 부드러움
zh_hans: 软

# NB_Rank_WEEK
source: Weekly
ar: قائمة تصنيف لأسبوع
fr: Hebdomadaire
ja: 週間ランキング
ko: 주 랭킹
zh_hans: 周排行榜

# NB_Rank_WEEK_
source: Ranking list of the Week
ar: قائمة التصنيف الأسبوعية
fr: Classement hebdomadaire
ja: 今週のランキング
ko: 이번 주 랭킹
zh_hans: 本周排行

# one_breakled
source: Brake lights
ar: مفتاح ضوء الفرامل
fr: Feu de freinage
ja: ブレーキLEDスイッチ
ko: 브레이크 라이트 설정(제동 시 빨간색)
zh_hans: 刹车灯开关

# setting_addcode
source: Additional code:
ar: رمز إضافي:
fr: Code additionnel:
ja: 追加コード:
ko: 인증 부가비트:
zh_hans: 附加码:

# SetBluetoothName
source: Set the vehicle name
ar: قم بإعداد اسم البلوتوث
fr: Définir le nom du véhicule
ja: 車両名称設定
ko: 블루투스 명칭 설정
zh_hans: 设置车辆名称

# Input8Number
source: Please input 8 characters
ar: الرجاء إدخال 8 أحرف
fr: Renseignez 8 caractères
ja: 8文字の半角英数字を入力してください
ko: 8자리 숫자를 입력해주세요
zh_hans: 请输入8个字符

# BluetoothNameError
source: Please input 8 letters or numbers
ar: الرجاء إدخال 8 أحرف أو أرقام
fr: Renseignez 8 lettres ou nombres
ja: 8文字の半角英数字を入力してください
ko: 8자리 숫자 또는 부호를 입력해주세요
zh_hans: 请输入8位字符或数字

# LowTSPonefoot
source: Lower steering speed with one foot
ar: خفف سرعة القيادة باستخدام قدم واحدة
fr: Ajustez la vitesse avec un pied
ja: 片足の場合、ステアリングの速度は制限されます。
ko: 한 발로 주행시 회전 속도 하향
zh_hans: 单脚时降低转向速度

source: Nickname:
ar: اسم العائلة:
fr: Nom d’utilisateur:
ja: ニックネーム:
ko: 닉네임:
zh_hans: 昵 称:

# p_inputGender
source: Please input gender
ar: الرجاء إدخال الجنس
fr: Renseignez votre sexe
ja: 性別を入力してください
ko: 성별
zh_hans: 请输入性别

# p_inputRealName
source: Please input nickname
ar: الرجاء إدخال اسم العائلة
fr: Renseignez votre nom d’utilisateur
ja: ニックネームを入力してください
ko: 닉네임을 입력하십시오
zh_hans: 请输入昵称

# up_result
source: Changing the personal information fails!
ar: فشل تعديل المعلومات الشخصية
fr: Echec du changement des informations personnelles
ja: 個人情報変更失敗。
ko: 개인정보 수정 실패!
zh_hans: 个人信息更改失败！

# l_mode_0
source: No lights
ar: ضوء الأجواء القريب
fr: Pas de lumière
ja: ムードLED消灯
ko: LED OFF
zh_hans: 关闭氛围灯

# one_konck
source: Knock on the switch
ar: أنقر على مفتاح التبديل
fr: Taper pour changer
ja: 軽いノックでLEDスイッチを切替
ko: 라이트 모드 자동전환
zh_hans: 敲击切换灯模式

# takePhoto
source: Take photos
ar: أخذ الصور
fr: Prendre des photos
ja: 写真を撮る
ko: 촬영
zh_hans: 拍照

# select_from
source: Select from the album
ar: اختر من البوم الصور
fr: Sélectionnez depuis l’album
ja: カメラロールから選択
ko: 앨범에서 사진 선택
zh_hans: 从相册中选取

# Individuality signature
source: Signature:
ar: التوقيع الفردي:
ja: ムードメッセージ:
ko: 상태:
zh_hans: 个性签名:

# nb_Sex
source: Gender:
ar: الجنس:
fr: Sexe:
ja: 性 別:
ko: 성별:
zh_hans: 性 别:

# nb_city
source: Resident city:
ar: مدينة الإقامة:
fr: Ville de résidence:
ja: お住まいの町:
ko: 지역:
zh_hans: 居住城市:

# nb_nohave
source: Not available
ar: غير متوفر
fr: Ville de résidence
ja: なし
ko: 잠시 대기
zh_hans: 暂无

# nb_enterWeb
source: Enter the official website
ar: الدخول للموقع الرسمي
fr: Renseignez le site officiel
ja: ホームページへ
ko: 홈페이지
zh_hans: 进 入 官 网

# p_inputName
source: Please input individuality signature
ar: الرجاء إدخال التوقيع الفردي
fr: Renseignez votre signature individuelle
ja: ムードメッセージを入力してください
ko: 상태 메시지를 입력해주세요
zh_hans: 请输入个性签名

# l_iName
source: The length of individuality signature is limited
ar: طول التوقيع الفردي محدود
fr: La longueur de votre signature est trop longue
ja: ムードメッセージ文字数制限。
ko: 상태메시지가 너무 깁니다!
zh_hans: 个性签名长度受限！

# txtHello
source: Hello
ar: مرحبا
fr: Bonjour
ja: こんにちは
ko: 안녕하세요
zh_hans: 您好

# txtPleaseLogin
source: Please login
ar: الرجاء تسجيل الدخول
fr: Connectez-vous
ja: ログインしてください
ko: 로그인
zh_hans: 请登录

# nb_login
source: Login
ar: تسجيل الدخول
fr: Connexion
ja: ログイン
ko: 로그인
zh_hans: 登 陆

# nb_Regist
source: Registration
ar: التسجيل
fr: Enregistrement
ja: ユーザー登録
ko: 회원가입
zh_hans: 注 册

# nb_ZX
source: Logout
ar: تسجيل الخروج
fr: Déconnexion
ja: ログアウト
ko: 취소
zh_hans: 注 销

# txtFieldBlank
source: Shall not be empty
ar: لا يجب أن يكون فارغاً
fr: Ne doit pas être vide
ja: 空欄は使用できません
ko: 필수 입력 항목
zh_hans: 不能为空

# OpenSafari
source: Safari skims
ar: جولات التنزه
ja: Safariで見る
ko: Safari 브라우저 연결
zh_hans: Safari浏览

# max_speed
source: Maximum speed
ar: السرعة القصوى
fr: Vitesse maximum
ja: 最大速度
ko: 최고 속도
zh_hans: 最大速度

# NB_Rank
source: Total
ar: قائمة الترتيب العام
ja: トータルランキング
ko: 랭킹
zh_hans: 总排行榜

# NO_Rank
source: Ranking unavailable
ar: التصنيف غير متوفر
fr: Classement indisponible
ja: ランキングに入っていません
ko: 랭킹 정보가 없습니다
zh_hans: 暂无排名
