Repository: sxm5220/sxm-ios
Catalog: Ninebot/*.lproj/Localizable.strings
Languages: ar, fr, ja, ko, zh_hans

# ErrCodeCause46
source: Reserve unused error code; error type has not been defined yet
ar: حجز رمز خطأ غير مستخدم. ولم يتم تحديد نوع الخطأ بعد
fr: Code d’erreur non utilisé, le type d’erreur n’a pas encore été définie.
ja: 未使用のエラーコード、エラー分類不明
ko: 현재 보류중인 에러코드,아직 미정의 상태인 에러 유형
zh_hans: 保留未用的错误代码，目前尚未定义错误类型

# ErrCodeSug1_8
source: Attempt to restart, if the error still exists, please contact your retailer or Ninebot service center; you may be asked to deliver vehicle body of Ninebot to your retailer for overhauling. E-mail (Chinese/English): service@ninebot.com
ar: محاولة إعادة التشغيل, أذا بقي الخطأ موجوداً الرجاء الاتصال بالبائع أو بمركز صيانة ناينبوت: قد يطلب إليك توصيل جسم سيارة ناينبوت إلى بائعك من أجل الإصلاح. البريد الالكتروني (صيني- انكليزي): service@ninebot.com
fr: Tentative de redémarrage, si l’erreur persiste, contactez votre revendeur ou votre centre de service Ninebot. On pourrait vous demander de ramener votre Ninebot pour un contrôle. E-mail (Chinois/Anglais): service@ninebot.com
ja: 再起動してください。再起動しても解決できない場合は、販売店や代理店サポート部門に連絡してください。電子メール(日本語)：support@e-otomo.co.jp
ko: 본체 다시 시작을 2-3번 실행하여 오류 현상이 해결되는지 살펴봅니다.이상 해결 절차로 문제 해결이 안될 경우 제품 구매처 또는 가까운 서비스센터로 연락하세요. 본체를 구입처 또는 서비스센터에 교부하여 점검을 진행할 필요가 있습니다. 이메일: ninebot@naver.com
zh_hans: 尝试重新开机，若错误仍然存在，请联系您的销售商或服务中心，可能需将车身送交您的销售商处检修。电子邮件(中文/英语)：service@ninebot.com

# ErrCodeSug9_12
source: Users cannot solve the fault by themselves. Please contact your retailer or Ninebot service center; you may be asked to deliver vehicle body of Ninebot to your retailer for overhauling. E-mail (Chinese/English): service@ninebot.com
ar: ليس بإمكان المستخدمين معالجة الخطأ بأنفسهم. الرجاء الاتصال ببائعك أو بمركز صيانة ناينبوت: قد يطلب إليك توصيل جسم سيارة ناينبوت إلى بائعك من أجل الإصلاح. البريد الالكتروني (صيني- انكليزي):service@ninebot.com
fr: Les utilisateurs ne peuvent pas résoudre les erreurs eux-mêmes. Contactez votre revendeur ou votre centre de service Ninebot. On pourrait vous demander de ramener votre Ninebot pour un contrôle. E-mail (Chinois/Anglais): service@ninebot.com
ja: この故障はお客様自身で解決できません。販売店や代理店サポート部門に連絡してください。電子メール(日本語)：support@e-otomo.co.jp
ko: 사용자가 해결할 수 없는 에러사항입니다. 제품 구매처 또는 가까운 서비스센터로 연락하세요. 본체를 구입처 또는 서비스센터에 교부하여 점검을 진행할 필요가 있습니다. 이메일: ninebot@naver.com
zh_hans: 此故障用户无法自行解决。请联系您的销售商或服务中心，可能需将车身送交您的销售商处检修。电子邮件(中文/英语)：service@ninebot.com

# ErrCodeSug13_19
source: Attempt to restart the machine again. If the problem still can’t be settled, please contact with your retailer or Ninebot service center. You may be asked to deliver vehicle body of Ninebot to your retailer for overhauling. E-mail (Chinese/English): service@ninebot.com
ar: Attempt حاول إعادة تشغيل الآلة مجدداً. إذا كانت المشكلة لم تحل بعد, الرجاء الاتصال ببائعك أو بمركز صيانة ناينبوت: قد يطلب إليك توصيل جسم سيارة ناينبوت إلى بائعك من أجل الإصلاح. البريد الالكتروني (صيني- انكليزي):service@ninebot.com.
fr: Nouvelle tentative de redémarrage, si l’erreur persiste, contactez votre revendeur ou votre centre de service Ninebot. On pourrait vous demander de ramener votre Ninebot pour un contrôle. E-mail (Chinois/Anglais): service@ninebot.com
ja: 再起動してください。再起動しても解決できない場合は、販売店や代理店サポート部門に連絡してください。電子メール(日本語)：support@e-otomo.co.jp
ko: 본체 다시 시작을 시도합니다. 제품 구매처 또는 가까운 서비스센터로 연락하세요. 본체를 구입처 또는 서비스센터에 교부하여 점검을 진행할 필요가 있습니다. 이메일: ninebot@naver.com
zh_hans: 尝试重新开机，若仍无法解决，请联系您的销售商或服务中心，可能需将车身送交您的销售商处检修。电子邮件(中文/英语)：service@ninebot.com

# ErrCodeSug20_29
source: Attempt to restart the machine again. If the problem still can’t be settled, please contact with your retailer or Ninebot service center. You may be asked to deliver vehicle body of Ninebot to your retailer for overhauling. E-mail (Chinese/English): service@ninebot.com
ar: Attempt حاول إعادة تشغيل الآلة مجدداً. إذا كانت المشكلة لم تحل بعد, الرجاء الاتصال ببائعك أو بمركز صيانة ناينبوت: قد يطلب إليك توصيل جسم سيارة ناينبوت إلى بائعك من أجل الإصلاح. البريد الالكتروني (صيني- انكليزي):service@ninebot.com.
fr: Nouvelle tentative de redémarrage, si l’erreur persiste, contactez votre revendeur ou votre centre de service Ninebot. On pourrait vous demander de ramener votre Ninebot pour un contrôle. E-mail (Chinois/Anglais): service@ninebot.com
ja: 再起動してください。再起動しても解決できない場合は、販売店や代理店サポート部門に連絡してください。電子メール(日本語)：support@e-otomo.co.jp
ko: 본체 다시 시작을 시도합니다. 제품 구매처 또는 가까운 서비스센터로 연락하세요. 본체를 구입처 또는 서비스센터에 교부하여 점검을 진행할 필요가 있습니다. 이메일: ninebot@naver.com
zh_hans: 尝试重新开机，若仍无法解决，请联系您的销售商或服务中心，可能需将车身送交您的销售商处检修。电子邮件(中文/英语)：service@ninebot.com

# ErrCodeSug30_34
source: 1.Ensure that downside of handlebar is inserted in place (refer to 2.3.2 of user’s manual). This error will occur if handlebar is inserted to vehicle body in a wrong place. 2.Ensure 6 screws (i.e., the screws twisted when assemble is done to your new vehicle) connecting upside and downside of handlebar have been perfectly tightened; waggle the handlebar gently, to ensure the position does not loose. Looseness of the screws may results in bad contact, which causes the error
ar: أولا/ تأكد من أن الجزء العلوي من المقبض مثبت في مكانه (إشارة إلى 2.3.2 في دليل المستخدم). هذا الخطأ سوف يحصل عندما يكون المقبض موضوعاً بجسم السيارة في مكان خاطئ. ثانيا/ تأكد أن البراغي الست ( مثلاً من أن البراغي مشدودة عند تركيب سيارتك الجديدة) التي تصل الجانب العلوي بالسفلي للمقبض مثبتة بشكل قوي: هز المقبض برفق لتتأكد من أنه ثابت. انحلال البراغي قد يؤدي لاتصال سيئ مما يتسبب بالأعطال.
fr: 1.Assurez-vous que le bas du guidon est bien inséré et en place (Point 2.3.2 du manuel d’utilisateur). Cette erreur apparaîtra si le guidon est inséré au mauvais endroit. 2. Assurez-vous que les 6 vis (i.e., les vis sont mises en place lorsque l’assemblage est fait sur votre nouveau véhicule) qui connectent le haut et le bas du guidon sont parfaitement tenues, en bougeant doucement le guidon, pour s’assurer que la position ne changera pa. La perte de ces vis peut résulter d’un mauvais contact, ce qui cause l’erreur.
ja: 1.ステアリングバーの接続を確認してください。（クイックマニュアルをよくお読みください）。ステアリングバーの接続具合によりこのエラーが発生します。 2.ステアリングバーとハンドルバーの間の6本のネジの緩みがないかを確認してください。ネジの緩みによりこのエラーが発生します。
ko: 1.핸들바 하단 연결상태를 확인합니다.（설명서참고2.3.2）。핸들바 하단과 본체연결이 불량일 경우 발생하는 오류입니다. 2.핸들바 상단, 하단의 6개 나사가 느슨한지 확인합니다.(제품 개봉 조립 시 장착한 나사)나사를 조이고 핸들바를 가볍게 흔들어 느슨한지 확인합니다. 핸들바 상단, 하단 연결이 원활하지 않는 경우 본 오류를 유발할 수 있습니다.
zh_hans: 1.确保手把下段已插到位（参见用户手册2.3.2）。如手把插入车体不到位会产生此错误。 2.确保手把上下段之间连接的6个螺钉（即您新车组装时拧的几个螺钉）已完全拧紧，轻轻晃动手把，确保此位置没有松动。这些螺钉松动可能导致接触不良而产生此错误

# ErrCodeSug35
source: Attempt to restart twice-three times and observe whether the error disappears. If the error still exists, please contact your retailer or Ninebot service center; you may be asked to deliver vehicle body of Ninebot to your retailer for overhauling. E-mail (Chinese/English): service@ninebot.com
ar: حاول إعادة التشغيل لثلاث مرات وتأكد إذا ما كان الخطأ قد اختفى. إذا كانت المشكلة لم تحل بعد, الرجاء الاتصال ببائعك أو بمركز صيانة ناينبوت: قد يطلب إليك توصيل جسم سيارة ناينبوت إلى بائعك من أجل الإصلاح. البريد الالكتروني (صيني- انكليزي):service@ninebot.com
fr: Tentez de redémarrer le véhicule 2 ou 3 fois et observez si l’erreur disparaît. Si l’erreur persiste, contactez votre revendeur ou votre centre de service Ninebot. On pourrait vous demander de ramener votre Ninebot pour un contrôle. E-mail (Chinois/Anglais): service@ninebot.com
ja: 2–3回再起動してエラーが消えたかを確認してください。エラーが消えない場合は、販売店や代理店サポート部門に連絡してください。電子メール(日本語)：support@e-otomo.co.jp
ko: 본체 다시 시작을 2-3번 실행하여 오류 현상이 해결되는지 살펴봅니다.이상 해결 절차로 문제 해결이 안될 경우 제품 구매처 또는 가까운 서비스센터로 연락하세요. 본체를 구입처 또는 서비스센터에 교부하여 점검을 진행할 필요가 있습니다. 이메일: ninebot@naver.com
zh_hans: 尝试重新开机2-3次并观察错误是否消失。如依然出现此错误，请联系您的销售商或服务中心，可能需将车身送交您的销售商处检修。电子邮件(中文/英语)：service@ninebot.com

# ErrCodeSug36
source: Charge the vehicle body for 10 minutes with the charger, if the problem still cannot be solved, dismantle battery pack and remount, attempt to charge again, if the problem still cannot be solved, please contact your retailer or Ninebot service center; you may be asked to deliver your battery pack to your retailer for overhauling. E-mail (Chinese/English): service@ninebot.com
ar: اشحن السيارة لمدة عشر دقائق باستخدام الشاحن, إذا لم يتم حل المشكلة, قم بنزع عبوة البطارية وأعدها ثانية, حاول الشحن مرة أخرى, إذا كانت المشكلة لم تحل بعد, الرجاء الاتصال ببائعك أو بمركز صيانة ناينبوت: قد يطلب إليك توصيل جسم سيارة ناينبوت إلى بائعك من أجل الإصلاح. البريد الالكتروني (صيني- انكليزي):service@ninebot.com
fr: Rechargez le véhicule pendant 10 minutes avec le chargeur, si le problème persiste, enlever la batterie et replacez la, essayez de recharger de nouveau. Si l’erreur persiste, contactez votre revendeur ou votre centre de service Ninebot. On pourrait vous demander de ramener votre Ninebot pour un contrôle. E-mail (Chinois/Anglais): service@ninebot.com
ja: 充電器を使用し10分間充電を行ってください。解決できない場合は、バッテリーパックを取り外してもう一度セットしてください。再度充電し、また解決できない場合は、販売店や代理店サポート部門に連絡してください。電子メール(日本語)：support@e-otomo.co.jp
ko: 충전기를 연결하여 본체 충전을 10분간 실시합니다. 문제해결이 안될 경우 배터리는 분리하여 재장착합니다. 배터리 재장착한 다음 다시 충전기를 연결하여 충전합니다. 이상 해결 절차로 문제 해결이 안될 경우 제품 구매처 또는 가까운 서비스센터로 연락하세요. 배터리를 구입처 또는 서비스센터에 교부하여 점검을 진행할 필요가 있습니다. 이메일: ninebot@naver.com
zh_hans: 使用充电器对车体进行10分钟的充电，若仍无法解决问题，拆下电池组并重新安装一次，再次尝试充电，如依然无法解决，请联系您的销售商或服务中心，可能需将电池组送交您的销售商处检修。电子邮件(中文/英语)：service@ninebot.com

# ErrCodeSug37
source: Charge the vehicle body for 10 minutes with the charger, if the problem still cannot be solved, dismantle battery pack and remount, attempt to charge again, if the error still exists, please contact your retailer or Ninebot service center; you may be asked to deliver your battery pack to your retailer for overhauling. E-mail (Chinese/English): service@ninebot.com
ar: اشحن السيارة لمدة عشر دقائق باستخدام الشاحن, إذا لم يتم حل المشكلة, قم بنزع عبوة البطارية وأعدها ثانية, حاول الشحن مرة أخرى, إذا كان الخطأ ما يزال موجوداً, الرجاء الاتصال ببائعك أو بمركز صيانة ناينبوت: قد يطلب إليك توصيل جسم سيارة ناينبوت إلى بائعك من أجل الإصلاح. البريد الالكتروني (صيني- انكليزي):service@ninebot.com
fr: Rechargez le véhicule pendant 10 minutes avec le chargeur, si le problème persiste, enlever la batterie et replacez la, essayez de recharger de nouveau. Si l’erreur persiste, contactez votre revendeur ou votre centre de service Ninebot. On pourrait vous demander de ramener votre Ninebot pour un contrôle. E-mail (Chinois/Anglais): service@ninebot.com
ja: 充電器を使用し10分間充電を行ってください。解決できない場合は、バッテリーパックを取り外してもう一度セットしてください。再度充電し、また解決できない場合は、販売店や代理店サポート部門に連絡してください。電子メール(日本語)：support@e-otomo.co.jp
ko: 충전기를 연결하여 본체 충전을 10분간 실시합니다. 문제해결이 안될 경우 배터리는 분리하여 재장착합니다. 배터리 재장착한 다음 다시 충전기를 연결하여 충전합니다. 이상 해결 절차로 문제 해결이 안될 경우 제품 구매처 또는 가까운 서비스센터로 연락하세요. 배터리를 구입처 또는 서비스센터에 교부하여 점검을 진행할 필요가 있습니다. 이메일: ninebot@naver.com
zh_hans: 使用充电器对车体进行10分钟的充电，若仍无法解决问题，拆下电池组并重新安装一次，再次尝试充电，如错误仍然存在，请联系您的销售商或服务中心，可能需将电池组送交您的销售商处检修。电子邮件(中文/英语)：service@ninebot.com

# ErrCodeSug38
source: 1. If the kind of error occurs when Ninebot was used after being disposed at the subzero ten Celsius degree, the low temperature alarm may be generated from the low environment temperature. Please put Ninebot in room temperature environment for at least eight hours, and then try again. 2. Touch battery case with hand, if it is hot, please disuse immediately, and attempt to restart after placing Ninebot at room temperature for at least four hours. If the error still exists, please disuse Ninebot immediately and contact your retailer or Ninebot service center; you may be asked to deliver your battery pack to your retailer for overhauling. E-mail (Chinese/English): service@ninebot.com
ar: أولا/ إذا كان نوع الخطأ يظهر عند استخدام ناينبوت بعد توضيبها في درجة عشرة مئوية تحت الصفر, قد يتولد إنذار بالحرارة المنخفضة بسبب حرارة الجو المنخفضة المحيطة. الرجاء ترك ناينبوت في درجة حرارة غرفة لمدة ثمان ساعات على الأقل, بعدها حاول مجدداً. ثانيا/ المس حافظة البطارية بيدك, إذا كانت ساخنة فتوقف عن استعمالها مباشرة وحاول إعادة التشغيل بعد ترك ناينبوت في جو بدرجة حرارة غرفة لمدة أربع ساعات على الأقل. ثالثا/ إذا كان الخطأ لا يزال موجوداً, الرجاء التوقف عن استعمال ناينبوت فوراً والاتصال ببائعك أو بمركز صيانة ناينبوت: قد يطلب إليك توصيل جسم سيارة ناينبوت إلى بائعك من أجل الإصلاح. البريد الالكتروني (صيني- انكليزي):service@ninebot.com
fr: 1. Si ce type d’erreur apparait après l’utilisation du Ninebot en dessous d’une température inférieure à 0°C, l’alarme basse température a pu être déclenchée à cause de la température basse extérieure. Placez le Ninebot dans une pièce à température ambiante pendant 8 heures minimum, et essayez de nouveau. 2. Touchez le couvercle de la batterie, s’il est chaud, arrêtez d’utiliser le Ninebot immédiatement, et essayez de rallumer le Ninebot après avoir placé le Ninebot dans une pièce à température ambiante pendant au moins 4 heures. Si l’erreur persiste, contactez votre revendeur ou votre centre de service Ninebot. On pourrait vous demander de ramener votre Ninebot pour un contrôle. E-mail (Chinois/Anglais): service@ninebot.com
ja: 1.-10度未満の環境で保管し発生したエラーです。低温環境で発生した警告です。Ninebotを室温環境（約20度前後）に置き、最短で約8時間後に再起動してください。 2.バッテリーカバーを触り、高温の場合は直ちに使用を中止してください。Ninebotを室温環境（約20度前後）に置き、最短で約4時間後に再起動してください。 エラーが消えない場合は直ちに使用を中止して販売店や代理店サポート部門に連絡してください。電子メール(日本語)：support@e-otomo.co.jp
ko: 1. Ninebot은 영하10도(-10℃)의 기온환경에 보관해 두었을 경우 본 에러가 발생합니다. 환경온도가 낮으면 저온경보를 유발시킬 수 있습니다. Ninebot을 상온환경에 최소 8시간이상 방치한 다음 전원을 킵니다. 2. 만일 손으로 배터리커버에 접촉했을 때 뜨거우면 즉시 사용을 중지하십시오. Ninebot을 상온환경에 최소 4시간이상 방치한 다음 전원을 킵니다. 이상 해결 절차로 문제 해결이 안될 경우 제품 구매처 또는 가까운 서비스센터로 연락하세요. 배터리를 구입처 또는 서비스센터에 교부하여 점검을 진행할 필요가 있습니다. 이메일: ninebot@naver.com
zh_hans: 1.如果车辆在零下10摄氏度的温度下存放后使用时出现此错误，可能是因为环境温度过低导致出现低温报警。请将车辆放入室温环境至少8小时后再重新尝试。 2.用手触摸电池外壳，如果感到烫手，请立即停止使用，将车辆放入室温环境至少4小时之后再尝试重新开机。 如错误仍然存在，请立即停止使用车辆并联系您的销售商或服务中心，可能需将电池组送交您的销售商处检修。电子邮件(中文/英语)：service@ninebot.com

# ErrCodeSug39
source: 1. If the kind of error occurs when Ninebot was used after being disposed at the subzero ten Celsius degree, the low temperature alarm may be generated from the low environment temperature. Please put Ninebot in room temperature environment for at least eight hours, and then try again. 2. Touch battery case with hand, if it is hot, please disuse immediately, and attempt to restart after placing Ninebot at room temperature for at least 4 hours. If the error still exists, please disuse Ninebot immediately and contact your retailer or Ninebot service center; you may be asked to deliver your battery pack to your retailer for overhauling. E-mail (Chinese/English): service@ninebot.com
ar: أولا/ إذا كان نوع الخطأ يظهر عند استخدام ناينبوت بعد توضيبها في درجة عشرة مئوية تحت الصفر, قد يتولد إنذار بالحرارة المنخفضة بسبب حرارة الجو المنخفضة المحيطة. الرجاء ترك ناينبوت في درجة حرارة غرفة لمدة ثمان ساعات على الأقل, بعدها حاول مجدداً. ثانيا/ المس حافظة البطارية بيدك, إذا كانت ساخنة فتوقف عن استعمالها مباشرة وحاول إعادة التشغيل بعد ترك ناينبوت في جو بدرجة حرارة غرفة لمدة أربع ساعات على الأقل. ثالثا/ إذا كان الخطأ لا يزال موجوداً, الرجاء التوقف عن استعمال ناينبوت فوراً والاتصال ببائعك أو بمركز صيانة ناينبوت: قد يطلب إليك توصيل جسم سيارة ناينبوت إلى بائعك من أجل الإصلاح. البريد الالكتروني (صيني- انكليزي):service@ninebot.com
fr: 1. Si ce type d’erreur apparait après l’utilisation du Ninebot en dessous d’une température inférieure à 0°C, l’alarme basse température a pu être déclenchée à cause de la température basse extérieure. Placez le Ninebot dans une pièce à température ambiante pendant 8 heures minimum, et essayez de nouveau. 2. Touchez le couvercle de la batterie, s’il est chaud, arrêtez d’utiliser le Ninebot immédiatement, et essayez de rallumer le Ninebot après avoir placé le Ninebot dans une pièce à température ambiante pendant au moins 4 heures. Si l’erreur persiste, contactez votre revendeur ou votre centre de service Ninebot. On pourrait vous demander de ramener votre Ninebot pour un contrôle. E-mail (Chinois/Anglais): service@ninebot.com
ja: 1.-10度未満の環境で保管し発生したエラーです。低温環境で発生した警告です。Ninebotを室温環境（約20度前後）に置き、最短で約8時間後に再起動してください。 2.バッテリーカバーを触り、高温の場合は直ちに使用を中止してください。Ninebotを室温環境（約20度前後）に置き、最短で約4時間後に再起動してください。 エラーが消えない場合は直ちに使用を中止して販売店や代理店サポート部門に連絡してください。電子メール(日本語)：support@e-otomo.co.jp
ko: 1. Ninebot은 영하10도(-10℃)의 기온환경에 보관해 두었을 경우 본 에러가 발생합니다. 환경온도가 낮으면 저온경보를 유발시킬 수 있습니다. Ninebot을 상온환경에 최소 8시간이상 방치한 다음 전원을 킵니다. 2.만일 손으로 배터리커버에 접촉했을 때 뜨거우면 즉시 사용을 중지하십시오. Ninebot을 상온환경에 최소 4시간이상 방치한 다음 전원을 킵니다. 이상 해결 절차로 문제 해결이 안될 경우 제품 구매처 또는 가까운 서비스센터로 연락하세요. 배터리를 구입처 또는 서비스센터에 교부하여 점검을 진행할 필요가 있습니다. 이메일: ninebot@naver.com
zh_hans: 1.如果车辆在零下10摄氏度的温度下存放后使用时出现此错误，可能是因为环境温度过低导致出现低温报警。请将车辆放入室温环境至少8小时后再重新尝试。 2.用手指触摸电池外壳，如果感到烫手，请立即停止使用，将车辆放入室温环境至少4小时之后再尝试重新开机。 如错误仍然存在，请立即停止使用车辆并联系您的销售商或服务中心，可能需将电池组送交您的销售商处检修。电子邮件(中文/英语)：service@ninebot.com

# ErrCodeSug40
source: Ensure that pedal panel is not stamped or pressed when starting up is being done. 2.Check whether pedal panel can bounce normally when feet are not on pedal panel. 3.If it still cannot be solved, please contact your retailer or Ninebot service center; you may be asked to deliver vehicle body of Ninebot to your retailer for overhauling. E-mail (Chinese/English): service@ninebot.com
ar: أولا/ تأكد من أن لوح الدواسة ليس محشوراً أو مضغوطاً عند بدء التشغيل. ثانيا/ تأكد من أن لوح الدواسة يمكن له التوازن بشكل طبيعي عندما لا تكون الأرجل عليه. ثالثا/ إذا كانت المشكلة غير قابلة للحل بعد, الرجاء الاتصال ببائعك أو بمركز صيانة ناينبوت: قد يطلب إليك توصيل جسم سيارة ناينبوت إلى بائعك من أجل الإصلاح. البريد الالكتروني (صيني- انكليزي):service@ninebot.com
fr: Assurez-vous que le plateau des pédales ne soit pas compressé lors du démarrage. 2.Vérifiez que le plateau des pédales peut revenir normalement lorsque les pieds ne sont pas sur le panneau. 3. Si l’erreur persiste, contactez votre revendeur ou votre centre de service Ninebot. On pourrait vous demander de ramener votre Ninebot pour un contrôle. E-mail (Chinois/Anglais): service@ninebot.com
ja: 1.起動時にフットマットを踏んでいないか、押していないかを確認してください。 2.足をフットマットから離した場合、フットマットが正常な位置まで戻るかを確認してください。 3.解決できない場合は販売店や代理店サポート部門に連絡してください。電子メール(日本語)：support@e-otomo.co.jp
ko: 1. 전원을 켰을 때 차체 발판을 밟거나 발판이 눌려있는지 확인합니다. 2. 발이 발판에서 벗어날 경우 발판이 정상적으로 복원 여부를 확인합니다. 3. 이상 해결 절차로 문제 해결이 안될 경우 제품 구매처 또는 가까운 서비스센터로 연락하세요. 본체를 구입처 또는 서비스센터에 교부하여 점검을 진행할 필요가 있습니다. 이메일: ninebot@naver.com
zh_hans: 1.确保开机时，脚踏面板未被踩住或压下。 2.检查脚离开脚踏面板后，脚踏垫是否能够正常弹起。 3.如仍无法解决，请联系您的销售商或服务中心，可能需将车身送交您的销售商处检修。电子邮件(中文/英语)：service@ninebot.com

# ErrCodeSug41_42
source: 1.Ensure that peripheral power dissipation connecting the vehicle is below 8W (5V/1.5A); 2.In case no peripheral power is connected, disconnect the handlebar entirely from vehicle body and restart. In case starting is conducted normally after handlebar is disconnected, it indicates that there is short circuit phenomenon in circuit inside the handlebar. Under the circumstance, you may be asked to deliver upside and downside of the handlebar to your retailer for overhauling; In case the error still exists after the handlebar is disconnected, it indicates that faults exist in vehicle body of Ninebot, and you may be asked to deliver vehicle body of Ninebot to your retailer for overhauling. E-mail (Chinese/English): service@ninebot.com
ar: تأكد من أن تبدد الطاقة المحيطي الواصل للسيارة هو أقل من 8 واط (5 فولت/ 1.5 امبير). ثانيا/ في حال عدم وجود طاقة محيطية متصلة, قم بفصل المقبض نهائياً عن جسم السيارة واعد التشغيل. في حال تم التشغيل بشكل طبيعي بعد فصل المقبض فهذا يعني أن هنالك ماساً في الدارة داخل المقبض. في هذا الظرف, قد يطلب إليك توصيل الجزء العلوي والسفلي من المقبض إلى بائعك من اجل الصيانة. في حال بقي الخطأ بعد فصل المقبض, هذا يعني أن الخطأ موجود في جسم سيارة ناينبوت وقد يطلب إليك توصيل الجسم إلى بائعك من أجل الصيانة. البريد الالكتروني (صيني- انكليزي): service@ninebot.com
fr: 1.Assurez-vous que la puissance de connexion soit en dessous de 8W (5V/1.5A); 2. Dans le cas où il n’y a pas de puissance périphérique connectée, déconnecter le guidon entièrement du véhicule et redémarrer. Dans le cas où le démarrage se passe normalement après que le guidon soit déconnecté, cela indique qu’il y a un phénomène de court-circuit à l’intérieur du guidon. Dans cette circonstance, on pourrait vous demander d’apporter le haut et le bas du guidon à votre revendeur pour un contrôle. Si l’erreur persiste, contactez votre revendeur ou votre centre de service Ninebot. On pourrait vous demander de ramener votre Ninebot pour un contrôle. E-mail (Chinois/Anglais): service@ninebot.com
ja: 1.電力消費が8W以下（5V/1.5A）であることを確認してください。 2.何も接続していない場合は、ステアリングバーを車体から外して本体を起動してください。ステアリングバーを外して起動できた場合は、ステアリングバーの内部回路がショートしている可能性が高く、この場合はステアリングバーとハンドルバーを両方サポート部門に修理を依頼して下さい。ステアリングバーを外しても解決できない場合は、本体が故障している可能性が高いです。サポート部門に修理についてご相談ください。電子メール(日本語)：support@e-otomo.co.jp
ko: 차체에 연결된 외부장치의 전원 소비전력이 8W이하(5V/1.5A)； 2. 만일 어떠한 외부장치도 연결되어 있지 않을 경우 핸들바를 차체부터 분리하여 다시 전원을 킵니다. 핸들바를 분리하여 정상적으로 작동이 안될 경우 핸들바 내부 배선에 접선일 가능성이 있습니다. 이런 경우 핸들바(상,하단 모두포함)를 구입처 또는 서비스센터에 교부하여 점검을 진행할 필요가 있습니다. 만일 핸들바를 분리해도 문제 해결이 안될 경우 본체 내부에 고장일 가능성이 있습니다. 본체를 구입처 또는 서비스센터에 교부하여 점검을 진행할 필요가 있습니다. 이메일: ninebot@naver.com
zh_hans: 1.确保车辆所连接的供电外设功耗在8W以下（5V/1.5A）； 2.若未连接任何外设，则将手把整体从车体上拔下后再次开机。若拔下手把后开机正常，则说明手把内部线路有短路现象，这种情况下需将手把上段及下段均送交您的销售商处检修；若拔下手把后此错误仍然存在，则说明车体内有故障，需将车体送交您的销售商处检修。电子邮件(中文/英语)：service@ninebot.com

# ErrCodeSug43
source: 1.Please remove charger from AC socket and Ninebot, and replug. If the error still exists, maybe there is something wrong with the charger, and you need to deliver the charger to your retailer for overhauling or ask to exchange for a new charger. 2.In case the error still exists when charging with the new charger, it indicates that something is wrong inside the vehicle body. Please deliver the vehicle body of Ninebot to your retailer for overhauling. E-mail (Chinese/English): service@ninebot.com
ar: أولا/ الرجاء إزالة الشاحن من مأخذ الكهرباء ومن ناينبوت ومن ثم إعادة التوصيل. إذا كان الخطأ لا يزال موجوداً فقد يكون هناك خطأ ما بالشاحن, وعندها تحتاج لتوصيل الشاحن إلى بائعك للصيانة أو أن تطلب دفع الفرق للحصول على شاحن جديد. ثانيا/ في حال ما زال الخطأ موجوداً أثناء الشحن باستخدام الشاحن الجديد, هذا يشير أن هنالك خطأ ما في جسم السيارة. الرجاء توصيل جسم سيارة ناينبوت إلى بائعك للصيانة البريد الالكتروني (صيني- انكليزي): service@ninebot.com
fr: 1.Retire le chargeur de l’emplacement AC et du Ninebot et rebranchez le. Si l’erreur persiste, il y a peut-être un problème avec le chargeur, et vous devrez apporter le chargeur à votre revendeur pour un contrôle, ou demander un échange de chargeur. 2. si l’erreur persiste, contactez votre revendeur ou votre centre de service Ninebot. On pourrait vous demander de ramener votre Ninebot pour un contrôle. E-mail (Chinois/Anglais): service@ninebot.com
ja: 1.充電器のソケットと本体から外し、もう一度接続してください。解決できない場合は、充電器が故障している可能性があります。サポート部門に修理についてご相談ください。 2.新品の充電器を交換しても解決できない場合は、本体が故障している可能性が高いです。サポート部門に修理についてご相談ください。電子メール(日本語)：support@e-otomo.co.jp
ko: 1. 충전기의 콘센트, 본체 연결을 모두 분리한 후 다시 연결합니다. 이상 해결 절차로 문제 해결이 안될 경우 충전기를 구입처 또는 서비스센터에 교부하여 점검을 진행할 필요가 있습니다. 2. 만일 충전기를 교체하여 문제 해결이 안될 경우 본체 내부에 고장일 가능성이 있습니다. 본체를 구입처 또는 서비스센터에 교부하여 점검을 진행할 필요가 있습니다. 이메일: ninebot@naver.com
zh_hans: 1.请将充电器从交流插座和车辆上拔除，再重新插上。如果此错误仍然存在，则可能充电器有故障，需将充电器送交您的销售商处检修或要求更换新的充电器。 2.如果更换新的充电器充电时仍出现此错误，则说明车体内部有故障。请将车体送交您的销售商处检修。电子邮件(中文/英语)：service@ninebot.com

# ErrCodeSug44
source: Normally, the error will not occur. In case the error appears, please deliver the vehicle body of Ninebot to your retailer for overhauling. E-mail (Chinese/English): service@ninebot.com
ar: بشكل طبيعي, لن يظهر الخطأ. في حال ظهر الخطأ, الرجاء توصيل جسم سيارة ناينبوت إلى بائعك للصيانة البريد الالكتروني (صيني- انكليزي): service@ninebot.com
fr: Normalement, l’erreur ne devrait plus apparaître. Si l’erreur persiste, contactez votre revendeur ou votre centre de service Ninebot. On pourrait vous demander de ramener votre Ninebot pour un contrôle. E-mail (Chinois/Anglais): service@ninebot.com
ja: 通常ではこのエラーは発生しません。エラーが発生した場合は、サポート部門にご相談ください。電子メール(日本語)：support@e-otomo.co.jp
ko: 본 에러코드는 정상적인 사용으로 인해 나타나는 에러현상이 아닙니다. 본 에러가 발생할 경우 사용을 즉시 중단하여 구입처 또는 서비스센터에 교부하여 점검을 진행할 필요가 있습니다. 이메일: ninebot@naver.com
zh_hans: 正常情况下不会出现此错误。如果出现此错误，请将车体送交您的销售商处检修。电子邮件(中文/英语)：service@ninebot.com
