Repository: sxm5220/sxm-ios
Catalog: Ninebot/*.lproj/Localizable.strings
Languages: ar, fr, ja, ko, zh_hans

# s_updateSuccess
source: The firmware update is successful!
ar: تحديث البرامج الثابتة تم بنجاح!
fr: Succès de la mise à jour du logiciel.
ja: ファームウェアアップデート完了。
ko: 펌웨어 업그레이드 성공!
zh_hans: 固件升级成功！

# s_is_up2
source: A newer version of firmware is available, do you want to update?
ar: الكشف عن نسخة جديدة من البرامج الثابتة, لتتم الترقية أو لا؟
fr: Une version du logiciel plus récente est disponible, souhaitez-vous installer la mise à jour ?
ja: 新しいバージョンのファームウェアがあります。アップデートしますか?
ko: 새로운 펌웨어 버전이 있습니다. 업그레이드 하시겠습니까?
zh_hans: 检测到新版本固件，是否要升级?

# s_progress
source: Completed
ar: تم
fr: Complétez
ja: 完成！
ko: 완료
zh_hans: 已完成

# ShareType
source: share
ar: مشاركة
fr: Partagez
ja: シェア
zh_hans: 分享

# ShareType_1
source: Sina Weibo
ar: ساينا ويبو
ja: Sinaブログ
zh_hans: 新浪微博

# ShareType_2
source: Tencent Weibo
ar: تينسينت ويبو
ja: Tencentブログ
zh_hans: 腾讯微博

# ShareType_5
source: Douban
ar: دوبان
ja: 豆瓣
zh_hans: 豆瓣

# ShareType_6
source: QZone
ar: كيوزون
ja: Qゾーン
zh_hans: QQ空间

# ShareType_7
source: Renren
ar: رينرين
ja: 人人網
zh_hans: 人人网

# ShareType_8
source: Kaixin
ar: كايكسن
ja: 開心網
zh_hans: 开心网

# ShareType_9
source: Pengyou
ar: بينغيو
ja: 朋友網
zh_hans: 朋友网

# ShareType_12
source: Evernote
ar: إيفرنوت
ja: 印象筆記
zh_hans: 印象笔记

# ShareType_18
source: Mail
ar: بريد
ja: メール
zh_hans: 邮件

# ShareType_19
source: SMS
ar: رسالة نصية
ja: ショートメール
zh_hans: 短信

# ShareType_20
source: Print
ar: طباعة
fr: Imprimez
ja: 印刷
zh_hans: 打印

# ShareType_21
source: Copy
ar: نسخ
fr: Copiez
ja: コピー
zh_hans: 拷贝

# ShareType_22
source: Wechat contacts
ar: قائمة اتصال ويتشات
fr: Contacts Wechat
ja: Wechat友達
zh_hans: 微信好友

# ShareType_23
source: Wechat moments
ar: لحظات ويتشات
fr: Moments Wechat
ja: Wechat友達ゾーン
zh_hans: 微信朋友圈

# ShareType_27
source: YouDao Notes
ar: ملاحظات يوداو
ja: 有道云筆記
zh_hans: 有道云笔记

# ShareType_28
source: Soho Kan
ar: سوهو كان
ja: SOHU随身看
zh_hans: 搜狐随身看

# ShareType_37
source: Wechat Favorites
ar: مفضلة ويتشات
ja: Wechatお気に入り
zh_hans: 微信收藏

# ShareType_38
source: Yixin Contacts
ar: قائمة اتصال يكسين
ja: 易信友達
zh_hans: 易信好友

# ShareType_39
source: Yixin moments
ar: لحظات يكسين
ja: 易信友達ゾーン
zh_hans: 易信朋友圈

# ShareType_41
source: Mingdao
ar: مينغداو
ja: 明道
zh_hans: 明道

# certification_release
source: Release
ar: حرر
fr: Soumettre
ja: 認証解除
ko: 인증 해제
zh_hans: 解除认证

# certification_verification
source: Verification Code:
ar: رمز التفعيل:
fr: Code de vérification :
ja: 認証コード
ko: 인증번호
zh_hans: 验证码

# certification_verify_tip
source: Verification code has sent you mobile phone or email, please check in time.
ar: أرسل إليك رمز التفعيل اتصالاً هاتفياً أو بريداً الكترونياً, الرجاء التفقد.
fr: Le code de vérification vous a été envoyé par SMS ou email. Veuillez vérifier.
ja: 認証するための確認コードを登録したアドレス/番号に送信しました。ご確認ください。
ko: 당신이 인증을 작성 할 때 인증 코드가 전화 번호 또는 이메일을 보냈습니다, 참조하시기 바랍니다
zh_hans: 验证码已发送到您的手机或邮箱中，请及时查看

# certification_release_submit
source: Release
ar: حرر
fr: Soumettre
ja: 解除確認
ko: 해제 확인
zh_hans: 确认解除

# certification_invalid_sn
source: Serial No. is empty
ar: الرقم التسلسلي فارغ
fr: Le numéro de série est vide
ja: シリアルナンバーの入力に空欄は不可です。
ko: 시리얼 번호가 비어있습니다.
zh_hans: 序列号为空

# certification_prompt_release_success
source: Release is successful!
ar: تم التحرير بنجاح!
fr: Succès de la soumission
ja: 解除完了。
ko: 해제 성공！
zh_hans: 解除成功！

# certification_error_release_failed
source: Release fails!
ar: فشل التحرير!
fr: Echec de la soumission
ja: 解除失敗。
ko: 해제 실패！
zh_hans: 解除失败！

# certification_params_valid
source: Correctly fill in one of the mobile phone and email
ar: املأ بشكل صحيح واحداً من أرقام الهاتف الجوال والبريد الالكتروني
fr: Remplissez correctement votre numéro de téléphone portable et votre email.
ja: 携帯番号とメールアドレスのどちらか一つを正しく入力してください。
ko: 올바른 휴대폰이나 이메일 주소를 입력하십시오.
zh_hans: 请正确填写手机号码或邮箱其中一项

# list_single_mileage
source: Mileage(Current ride)
ar: مسافة أحادية
fr: Kilométrage
ja: 区間走行距離
ko: 이번 주행거리
zh_hans: 本次行驶里程

# s_togq
source: Login information is outdated, you need to login again.
ar: معلومات تسجيل الدخول منتهية الصلاحية, عليك إعادة الدخول ثانية
fr: Vous avez été déconnecté. Veuillez-vous reconnecter.
ja: AccessTocken期限切れ、もう一度ログインしてください。
zh_hans: AccessTocken过期，请重新登录！

# s_zg
source: You have liked!
ar: أعجبك!
fr: Vous avez aimé!
ko: 이미 추천했습니다！
zh_hans: 您已赞过，不能重复点赞

# s_Succcess
source: share successful!
ar: تمت المشاركة بنجاح!
fr: Partagé avec succès
ja: シェア完了。
zh_hans: 分享成功！

# s_Fail
source: share fail!
ar: فشلت المشاركة!
fr: Echec du partage
ja: シェア失敗。
zh_hans: 分享失败！

# s_haslogin
source: Login information is outdated, you need to login again.
ar: معلومات تسجيل الدخول منتهية الصلاحية, عليك إعادة الدخول ثانية
fr: Vous avez été déconnecté. Veuillez-vous reconnecter.
ja: 現在のアカウントは他のデバイスにログイン中です。もう一度ログインしてください。
ko: 로그인이 기한이 만료되었습니다. 다시 로그인 하세요
zh_hans: 检测到您的帐号在其他设备登录，请重新登录！

# lModifyUserName
source: Modify Ninebot Username
ar: حدد اسم المستخدم في ناينبوت
fr: Modifier le nom d’utilisateur Ninebot
ja: Ninebotユーザー名変更
zh_hans: 修改Ninebot用户名

# s_modifyPwd
source: Set Ninebot Login Password
ar: شاهد كلمة سر تسجيل الدخول في ناينبوت
fr: Créer un mot de passe Ninebot
ja: Ninebotログインパスワード設定
zh_hans: 设置Ninebot登录密码

# lComplete
source: Perfect Ninebot Account
ar: حساب ناينبوت رائع
fr: Compte Ninebot parfait
ja: アカウント情報追加
ko: 완벽 계정
zh_hans: 完善账号

# activate_guide_warn
source: This vehicle is not activated. Please follow the activation procedure.
ar: المركبة غير مفعلة, الرجاء تفعيل المركبة بحسب ما في صفحة الدليل, وإلا ستكون المركبة في وضعية السرعة المحددة الآمنة
fr: Ce véhicule n’est pas activé. Suivez la procédure d’activation, sinon le minoPRO restera en mode limite de vitesse.
ja: 使用中の車両は本登録されていません。画面のガイド案内に沿って本登録をしてください。本登録を完了させないと車両はスピード制限され、正常に使用できません。
ko: 활성화된 차체가 아닙니다. 연결 페이지에 따라 활성화 하세요. 활성화 하지 않으면 안전 시속 제한을 해제할 수 없습니다
zh_hans: 该车辆为未激活的新车，请按照引导页面激活车辆，否则车辆将一直处于安全限速模式！

# accout_skip
source: skip
ar: تجاوز
fr: Passer
ja: スキップ
zh_hans: 跳过

# s_electricity
source: Battery Information
ar: معلومات البطارية
fr: Information de la batterie
ja: バッテリー情報
ko: 배터리정보
zh_hans: 电池信息

# s_percentage
source: Remaining Battery Percentage
ar: النسبة المتبقية
fr: Pourcentage de batterie restante
ja: バッテリー残量パーセンテージ
ko: 배터리잔량%
zh_hans: 剩余百分比

# s_batterystatus
source: Battery Status
ar: حالة البطارية
fr: Statut de la batterie
ja: バッテリー状況
ko: 배터리상태
zh_hans: 电池状态

# s_voltage
source: Voltage
ar: الجهد الكهربائي
fr: Tension électrique (Volts)
ja: 電圧
ko: 전압
zh_hans: 电压

# s_current
source: Current
ar: الحالي
fr: Intensité électrique (Ampères)
ja: 電流
ko: 전류
zh_hans: 电流

# s_power
source: Power
ar: الطاقة
fr: Puissance électrique (Watts)
ja: 消費電力
ko: 출력
zh_hans: 功率

# s_b1t
source: Battery Temperature
ar: حرارة البطارية
fr: Température de la batterie
ja: バッテリー温度
ko: 배터리1온도
zh_hans: 电池温度

# s_cri
source: Cycling Period
ar: فترة ركوب الدراجة
fr: Nombre de recharges complètes
ja: バッテリー循環周期
ko: 사이클
zh_hans: 循环周期

# s_btimes
source: Times Charged
ar: فترات الشحن
fr: Nombre de recharges partielles
ja: 充電回数
ko: 충전횟수
zh_hans: 充电次数

# s_pro
source: Manufacturer
ar: تصنيع
fr: Fabrication
ja: 製造業者
ko: 제조사
zh_hans: 生产商

# s_protime
source: Production Date
ar: تاريخ الإنتاج
fr: Date de production
ja: 生産日付
ko: 생산날짜
zh_hans: 生产日期

# s_actime
source: Activation date
ar: تاريخ التفعيل
fr: Date d’activation
ja: 本登録日付
ko: 활성화날짜
zh_hans: 激活日期

# s_bnumber
source: Battery Serial No.
ar: الرقم التسلسلي للبطارية
fr: Numéro de série de la batterie
ja: バッテリーシリアルナンバー
ko: 배터리 시리얼넘버
zh_hans: 电池序列号

# s_cap
source: Total Capacity
ar: طاقة التصميم
fr: Capacité totale
ja: 標準容量
ko: 설계 용량
zh_hans: 设计容量

# s_b_voltage
source: Voltage of Battery Cell
ar: الجهد الكهربي لخلية البطارية
fr: Voltage de la batterie
ja: コア電圧
ko: 배터리 셀 전압
zh_hans: 电芯电压

# info_device_battery_mini_status_1
source: Excellent
ar: ممتاز
fr: Excellente
ja: 優秀
ko: 우수
zh_hans: 优秀

# info_device_battery_mini_status_2
source: Fine
ar: جيد
fr: Bonne
ja: 良好
ko: 양호
zh_hans: 良好

# info_device_battery_mini_status_3
source: Medium
ar: وسط
fr: Moyenne
ja: 普通
ko: 보통
zh_hans: 中等

# info_device_battery_mini_status_4
source: Bad
ar: سيء
fr: Mauvaise
ja: やや悪い
ko: 미흡
zh_hans: 较差

# info_device_battery_mini_cell
source: Battery Cell
ar: خلية البطارية
fr: Cellule de la batterie
ja: コアパック
ko: 배터리 셀
zh_hans: 电芯组

# lSetUserNameTip
source: Please complete username, and set up the password. After setting finished, this username and password can login App. Notice: username can only be revised once, and be cautious to your email since it will be used to find password.
ar: الرجاء إتمام اسم المستخدم وإعداد كلمة المرور. بعد الانتهاء من هذه الإعدادات يمكن لهذا المستخدم ولكلمة المرور هذه الدخول إلى التطبيق. ملاحظة: يمكن تنقيح اسم المستخدم لمرة واحدة فقط ويتم إرسال تحذير إلى بريدك الالكتروني كونها سوف تستخدم للعثور على كلمة المرور.
fr: Complétez votre nom d’utilisateur, et mettez en place un mot de passe. Lorsque le paramétrage est fini, vous pourrez vous connecter avec ce nom d’utilisateur et ce mot de passe. Note : le nom d’utilisateur peut être modifié une seule fois, et renseignez bien votre adresse email, c’est celle qui va permettre de retrouver votre mot de passe.
ja: Ninebotユーザー情報の内容を追加し、パスワードを設定してください。設定完了後Appにログイン可能です。ユーザー名は1回のみ変更可能です。メールアドレスはパスワードを忘れた際に使用するので、慎重に入力してください。
ko: Ninebot 아이디를 입력하시고 비밀번호를 설정하세요. 설정 후 앱 로그인을 할 수 있습니다. 아이디는 한번만 수정이 가능하며, 이메일 주소는 비밀번호 찾기를 할 수 있습니다.
zh_hans: 请完善Ninebot用户名，并设置密码，设置完成后该账户密码可登录App。请注意，用户名只允许修改一次，邮箱用于找回密码，请谨慎填写。

# s_ridfeel
source: Riding Feeling Setting
ar: إعدادات الشعور أثناء القيادة
fr: Paramétrages de conduite
ja: 乗車体感設定
ko: 탑승감 설정
zh_hans: 骑行体感设置

# lVerAlready
source: Serial No. has been verified already!
ar: تم مسبقاً التحقق من الرقم التسلسلي!
fr: Le numéro de série a déjà été vérifié!
ja: 車両シリアルナンバーは認証済みです。
ko: 이미 인증한 번호입니다!
zh_hans: 车架号已经认证过！

# lVerNumFalse
source: Incorrect Serial No
ar: رقم تسلسلي خاطئ
fr: Numéro de série incorrect
ja: 車両シリアルナンバーの形式が正しくありません。
ko: 잘못된 인증번호입니다.
zh_hans: 车架号格式不正确

# lVerFail
source: Verify failed. Please try again!
ar: فشل التحقق, الرجاء المحاولة ثانية!
fr: Echec de la vérification, essayez encore.
ja: 認証失敗。もう一度操作してください
ko: 인증실패. 재시도 하세요
zh_hans: 认证失败！请重试

# s_connBLE
source: Bluetooth is disconnected!
ar: البلوتوث غير متصل, الاتصال ثانية؟
fr: La fonction Bluetooth est déconnectée!
ja: ブルートゥース接続は切断されました。
ko: 블루투스 연결이 끊겼습니다.초보자 가이드를 진행할 수 없습니다！
zh_hans: 蓝牙连接已断开！

# lBugFeedFail
source: Feedback or screenshots cannot be null at the same time
ar: لا يمكن للتغذية الإرجاعية أو اللقطات أن تكون فارغة في نفس الوقت.
fr: Les retours ou les copies d’écran ne peuvent pas être vides en même temps
ja: 問題内容の記述、もしくはスクリーンショットの添付の空欄は不可です。
ko: 패드백 내용의 설명이나 참고 이미지를 입력하세요
zh_hans: 反馈内容或截图不能全为空

# lFeedbackSortFail
source: Classification list requesting failure, please try again later
ar: فشل في طلب قائمة التصنيف, الرجاء المحاولة لاحقاً
fr: La requête de la liste de classification a échouée, essayez plus tard.
ja: 問題の分類の取得に失敗しました。もう一度操作してください。
ko: 문제 분류 접속에 실패되었습니다. 잠시후 다시 접속하세요.
zh_hans: 获取问题分类失败，请稍后重试

# s_innerVerson
source: Alpha testing V
ar: Vاختبار ألفا
fr: Test Alpha V
ja: 内部テストバージョン V
ko: 클로즈베타 버전 V
zh_hans: 内测版本 V

# lBugFeedback
source: Question feedback
ar: ردود فعل حول سؤال
fr: Posez une question
ja: 問題提出
ko: 문제 피드백 보내기
zh_hans: 问题反馈

# lBugDescrption
source: Descrption
ar: وصف
fr: Description
ja: 問題記述
ko: 문제 설명
zh_hans: 问题描述

# lBugPicture
source: Images
ar: صور
ja: 画像アップロード
ko: 사진 업로드
zh_hans: 上传图片

# lBugKindSelect
source: question type
ar: نوعية السؤال
fr: Type de question
ja: 問題の分類を選択してください。
ko: 문제 종류를 선택하세요
zh_hans: 请选择问题分类

# lBugKind
source: Category
ar: نوع
fr: Catégorie
ja: 問題分類
ko: 문제 분류
zh_hans: 问题分类

# lFeedbackFinish
source: Your question has been successfully feedback.Thank you for your participation and we will deal with it as soon as possible!
ar: تم تسجيل سؤالك في ردود الفعل. شكراً لمشاركتك وسوف نعالج المسالة بالسرعة الممكنة!
fr: Votre question a été soumise. Merci pour votre participation, nous allons la traiter très prochainement.
ja: 問題提出完了しました。ありがとうございます。迅速に処理します。
ko: 귀하의 피드백 내역이 성공적으로 전달되었습니다. 감사드립니다.
zh_hans: 您的问题已经成功反馈，感谢您的参与，我们会尽快处理！

# nb_RidSetting
source: Riding Settings
ar: إعدادات القيادة
fr: Paramétrages de conduite
ja: 乗車設定
ko: 주행 설정
zh_hans: 骑行设置

# s_totalrun
source: Total Mileage
ar: إجمالي المسافة
fr: Kilométrage total
ja: 合計 走行
ko: 총 주행거리
zh_hans: 总共 行驶

# lActiveMachinFirst
source: The function can’t be used until the vehicle authenticated by you
ar: لا يمكن استخدام هذه الوظيفة ما لم يتم التصديق على المركبة من قبلك
fr: Cette fonction ne peut pas être utilisée tant que vous n’avez pas authentifié le véhicule.
ja: 車両本登録をしてください。
ko: 먼저 활성화 하세요
zh_hans: 请先激活车

# lSaveImg
source: Save to the photo album
ar: حفظ في البوم الصور
fr: Sauvegarder dans l’album photo
ja: カメラロールに保存
ko: 앨범에 저장
zh_hans: 保存到相册

# yAlertTime
source: Please select purchasing time
ar: الرجاء اختيار وقت الشراء
fr: Sélectionnez une heure d’achat.
ja: 購入時間を選択してください
ko: 구매 날짜를 선택하세요
zh_hans: 请选择购买时间

# s_warning
source: Detect a new version of firmware, whether to upgrade?
ar: الكشف عن نسخة جديدة من البرامج الثابتة, لتتم الترقية أو لا؟
fr: Détection d’une nouvelle version du logiciel, souhaitez-vous faire la mise à jour ?
ja: 新しいバージョンのファームウェアがあります。アップデートしますか?
ko: 펌웨어를 최신업데이트 이전의 정식 버전으로 다운그레이드 하시겠습니까?
zh_hans: 检测到新版本固件，是否要升级？

# yNewyet
source: The current version has been the latest!
ar: النسخة الحالية هي الأحدث!
fr: Le version actuelle est la dernière version disponible
ja: 現在のバージョンは最新です
ko: 현재 최신 버전입니다.
zh_hans: 当前版本已经是最新版本

# yOldyet
source: New version is available, whether or not to update?
ar: تتوفر نسخة جديدة, لتتم الترقية أو لا؟
fr: Détection d’une nouvelle version du logiciel, souhaitez-vous faire la mise à jour ?
ja: 新しいバージョンのファームウェアがあります。アップデートしますか?
ko: 새로운 버전이 있습니다. 업데이트 하시겠습니까?
zh_hans: 检测到有新版本，是否更新?

# yGodown
source: To update
ar: تحديث
fr: Mise à jour
ja: アップデートします。
ko: 업데이트
zh_hans: 去更新

# s_down_pull
source: Pull down to refresh
ar: اسحب للتحديث
fr: Descendez pour rafraîchir
ja: ドラッグして最新の情報へ更新
ko: 아래로 밀어 새로고침
zh_hans: 下拉刷新

# s_refresh
source: Loosen to immediately refresh
ar: خفف للتحديث فوراً
fr: Tirez vers le bas pour rafraîchir
ja: リリースしてデータ更新
ko: 터치하여 새로고침
zh_hans: 松开立即刷新

# s_refreshing
source: In the process of refresh data
ar: في طور تحديث البيانات
fr: En cours de rafraîchissement
ja: データを最新情報に更新中...
ko: 업데이트중...
zh_hans: 正在刷新数据中...

# s_loadMore
source: Click to load more
ar: اضغط لتحميل أكثر
fr: Cliquez pour charger plus
ja: クリックしてもっと情報を得る
ko: 클릭하여 추가 정보 확인
zh_hans: 点击加载更多

# s_loadingMore
source: In process of loading more data
ar: في طور تحميل بيانات أكثر
fr: En cours de chargement
ja: もっと新しい情報をローディング中...
ko: 추가 데이터 로딩중...
zh_hans: 正在加载更多的数据...

# s_loadOver
source: Has been completed all loading
ar: تم استكمال تحميل الكل
fr: Chargement complet
ja: ローディング完了
ko: 로딩 완료
zh_hans: 已经全部加载完毕

# s_last_time
source: Last update
ar: آخر تحديث
fr: Dernière mise à jour
ja: 最後のアップデート:
ko: 최종 업데이트:
zh_hans: 最后更新:

# s_have_no
source: No records
ar: لا سجلات
fr: Pas d’enregistrement
ja: 履歴なし
ko: 데이터 없음
zh_hans: 无记录

# s_today
source: Today
ar: اليوم
fr: Aujourd’hui
ja: 今日
ko: 오늘
zh_hans: 今天

# lUserNameNoNill
source: Username shall not be empty!
ar: لا يجب أن يكون اسم المستخدم فارغاً!
fr: Le nom d’utilisateur ne devrait pas être vide.
ja: ユーザー名の入力に空欄は不可です。
ko: 아이디를 입력하세요.
zh_hans: 用户名不能为空！

# lUserPwdNoNill
source: The password shall not be empty!
ar: كلمة المرور لا يجب أن تكون فارغة!
fr: Le mot de passe ne devrait pas être vide
ja: パスワードの入力に空欄は不可です。
ko: 비밀번호를 입력하세요.
zh_hans: 密码不能为空！

# lLogin
source: Login
ar: تسجيل الدخول
fr: Connexion
ja: ログイン
ko: 로그인
zh_hans: 登录

# lMobileLogin
source: Mobile phone number for register/login
ar: رقم الهاتف الجوال للتسجيل/ الدخول
fr: Numéro de portable pour s’enregistrer/se connecter.
ja: 携帯アカウント簡単登録/ログイン
ko: 휴대폰 번호 간편가입/로그인
zh_hans: 手机号快速注册/登录

# lXiaoMiLogin
source: Log in with MIUI account
ar: MIUIالدخول بحساب
fr: Se connecter avec un compte MIUI
ja: シオーミーアカウントログイン
ko: 샤오미 아이디 로그인
zh_hans: 小米账号登录

# lLoding
source: Logging in ...
ar: تسجيل الدخول ...
fr: Connecté en ...
ja: ログイン中...
ko: 로그인 중…
zh_hans: 正在登录...

# lUserStateLogin
source: The user has already logged in
ar: المستخدم سجل دخوله مسبقاً
fr: L’utilisateur est déjà connecté
ja: ユーザー名はログイン状態です
ko: 이미 로그인한 아이디입니다.
zh_hans: 该用户已经是登录状态

# lUserNoActive
source: Your account is not activated, please activate it firstly
ar: حسابك غير مفعل, الرجاء تفعيله أولاً
fr: Votre compte n’est pas activité. Activez-le en premier.
ja: アカウントは本登録を完了されていません。本登録を完了させてください。
ko: 아이디를 활성화 해주세요. 비활성화 상태입니다.
zh_hans: 您的帐号处于未激活状态，请先激活

# lUserLoginAgain
source: Login fails, please try again!
ar: فشل تسجيل الدخول, الرجاء المحاولة ثانية!
fr: Echec de la connexion, essayez encore
ja: ログイン失敗しました。もう一度操作してください
ko: 로그인에 실패하였습니다.
zh_hans: 登录失败，请重试

# lUserPwdFail
source: The password is incorrect, please try again
ar: كلمة المرور خاطئة’ الرجاء المحاولة ثانية!
fr: Le mot de passe est incorrect, essayez encore
ja: パスワードが間違っています。もう一度操作してください。
ko: 비밀번호를 잘못 입력했습니다.
zh_hans: 密码错误，请重试

# lPutUserName
source: Please input username
ar: ادخل العنوان البريدي/ اسم المستخدم
fr: Renseignez le nom d’utilisateur
ja: ユーザー名を入力してください。
ko: 사용자 이름을 입력하십시오.
zh_hans: 请输入用户名

# lPutPwd
source: Please input account password
ar: ادخل كلمة مرور الحساب
fr: Renseignez le mot de passe
ja: アカウントパスワードを入力してください。
ko: 비밀번호를 입력하세요
zh_hans: 请输入您的帐号密码

# lUserRegister
source: Register account
ar: التسجيل
fr: Enregistrez le compte
ja: ログイン
ko: 가입
zh_hans: 注册

# lPutPhoneNum
source: Input your phone number
ar: أدخل رقم هاتفك
fr: Renseignez votre numéro de téléphone
ja: 携帯番号を入力してください。
ko: 전화번호를 입력해주세요.
zh_hans: 请输入手机号

# lPutCountPwd
source: Input your verification code
ar: أدخل كلمة مرور حسابك
fr: Renseignez votre code de vérification
ja: 認証コードを入力してください。
ko: 비밀번호를 입력해주세요.
zh_hans: 请输入验证码

# lGetAuthCode
source: Get code
ar: احصل على رمز التحقق
fr: Recevoir le code de vérification
ja: 認証コードを取得
ko: 인증 번호 받기
zh_hans: 获取验证码

# lAuthCode
source: Verification
ar: تفعيل
fr: Vérification
ja: 認証
ko: 인증
zh_hans: 验证

# lPostCode
source: A text message will be sent to you to activate your account, and the fee is charged by the operator
ar: سيتم إرسال رسالة نصية لتفعيل حسابك, والرسوم على نفقة المشغل
fr: un message va vous être envoyé pour activer votre compte.
ja: アカウントの本登録はSMSメールを送信する必要があります。SMSの通信料は発生しますのでご注意ください。
ko: 계정활성화 시 문자메시지가 발송됩니다. 통신비는 통신사로부터 청구됩니다
zh_hans: 激活账号会发送一条短信，资费由运营商收取

# lPutRightPhoneCode
source: Please input correct phone number!
ar: الرجاء إدخال رقم هاتف صحيح
fr: Renseignez le numéro de téléphone correct.
ja: 正しい携帯電話の番号を入力してください。
ko: 올바른 번호를 입력해주세요.
zh_hans: 请输入正确的手机号码！

# lGetAuthCodeFail
source: Getting verification code fails; please send it again
ar: فشل الحصول على رمز التفعيل, الرجاء إرساله ثانية
fr: Echec de la vérification, renvoyez-le.
ja: 認証コード取得に失敗しました。もう一度送信してください
ko: 인증번호 전송이 실패했습니다. 인증번호를 다시 받아주시기 바랍니다.
zh_hans: 获取验证码失败，请重新发送

# lGetAuthCodelimit
source: You can get not more than 5 pieces of verification code every day!
ar: لا يمكن الحصول على أكثر من خمسة رموز تفعيل كل يوم
fr: Vous ne pouvez pas recevoir plus de 5 codes de vérification par jour!
ja: 認証コードの取得は1日5回までです。
ko: 하루 최대 5회 인증번호를 받을 수 있습니다!
zh_hans: 每天最多可以获取5次验证码！

# lAuthCodeNoNill
source: Verification code shall not be empty!
ar: يجب أن لا يكون رمز التفعيل فارغاً!
fr: Le code de vérification ne peut pas être vide.
ja: 認証コードの入力に空欄は使用できません。
ko: 인증번호를 입력해주세요.
zh_hans: 验证码不能为空！

# lAuthCodeFail
source: Verification code is incorrect!
ar: رمز التفعيل خاطئ!
fr: Le code de vérification et incorrect
ja: 認証コードが間違っています。
ko: 인증번호를 잘못 입력하셨습니다.
zh_hans: 验证码错误！

# lPostLater
source: Resend
ar: إعادة الإرسال
fr: Renvoyez
ja: もう一度送信
ko: 잠시 후 다시 발송합니다.
zh_hans: 后重发

# lAuthFail
source: Verification fails!
ar: فشل التفعيل
fr: Echec de la vérification!
ja: 認証失敗
ko: 인증 실패
zh_hans: 验证失败！

# lSaveAction
source: Save
ar: حفظ
fr: Sauvegarder
ja: 保存
ko: 저장
zh_hans: 保存

# lNoNilNick
source: Nickname shall not be empty!
ar: يجب أن لا يكون حقل الكنية فارغاً
fr: Le nom d’utilisateur ne peut pas être vide
ja: ニックネームの入力に空欄は使用できません。
ko: 닉네임을 입력하세요.
zh_hans: 昵称不能为空！

# lNoNilSign
source: Signature shall not be empty!
ar: يجب أن لا يكون حقل التوقيع فارغاً
fr: La signature ne peut pas être vide
ja: ムードメッセージの入力に空欄は使用できません。
ko: 상태 메시지를 입력하세요.
zh_hans: 签名不能为空！

# lDoneAction
source: Finish
ar: انتهاء
fr: Finir
ja: 完成
ko: 완성되었습니다.
zh_hans: 完成

# lNickName
source: Username:
ar: اسم المستخدم:
fr: Nom d’utilisateur:
ja: ユーザー名:
ko: 아이디:
zh_hans: 用户名:

# lOldPwd
source: Original
ar: أصلي
ja: 元のパスワード
ko: 기존 비밀번호
zh_hans: 原密码

# lNewPwd
source: Password:
ar: كلمة المرور:
fr: Mot de passe:
ja: パスワード:
ko: 신규 비밀번호:
zh_hans: 密码:

# lNewPwd2
source: Confirm:
ar: التأكيد:
fr: Confirmer:
ja: パスワード確認:
ko: 비밀번호 재입력:
zh_hans: 确认密码:

# lEmailAdd
source: Mailbox:
ar: البريد:
fr: Email:
ja: メールアドレス:
ko: 이메일:
zh_hans: 邮箱:

# lNoEqulPwd
source: Twice passwords are inconsistent
ar: كلمات المرور غير منسجمة لمرتين!
fr: Les 2 mots de passe ne correspondent pas
ja: 2回入力したパスワードは一致していません。
ko: 비밀번호가 다릅니다!
zh_hans: 两次密码不一致！

# lOldPwdNil
source: The original password shall not be empty!
ar: يجب أن لا تكون كلمة المرور الأصلية فارغة!
fr: Le mot de passe original ne peut pas être vide
ja: 旧パスワードの入力に空欄は使用できません。
ko: 기존 비밀번호를 입력하세요!
zh_hans: 旧密码不能为空！

# lModifyDone
source: Modification succeeds!
ar: نجح التعديل!
fr: Succès de la modification
ja: 変更完了
ko: 비밀벌호 변경에 성공하였습니다.
zh_hans: 修改成功！

# lPwdLessSix
source: Password less than 6 digits is not allowed!
ar: كلمة المرور التي تقل عن 6 خانات غير مسموحة!
fr: Le mot de passe doit comprendre au moins 6 caractères
ja: パスワード6文字未満の入力は使用できません。
ko: 6자 이상의 숫자,영문 대소문자
zh_hans: 密码不能少于六位！

# lNoRightUserName
source: Username shall not include’_’
ar: ’_’يجب أن لا يحتوي اسم المستخدم على
fr: Le nom d’utilisateur ne doit pas comprendre’_’
ja: ユーザー名に‘_’の使用は使用できません
ko: ‘_’ 사용불가
zh_hans: 用户名不能包含‘_’

# lNoNilEmail
source: The mailbox shall not be empty!
ar: يجب أن لا يكون حقل البريد فارغاً!
fr: L’email ne peut pas être vide
ja: メールアドレスの入力に空欄は使用できません。
ko: 이메일은 필수입력 사항입니다..
zh_hans: 邮箱不能为空！

# lFinishZiLiao
source: Succeed in completing the data!
ar: النجاح في استكمال البيانات!
fr: Succès de la mise à jour des données!
ja: プロフィール情報追加完了。
ko: 완료되었습니다.
zh_hans: 完善资料成功！

# lUersNameExit
source: The username has been registered; please user other names!
ar: اسم المستخدم مسجل, الرجاء استخدام أسماء أخرى!
fr: Le nom d’utilisateur a déjà été utilisé, choisissez-en un autre
ja: 入力したユーザー名存在しています。他のユーザー名で試してください。
ko: 이미 존재하는 아이디입니다.
zh_hans: 用户名已存在，请使用其他用户名！！

# lEmailExit
source: The mailbox has been registered!
ar: تم تسجيل صندوق البريد!
fr: L’email a déjà été enregistré!
ja: メールアドレスはすでに登録されています。
ko: 이미 등록된 이메일 입니다.
zh_hans: 邮箱已被注册！

# lHeaderimg
source: Head portrait
ar: صورة رأس
fr: Photo de portrait
ja: プロフィール写真
ko: 프로필 사진
zh_hans: 头像

# lUsername
source: Name
ar: اسم
fr: Nom
ja: お名前
ko: 이름
zh_hans: 姓名

# lGender
source: Gender
ar: جنس
fr: Sexe
ja: 性別
ko: 성별
zh_hans: 性别

# lBithDay
source: Date of birth
ar: تاريخ الولادة
fr: Date de naissance
ja: 生年月日
ko: 생일
zh_hans: 生日

# lSig
source: Signature
ar: التوقيع
ja: ムードメッセージ
ko: 상태메시지
zh_hans: 签名

# lOwerAuth
source: Owner authentication
ar: مصادقة المالك
fr: Authentification du propriétaire
ja: オーナー認証
ko: 사용자 인증
zh_hans: 车主认证

# noAuthenticationWarning
source: *You have no certified Ninebot balance vehicle
ko: *인증된 Ninebot시리즈 제품을 찾을 수 없습니다.
zh_hans: *您暂无已认证Ninebot系列平衡车

# lModifyPwd
source: Modify password
ar: تعديل كلمة المرور
fr: Modifier le mot de passe
ja: パスワード変更
ko: 비밀 번호 변경
zh_hans: 修改密码

# lUserSetting
source: Individual settings
ar: إعدادات فردية
fr: Paramètres individuels
ja: 個人設定
ko: 개인 설정
zh_hans: 个人设置

# lLogout
source: Logout
ar: تسجيل الخروج
fr: Déconnexion
ja: ログアウト
ko: 회원탈퇴
zh_hans: 注 销

# lSetSig
source: Set signature
ar: إعداد التوقيع
fr: Paramètre de signature
ja: ムードメッセージ設定
ko: 상태메시지 설정
zh_hans: 设置签名

# lFinishUserInfo
source: Complete the data
ar: استكمال البيانات
fr: Mettre à jour les données
ja: プロフィール情報追加
ko: 입력하신 정보를 재확인바랍니다.
zh_hans: 完善资料

# lMan
source: Male
ar: ذكر
fr: Homme
ja: 男
ko: 남
zh_hans: 男

# lWoman
source: Female
ar: أنثى
fr: Femme
ja: 女
ko: 여
zh_hans: 女
